[NoCoverage] ObjectLiteral
app.js:71:40
-          balances: savedData.balances || { cu: 0, revolut: 0, cash: 0 },
+          balances: savedData.balances || {},

[NoCoverage] ArrayDeclaration
app.js:72:48
-          transactions: savedData.transactions || [],
+          transactions: savedData.transactions || ["Stryker was here"],

[NoCoverage] BlockStatement
app.js:220:19
-     } catch (error) {
-       console.error("Error saving data:", error);
-       showUpdateNotification("Error saving data. Local storage may be full.");
-     }
+     } catch (error) {}

[NoCoverage] StringLiteral
app.js:221:19
-       console.error("Error saving data:", error);
+       console.error("", error);

[NoCoverage] StringLiteral
app.js:222:28
-       showUpdateNotification("Error saving data. Local storage may be full.");
+       showUpdateNotification("");

[NoCoverage] BlockStatement
app.js:257:56
-     if (!data.accounts || !Array.isArray(data.accounts)) {
-       // Initialize with default accounts if missing
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
-     }
+     if (!data.accounts || !Array.isArray(data.accounts)) {}

[NoCoverage] ArrayDeclaration
app.js:259:21
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
+       data.accounts = [];

[NoCoverage] ObjectLiteral
app.js:260:7
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         {},

[NoCoverage] StringLiteral
app.js:260:13
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:260:25
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:260:47
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:260:68
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "university", color: "" },

[NoCoverage] ObjectLiteral
app.js:261:7
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         {},

[NoCoverage] StringLiteral
app.js:261:13
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:261:30
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:261:47
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:261:69
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },

[NoCoverage] ObjectLiteral
app.js:262:7
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         {}

[NoCoverage] StringLiteral
app.js:262:13
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:262:27
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:262:41
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:262:67
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }

[NoCoverage] BlockStatement
app.js:267:48
-     if (!data.tags || !Array.isArray(data.tags)) {
-       data.tags = [];
-     }
+     if (!data.tags || !Array.isArray(data.tags)) {}

[NoCoverage] ArrayDeclaration
app.js:268:17
-       data.tags = [];
+       data.tags = ["Stryker was here"];

[NoCoverage] BlockStatement
app.js:272:50
-     if (!data.bills || !Array.isArray(data.bills)) {
-       data.bills = [];
-     }
+     if (!data.bills || !Array.isArray(data.bills)) {}

[NoCoverage] ArrayDeclaration
app.js:273:18
-       data.bills = [];
+       data.bills = ["Stryker was here"];

[NoCoverage] StringLiteral
app.js:287:100
-         <i class="fas fa-${account.icon} fa-2x" ${account.color ? `style="color:${account.color}"` : ''}></i>
+         <i class="fas fa-${account.icon} fa-2x" ${account.color ? `style="color:${account.color}"` : "Stryker was here!"}></i>

[NoCoverage] BlockStatement
app.js:308:51
-       editBtn.addEventListener("click", function(e) {
-         e.stopPropagation();
-         const accountId = this.getAttribute("data-id");
-         openEditAccountModal(accountId);
-       });
+       editBtn.addEventListener("click", function(e) {});

[NoCoverage] StringLiteral
app.js:310:43
-         const accountId = this.getAttribute("data-id");
+         const accountId = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:373:20
-     setTimeout(() => {
-       document.getElementById("new-account-name").focus();
-     }, 50);
+     setTimeout(() => {}, 50);

[NoCoverage] StringLiteral
app.js:374:29
-       document.getElementById("new-account-name").focus();
+       document.getElementById("").focus();

[NoCoverage] BlockStatement
app.js:397:22
-       setTimeout(() => {
-         nameInput.classList.remove("input-error");
-       }, 2000);
+       setTimeout(() => {}, 2000);

[NoCoverage] StringLiteral
app.js:398:34
-         nameInput.classList.remove("input-error");
+         nameInput.classList.remove("");

[NoCoverage] BlockStatement
app.js:411:70
-         while (data.accounts.some(account => account.id === uniqueId)) {
-           uniqueId = `${id}-${counter}`;
-           counter++;
-         }
+         while (data.accounts.some(account => account.id === uniqueId)) {}

[NoCoverage] StringLiteral
app.js:412:20
-           uniqueId = `${id}-${counter}`;
+           uniqueId = ``;

[NoCoverage] UpdateOperator
app.js:413:9
-           counter++;
+           counter--;

[NoCoverage] BlockStatement
app.js:435:24
-         setTimeout(() => {
-           idInput.classList.remove("input-error");
-         }, 2000);
+         setTimeout(() => {}, 2000);

[NoCoverage] StringLiteral
app.js:436:34
-           idInput.classList.remove("input-error");
+           idInput.classList.remove("");

[NoCoverage] StringLiteral
app.js:503:71
-     document.getElementById("new-account-icon").value = account.icon || "university";
+     document.getElementById("new-account-icon").value = account.icon || "";

[NoCoverage] StringLiteral
app.js:504:41
-     const accountColor = account.color || "#4a90e2";
+     const accountColor = account.color || "";

[NoCoverage] BlockStatement
app.js:534:58
-     if (!document.querySelector('.color-option.selected')) {
-       document.querySelectorAll('.color-option')[0].classList.add('selected');
-     }
+     if (!document.querySelector('.color-option.selected')) {}

[NoCoverage] StringLiteral
app.js:535:31
-       document.querySelectorAll('.color-option')[0].classList.add('selected');
+       document.querySelectorAll("")[0].classList.add('selected');

[NoCoverage] StringLiteral
app.js:535:65
-       document.querySelectorAll('.color-option')[0].classList.add('selected');
+       document.querySelectorAll('.color-option')[0].classList.add("");

[NoCoverage] BlockStatement
app.js:543:20
-     setTimeout(() => {
-       document.getElementById("new-account-name").focus();
-     }, 50);
+     setTimeout(() => {}, 50);

[NoCoverage] StringLiteral
app.js:544:29
-       document.getElementById("new-account-name").focus();
+       document.getElementById("").focus();

[NoCoverage] BlockStatement
app.js:553:56
-     if (!data.accounts || !Array.isArray(data.accounts)) {
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
-     }
+     if (!data.accounts || !Array.isArray(data.accounts)) {}

[NoCoverage] ArrayDeclaration
app.js:554:21
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
+       data.accounts = [];

[NoCoverage] ObjectLiteral
app.js:555:7
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         {},

[NoCoverage] StringLiteral
app.js:555:13
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:555:25
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:555:47
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:555:68
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "university", color: "" },

[NoCoverage] ObjectLiteral
app.js:556:7
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         {},

[NoCoverage] StringLiteral
app.js:556:13
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:556:30
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:556:47
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:556:69
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },

[NoCoverage] ObjectLiteral
app.js:557:7
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         {}

[NoCoverage] StringLiteral
app.js:557:13
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:557:27
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:557:41
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:557:67
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }

[NoCoverage] BlockStatement
app.js:626:49
-       option.addEventListener('click', function() {
-         // Remove selected class from all options
-         document.querySelectorAll('.icon-option').forEach(opt => opt.classList.remove('selected'));
-         
-         // Add selected class to this option
-         this.classList.add('selected');
-         
-         // Update the hidden input
-         document.getElementById('new-account-icon').value = this.getAttribute('data-icon');
-       });
+       option.addEventListener('click', function() {});

[NoCoverage] StringLiteral
app.js:628:33
-         document.querySelectorAll('.icon-option').forEach(opt => opt.classList.remove('selected'));
+         document.querySelectorAll("").forEach(opt => opt.classList.remove('selected'));

[NoCoverage] ArrowFunction
app.js:628:57
-         document.querySelectorAll('.icon-option').forEach(opt => opt.classList.remove('selected'));
+         document.querySelectorAll('.icon-option').forEach(() => undefined);

[NoCoverage] StringLiteral
app.js:628:85
-         document.querySelectorAll('.icon-option').forEach(opt => opt.classList.remove('selected'));
+         document.querySelectorAll('.icon-option').forEach(opt => opt.classList.remove(""));

[NoCoverage] StringLiteral
app.js:631:26
-         this.classList.add('selected');
+         this.classList.add("");

[NoCoverage] StringLiteral
app.js:634:31
-         document.getElementById('new-account-icon').value = this.getAttribute('data-icon');
+         document.getElementById("").value = this.getAttribute('data-icon');

[NoCoverage] StringLiteral
app.js:634:77
-         document.getElementById('new-account-icon').value = this.getAttribute('data-icon');
+         document.getElementById('new-account-icon').value = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:643:49
-       option.addEventListener('click', function() {
-         const color = this.getAttribute('data-color');
-         
-         // Remove selected class from all options
-         document.querySelectorAll('.color-option').forEach(opt => opt.classList.remove('selected'));
-         
-         // Add selected class to this option
-         this.classList.add('selected');
-         
-         // Update the hidden input
-         document.getElementById('new-account-color').value = color;
-         
-         // Update the name input border to reflect selected color
-         const nameInput = document.getElementById('new-account-name');
-         nameInput.style.borderLeft = `4px solid ${color}`;
-       });
+       option.addEventListener('click', function() {});

[NoCoverage] StringLiteral
app.js:644:39
-         const color = this.getAttribute('data-color');
+         const color = this.getAttribute("");

[NoCoverage] StringLiteral
app.js:647:33
-         document.querySelectorAll('.color-option').forEach(opt => opt.classList.remove('selected'));
+         document.querySelectorAll("").forEach(opt => opt.classList.remove('selected'));

[NoCoverage] ArrowFunction
app.js:647:58
-         document.querySelectorAll('.color-option').forEach(opt => opt.classList.remove('selected'));
+         document.querySelectorAll('.color-option').forEach(() => undefined);

[NoCoverage] StringLiteral
app.js:647:86
-         document.querySelectorAll('.color-option').forEach(opt => opt.classList.remove('selected'));
+         document.querySelectorAll('.color-option').forEach(opt => opt.classList.remove(""));

[NoCoverage] StringLiteral
app.js:650:26
-         this.classList.add('selected');
+         this.classList.add("");

[NoCoverage] StringLiteral
app.js:653:31
-         document.getElementById('new-account-color').value = color;
+         document.getElementById("").value = color;

[NoCoverage] StringLiteral
app.js:656:49
-         const nameInput = document.getElementById('new-account-name');
+         const nameInput = document.getElementById("");

[NoCoverage] StringLiteral
app.js:657:36
-         nameInput.style.borderLeft = `4px solid ${color}`;
+         nameInput.style.borderLeft = ``;

[NoCoverage] BlockStatement
app.js:680:52
-       nameInput.addEventListener('input', function() {
-         if (this.classList.contains('input-error')) {
-           this.classList.remove('input-error');
-         }
-       });
+       nameInput.addEventListener('input', function() {});

[NoCoverage] ConditionalExpression
app.js:681:11
-         if (this.classList.contains('input-error')) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:681:11
-         if (this.classList.contains('input-error')) {
+         if (false) {

[NoCoverage] StringLiteral
app.js:681:35
-         if (this.classList.contains('input-error')) {
+         if (this.classList.contains("")) {

[NoCoverage] BlockStatement
app.js:681:51
-         if (this.classList.contains('input-error')) {
-           this.classList.remove('input-error');
-         }
+         if (this.classList.contains('input-error')) {}

[NoCoverage] StringLiteral
app.js:682:31
-           this.classList.remove('input-error');
+           this.classList.remove("");

[NoCoverage] BlockStatement
app.js:702:20
-     setTimeout(() => {
-       notification.classList.add("fade-out");
-       setTimeout(() => {
-         notification.remove();
-       }, 500);
-     }, 3000);
+     setTimeout(() => {}, 3000);

[NoCoverage] StringLiteral
app.js:703:32
-       notification.classList.add("fade-out");
+       notification.classList.add("");

[NoCoverage] BlockStatement
app.js:704:22
-       setTimeout(() => {
-         notification.remove();
-       }, 500);
+       setTimeout(() => {}, 500);

[NoCoverage] BlockStatement
app.js:712:23
-     if (!data.balances) {
-       data.balances = { cu: 0, revolut: 0, cash: 0 };
-     }
+     if (!data.balances) {}

[NoCoverage] ObjectLiteral
app.js:713:21
-       data.balances = { cu: 0, revolut: 0, cash: 0 };
+       data.balances = {};

[NoCoverage] BlockStatement
app.js:726:56
-     if (!data.accounts || !Array.isArray(data.accounts)) {
-       return '#607d8b'; // Default color if accounts array is missing
-     }
+     if (!data.accounts || !Array.isArray(data.accounts)) {}

[NoCoverage] StringLiteral
app.js:727:12
-       return '#607d8b'; // Default color if accounts array is missing
+       return ""; // Default color if accounts array is missing

[NoCoverage] BlockStatement
app.js:742:53
-     if (filters.account && filters.account !== "all") {
-       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {
-         accountFilter.value = filters.account;
-       } else {
-         filters.account = "all";
-         accountFilter.value = "all";
-       }
-     }
+     if (filters.account && filters.account !== "all") {}

[NoCoverage] ConditionalExpression
app.js:743:9
-       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {
+       if (true) {

[NoCoverage] ConditionalExpression
app.js:743:9
-       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {
+       if (false) {

[NoCoverage] StringLiteral
app.js:743:37
-       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {
+       if (accountFilter.querySelector(``)) {

[NoCoverage] BlockStatement
app.js:743:76
-       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {
-         accountFilter.value = filters.account;
-       } else {
+       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {} else {

[NoCoverage] BlockStatement
app.js:745:12
-       } else {
-         filters.account = "all";
-         accountFilter.value = "all";
-       }
+       } else {}

[NoCoverage] StringLiteral
app.js:746:25
-         filters.account = "all";
+         filters.account = "";

[NoCoverage] StringLiteral
app.js:747:29
-         accountFilter.value = "all";
+         accountFilter.value = "";

[NoCoverage] BlockStatement
app.js:766:56
-     if (!data.accounts || !Array.isArray(data.accounts)) {
-       // Initialize with default accounts if missing
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
-     }
+     if (!data.accounts || !Array.isArray(data.accounts)) {}

[NoCoverage] ArrayDeclaration
app.js:768:21
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
+       data.accounts = [];

[NoCoverage] ObjectLiteral
app.js:769:7
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         {},

[NoCoverage] StringLiteral
app.js:769:13
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:769:25
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:769:47
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:769:68
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "university", color: "" },

[NoCoverage] ObjectLiteral
app.js:770:7
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         {},

[NoCoverage] StringLiteral
app.js:770:13
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:770:30
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:770:47
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:770:69
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },

[NoCoverage] ObjectLiteral
app.js:771:7
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         {}

[NoCoverage] StringLiteral
app.js:771:13
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:771:27
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:771:41
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:771:67
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }

[NoCoverage] BlockStatement
app.js:786:12
-       } else {
-         const option = document.createElement("option");
-         option.value = "all";
-         option.textContent = "All Accounts";
-         accountFilter.appendChild(option);
-       }
+       } else {}

[NoCoverage] StringLiteral
app.js:787:45
-         const option = document.createElement("option");
+         const option = document.createElement("");

[NoCoverage] StringLiteral
app.js:788:22
-         option.value = "all";
+         option.value = "";

[NoCoverage] StringLiteral
app.js:789:28
-         option.textContent = "All Accounts";
+         option.textContent = "";

[NoCoverage] BooleanLiteral
app.js:831:68
-       if (filters.type !== "all" && tx.type !== filters.type) return false;
+       if (filters.type !== "all" && tx.type !== filters.type) return true;

[NoCoverage] ConditionalExpression
app.js:840:5
-       case "date-asc":
-         filteredTransactions.sort((a, b) => new Date(a.date) - new Date(b.date));
-         break;
+       case "date-asc":

[NoCoverage] MethodExpression
app.js:841:7
-         filteredTransactions.sort((a, b) => new Date(a.date) - new Date(b.date));
+         filteredTransactions;

[NoCoverage] ArrowFunction
app.js:841:33
-         filteredTransactions.sort((a, b) => new Date(a.date) - new Date(b.date));
+         filteredTransactions.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:841:43
-         filteredTransactions.sort((a, b) => new Date(a.date) - new Date(b.date));
+         filteredTransactions.sort((a, b) => new Date(a.date) + new Date(b.date));

[NoCoverage] ConditionalExpression
app.js:843:5
-       case "amount-desc":
-         filteredTransactions.sort((a, b) => b.amount - a.amount);
-         break;
+       case "amount-desc":

[NoCoverage] MethodExpression
app.js:844:7
-         filteredTransactions.sort((a, b) => b.amount - a.amount);
+         filteredTransactions;

[NoCoverage] ArrowFunction
app.js:844:33
-         filteredTransactions.sort((a, b) => b.amount - a.amount);
+         filteredTransactions.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:844:43
-         filteredTransactions.sort((a, b) => b.amount - a.amount);
+         filteredTransactions.sort((a, b) => b.amount + a.amount);

[NoCoverage] ArithmeticOperator
app.js:847:43
-         filteredTransactions.sort((a, b) => a.amount - b.amount);
+         filteredTransactions.sort((a, b) => a.amount + b.amount);

[NoCoverage] StringLiteral
app.js:884:31
-             ${tx.description || "(no desc)"}
+             ${tx.description || ""}

[NoCoverage] ArrowFunction
app.js:892:9
-           (t) =>
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
-             t.type === tx.type &&
-             t.account === tx.account,
+           () => undefined,

[NoCoverage] ConditionalExpression
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
-             t.type === tx.type &&
-             t.account === tx.account,
+             true,

[NoCoverage] ConditionalExpression
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
-             t.type === tx.type &&
-             t.account === tx.account,
+             false,

[NoCoverage] LogicalOperator
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
-             t.type === tx.type &&
-             t.account === tx.account,
+             t.date === tx.date && t.amount === tx.amount && t.description === tx.description && t.type === tx.type || t.account === tx.account,

[NoCoverage] ConditionalExpression
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
-             t.type === tx.type &&
+             true &&

[NoCoverage] LogicalOperator
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
-             t.type === tx.type &&
+             t.date === tx.date && t.amount === tx.amount && t.description === tx.description || t.type === tx.type &&

[NoCoverage] ConditionalExpression
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
+             true &&

[NoCoverage] LogicalOperator
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
-             t.description === tx.description &&
+             t.date === tx.date && t.amount === tx.amount || t.description === tx.description &&

[NoCoverage] ConditionalExpression
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
+             true &&

[NoCoverage] LogicalOperator
app.js:893:11
-             t.date === tx.date &&
-             t.amount === tx.amount &&
+             t.date === tx.date || t.amount === tx.amount &&

[NoCoverage] ConditionalExpression
app.js:893:11
-             t.date === tx.date &&
+             true &&

[NoCoverage] EqualityOperator
app.js:893:11
-             t.date === tx.date &&
+             t.date !== tx.date &&

[NoCoverage] ConditionalExpression
app.js:894:11
-             t.amount === tx.amount &&
+             true &&

[NoCoverage] EqualityOperator
app.js:894:11
-             t.amount === tx.amount &&
+             t.amount !== tx.amount &&

[NoCoverage] ConditionalExpression
app.js:895:11
-             t.description === tx.description &&
+             true &&

[NoCoverage] EqualityOperator
app.js:895:11
-             t.description === tx.description &&
+             t.description !== tx.description &&

[NoCoverage] ConditionalExpression
app.js:896:11
-             t.type === tx.type &&
+             true &&
