[NoCoverage] BlockStatement
app.js:1101:28
-             function (error) {
-               console.log("Location error or permission denied:", error);
-               completeTransaction(null, attachments);
-             },
+             function (error) {},

[NoCoverage] StringLiteral
app.js:1102:25
-               console.log("Location error or permission denied:", error);
+               console.log("", error);

[NoCoverage] BlockStatement
app.js:1120:26
-           function (error) {
-             console.log("Location error or permission denied:", error);
-             completeTransaction(null);
-           },
+           function (error) {},

[NoCoverage] StringLiteral
app.js:1121:23
-             console.log("Location error or permission denied:", error);
+             console.log("", error);
