[NoCoverage] EqualityOperator
app.js:896:11
-             t.type === tx.type &&
+             t.type !== tx.type &&

[NoCoverage] ConditionalExpression
app.js:897:11
-             t.account === tx.account,
+             true,

[NoCoverage] EqualityOperator
app.js:897:11
-             t.account === tx.account,
+             t.account !== tx.account,

[NoCoverage] StringLiteral
app.js:901:45
-         const modal = document.getElementById("transaction-modal");
+         const modal = document.getElementById("");

[NoCoverage] StringLiteral
app.js:902:44
-         const info = document.getElementById("tx-info");
+         const info = document.getElementById("");

[NoCoverage] StringLiteral
app.js:903:50
-         const mapPreview = document.getElementById("map-preview");
+         const mapPreview = document.getElementById("");

[NoCoverage] StringLiteral
app.js:906:9
-           "<p><strong>Description:</strong> " +
+           "" +

[NoCoverage] ConditionalExpression
app.js:907:10
-           (tx.description || "(no desc)") +
+           (true) +

[NoCoverage] ConditionalExpression
app.js:907:10
-           (tx.description || "(no desc)") +
+           (false) +

[NoCoverage] LogicalOperator
app.js:907:10
-           (tx.description || "(no desc)") +
+           (tx.description && "(no desc)") +

[NoCoverage] StringLiteral
app.js:907:28
-           (tx.description || "(no desc)") +
+           (tx.description || "") +

[NoCoverage] StringLiteral
app.js:908:9
-           "</p>" +
+           "" +

[NoCoverage] StringLiteral
app.js:909:9
-           "<p><strong>Account:</strong> " +
+           "" +

[NoCoverage] ConditionalExpression
app.js:910:10
-           (tx.account === "cu"
+           (true

[NoCoverage] ConditionalExpression
app.js:910:10
-           (tx.account === "cu"
+           (false

[NoCoverage] EqualityOperator
app.js:910:10
-           (tx.account === "cu"
+           (tx.account !== "cu"

[NoCoverage] StringLiteral
app.js:910:25
-           (tx.account === "cu"
+           (tx.account === ""

[NoCoverage] StringLiteral
app.js:911:13
-             ? "Credit Union"
+             ? ""

[NoCoverage] ConditionalExpression
app.js:912:13
-             : tx.account === "revolut"
+             : true

[NoCoverage] ConditionalExpression
app.js:912:13
-             : tx.account === "revolut"
+             : false

[NoCoverage] EqualityOperator
app.js:912:13
-             : tx.account === "revolut"
+             : tx.account !== "revolut"

[NoCoverage] StringLiteral
app.js:912:28
-             : tx.account === "revolut"
+             : tx.account === ""

[NoCoverage] StringLiteral
app.js:913:15
-               ? "Revolut"
+               ? ""

[NoCoverage] StringLiteral
app.js:914:15
-               : "Cash") +
+               : "") +

[NoCoverage] StringLiteral
app.js:915:9
-           "</p>" +
+           "" +

[NoCoverage] StringLiteral
app.js:916:9
-           "<p><strong>Type:</strong> " +
+           "" +

[NoCoverage] StringLiteral
app.js:918:9
-           "</p>" +
+           "" +

[NoCoverage] StringLiteral
app.js:919:9
-           "<p><strong>Amount:</strong> " +
+           "" +

[NoCoverage] StringLiteral
app.js:921:9
-           "</p>" +
+           "" +

[NoCoverage] StringLiteral
app.js:922:9
-           "<p><strong>Date:</strong> " +
+           "" +

[NoCoverage] StringLiteral
app.js:924:9
-           "</p>" +
+           "" +

[NoCoverage] StringLiteral
app.js:925:9
-           "<p><strong>Category:</strong> " +
+           "" +

[NoCoverage] ConditionalExpression
app.js:926:10
-           (tx.category || "Uncategorized") +
+           (true) +

[NoCoverage] ConditionalExpression
app.js:926:10
-           (tx.category || "Uncategorized") +
+           (false) +

[NoCoverage] LogicalOperator
app.js:926:10
-           (tx.category || "Uncategorized") +
+           (tx.category && "Uncategorized") +

[NoCoverage] StringLiteral
app.js:926:25
-           (tx.category || "Uncategorized") +
+           (tx.category || "") +

[NoCoverage] StringLiteral
app.js:927:9
-           "</p>";
+           "";

[NoCoverage] ConditionalExpression
app.js:930:11
-         if (tx.isRecurring) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:930:11
-         if (tx.isRecurring) {
+         if (false) {

[NoCoverage] BlockStatement
app.js:930:27
-         if (tx.isRecurring) {
-           detailsHtml += "<p><strong>Recurring:</strong> Yes</p>";
-         }
+         if (tx.isRecurring) {}

[NoCoverage] StringLiteral
app.js:931:24
-           detailsHtml += "<p><strong>Recurring:</strong> Yes</p>";
+           detailsHtml += "";

[NoCoverage] ConditionalExpression
app.js:935:11
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:935:11
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (false) {

[NoCoverage] LogicalOperator
app.js:935:11
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (tx.notes || tx.notes.trim() !== "") {

[NoCoverage] ConditionalExpression
app.js:935:23
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (tx.notes && true) {

[NoCoverage] EqualityOperator
app.js:935:23
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (tx.notes && tx.notes.trim() === "") {

[NoCoverage] MethodExpression
app.js:935:23
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (tx.notes && tx.notes !== "") {

[NoCoverage] StringLiteral
app.js:935:43
-         if (tx.notes && tx.notes.trim() !== "") {
+         if (tx.notes && tx.notes.trim() !== "Stryker was here!") {

[NoCoverage] BlockStatement
app.js:935:47
-         if (tx.notes && tx.notes.trim() !== "") {
-           detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "</p>";
-         }
+         if (tx.notes && tx.notes.trim() !== "") {}

[NoCoverage] AssignmentOperator
app.js:936:9
-           detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "</p>";
+           detailsHtml -= "<p><strong>Notes:</strong> " + tx.notes + "</p>";

[NoCoverage] StringLiteral
app.js:936:24
-           detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "</p>";
+           detailsHtml += "" + tx.notes + "</p>";

[NoCoverage] StringLiteral
app.js:936:67
-           detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "</p>";
+           detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "";

[NoCoverage] ConditionalExpression
app.js:940:11
-         if (tx.attachments && tx.attachments.length > 0) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:940:11
-         if (tx.attachments && tx.attachments.length > 0) {
+         if (false) {

[NoCoverage] LogicalOperator
app.js:940:11
-         if (tx.attachments && tx.attachments.length > 0) {
+         if (tx.attachments || tx.attachments.length > 0) {

[NoCoverage] ConditionalExpression
app.js:940:29
-         if (tx.attachments && tx.attachments.length > 0) {
+         if (tx.attachments && true) {

[NoCoverage] EqualityOperator
app.js:940:29
-         if (tx.attachments && tx.attachments.length > 0) {
+         if (tx.attachments && tx.attachments.length >= 0) {

[NoCoverage] EqualityOperator
app.js:940:29
-         if (tx.attachments && tx.attachments.length > 0) {
+         if (tx.attachments && tx.attachments.length <= 0) {

[NoCoverage] BlockStatement
app.js:940:56
-         if (tx.attachments && tx.attachments.length > 0) {
-           detailsHtml +=
-             "<div class='attachment-section'><strong>Attachments:</strong><div class='attachment-list'>";
-           tx.attachments.forEach((attachment) => {
-             detailsHtml += `<div class='attachment-item'><img src='${attachment.data}' alt='Receipt'></div>`;
-           });
-           detailsHtml += "</div></div>";
-         }
+         if (tx.attachments && tx.attachments.length > 0) {}

[NoCoverage] StringLiteral
app.js:942:11
-             "<div class='attachment-section'><strong>Attachments:</strong><div class='attachment-list'>";
+             "";

[NoCoverage] BlockStatement
app.js:943:48
-           tx.attachments.forEach((attachment) => {
-             detailsHtml += `<div class='attachment-item'><img src='${attachment.data}' alt='Receipt'></div>`;
-           });
+           tx.attachments.forEach((attachment) => {});

[NoCoverage] StringLiteral
app.js:944:26
-             detailsHtml += `<div class='attachment-item'><img src='${attachment.data}' alt='Receipt'></div>`;
+             detailsHtml += ``;

[NoCoverage] StringLiteral
app.js:946:24
-           detailsHtml += "</div></div>";
+           detailsHtml += "";

[NoCoverage] StringLiteral
app.js:951:30
-         mapPreview.innerHTML = "";
+         mapPreview.innerHTML = "Stryker was here!";

[NoCoverage] ConditionalExpression
app.js:952:11
-         if (currentMap) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:952:11
-         if (currentMap) {
+         if (false) {

[NoCoverage] BlockStatement
app.js:952:23
-         if (currentMap) {
-           currentMap.remove();
-           currentMap = null;
-         }
+         if (currentMap) {}

[NoCoverage] StringLiteral
app.js:959:30
-         modal.classList.remove("hidden");
+         modal.classList.remove("");

[NoCoverage] StringLiteral
app.js:960:35
-         document.body.classList.add("modal-open");
+         document.body.classList.add("");

[NoCoverage] BlockStatement
app.js:965:24
-         setTimeout(() => {
-           if (tx.location) {
-             try {
-               currentMap = L.map("map-preview").setView(
-                 [tx.location.latitude, tx.location.longitude],
-                 13,
-               );
-               L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-                 attribution: "&copy; OpenStreetMap contributors",
-               }).addTo(currentMap);
-               L.marker([tx.location.latitude, tx.location.longitude]).addTo(
-                 currentMap,
-               );
-               // Force map to recalculate size
-               currentMap.invalidateSize();
-             } catch (e) {
-               console.error("Error initializing map:", e);
-               mapPreview.innerHTML =
-                 "<div class='no-location'>Error loading map</div>";
-             }
-           } else {
-             mapPreview.innerHTML =
-               "<div class='no-location'>No location data available</div>";
-           }
-         }, 100);
+         setTimeout(() => {}, 100);

[NoCoverage] ConditionalExpression
app.js:966:13
-           if (tx.location) {
+           if (true) {

[NoCoverage] ConditionalExpression
app.js:966:13
-           if (tx.location) {
+           if (false) {

[NoCoverage] BlockStatement
app.js:966:26
-           if (tx.location) {
-             try {
-               currentMap = L.map("map-preview").setView(
-                 [tx.location.latitude, tx.location.longitude],
-                 13,
-               );
-               L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-                 attribution: "&copy; OpenStreetMap contributors",
-               }).addTo(currentMap);
-               L.marker([tx.location.latitude, tx.location.longitude]).addTo(
-                 currentMap,
-               );
-               // Force map to recalculate size
-               currentMap.invalidateSize();
-             } catch (e) {
-               console.error("Error initializing map:", e);
-               mapPreview.innerHTML =
-                 "<div class='no-location'>Error loading map</div>";
-             }
-           } else {
+           if (tx.location) {} else {

[NoCoverage] BlockStatement
app.js:967:15
-             try {
-               currentMap = L.map("map-preview").setView(
-                 [tx.location.latitude, tx.location.longitude],
-                 13,
-               );
-               L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-                 attribution: "&copy; OpenStreetMap contributors",
-               }).addTo(currentMap);
-               L.marker([tx.location.latitude, tx.location.longitude]).addTo(
-                 currentMap,
-               );
-               // Force map to recalculate size
-               currentMap.invalidateSize();
-             } catch (e) {
+             try {} catch (e) {

[NoCoverage] StringLiteral
app.js:968:32
-               currentMap = L.map("map-preview").setView(
+               currentMap = L.map("").setView(

[NoCoverage] ArrayDeclaration
app.js:969:15
-                 [tx.location.latitude, tx.location.longitude],
+                 [],

[NoCoverage] StringLiteral
app.js:972:25
-               L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
+               L.tileLayer("", {

[NoCoverage] ObjectLiteral
app.js:972:79
-               L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-                 attribution: "&copy; OpenStreetMap contributors",
-               }).addTo(currentMap);
+               L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {}).addTo(currentMap);

[NoCoverage] StringLiteral
app.js:973:28
-                 attribution: "&copy; OpenStreetMap contributors",
+                 attribution: "",

[NoCoverage] ArrayDeclaration
app.js:975:22
-               L.marker([tx.location.latitude, tx.location.longitude]).addTo(
+               L.marker([]).addTo(

[NoCoverage] BlockStatement
app.js:980:23
-             } catch (e) {
-               console.error("Error initializing map:", e);
-               mapPreview.innerHTML =
-                 "<div class='no-location'>Error loading map</div>";
-             }
+             } catch (e) {}

[NoCoverage] StringLiteral
app.js:981:27
-               console.error("Error initializing map:", e);
+               console.error("", e);

[NoCoverage] StringLiteral
app.js:983:15
-                 "<div class='no-location'>Error loading map</div>";
+                 "";

[NoCoverage] BlockStatement
app.js:985:16
-           } else {
-             mapPreview.innerHTML =
-               "<div class='no-location'>No location data available</div>";
-           }
+           } else {}

[NoCoverage] StringLiteral
app.js:987:13
-               "<div class='no-location'>No location data available</div>";
+               "";

[NoCoverage] StringLiteral
app.js:1006:23
-     modal.classList.add("hidden");
+     modal.classList.add("");

[NoCoverage] BlockStatement
app.js:1024:37
-     if (tagsInput && tagsInput.value) {
-       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(tag => tag);
-     }
+     if (tagsInput && tagsInput.value) {}

[NoCoverage] MethodExpression
app.js:1025:12
-       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(tag => tag);
+       tags = tagsInput.value.split(',').map(tag => tag.trim());

[NoCoverage] StringLiteral
app.js:1025:34
-       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(tag => tag);
+       tags = tagsInput.value.split("").map(tag => tag.trim()).filter(tag => tag);

[NoCoverage] ArrowFunction
app.js:1025:43
-       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(tag => tag);
+       tags = tagsInput.value.split(',').map(() => undefined).filter(tag => tag);

[NoCoverage] MethodExpression
app.js:1025:50
-       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(tag => tag);
+       tags = tagsInput.value.split(',').map(tag => tag).filter(tag => tag);

[NoCoverage] ArrowFunction
app.js:1025:69
-       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(tag => tag);
+       tags = tagsInput.value.split(',').map(tag => tag.trim()).filter(() => undefined);

[NoCoverage] BlockStatement
app.js:1052:48
-       if (attachments && attachments.length > 0) {
-         transaction.attachments = attachments;
-       }
+       if (attachments && attachments.length > 0) {}

[NoCoverage] BlockStatement
app.js:1060:19
-       if (isPinned) {
-         data.settings.pinnedTransactions.push(txId);
-       }
+       if (isPinned) {}

[NoCoverage] BlockStatement
app.js:1065:22
-       if (isRecurring) {
-         // Add to recurring transactions with scheduling info
-         data.settings.recurringTransactions.push({
-           transactionId: txId,
-           schedule: "monthly", // Default to monthly
-           nextDueDate: new Date(date).setMonth(new Date(date).getMonth() + 1), // Next month
-         });
-       }
+       if (isRecurring) {}

[NoCoverage] ObjectLiteral
app.js:1067:48
-         data.settings.recurringTransactions.push({
-           transactionId: txId,
-           schedule: "monthly", // Default to monthly
-           nextDueDate: new Date(date).setMonth(new Date(date).getMonth() + 1), // Next month
-         });
+         data.settings.recurringTransactions.push({});

[NoCoverage] StringLiteral
app.js:1069:19
-           schedule: "monthly", // Default to monthly
+           schedule: "", // Default to monthly

[NoCoverage] MethodExpression
app.js:1070:22
-           nextDueDate: new Date(date).setMonth(new Date(date).getMonth() + 1), // Next month
+           nextDueDate: new Date(date).setFullYear(new Date(date).getMonth() + 1), // Next month

[NoCoverage] ArithmeticOperator
app.js:1070:46
-           nextDueDate: new Date(date).setMonth(new Date(date).getMonth() + 1), // Next month
+           nextDueDate: new Date(date).setMonth(new Date(date).getMonth() - 1), // Next month

[NoCoverage] BlockStatement
app.js:1087:35
-     if (fileInput.files.length > 0) {
-       processAttachments(fileInput.files).then((attachments) => {
-         // Request geolocation if available
-         if (navigator.geolocation) {
-           navigator.geolocation.getCurrentPosition(
-             function (position) {
-               completeTransaction(
-                 {
-                   latitude: position.coords.latitude,
-                   longitude: position.coords.longitude,
-                 },
-                 attachments,
-               );
-             },
-             function (error) {
-               console.log("Location error or permission denied:", error);
-               completeTransaction(null, attachments);
-             },
-           );
-         } else {
-           completeTransaction(null, attachments);
-         }
-       });
-     } else {
+     if (fileInput.files.length > 0) {} else {

[NoCoverage] BlockStatement
app.js:1088:63
-       processAttachments(fileInput.files).then((attachments) => {
-         // Request geolocation if available
-         if (navigator.geolocation) {
-           navigator.geolocation.getCurrentPosition(
-             function (position) {
-               completeTransaction(
-                 {
-                   latitude: position.coords.latitude,
-                   longitude: position.coords.longitude,
-                 },
-                 attachments,
-               );
-             },
-             function (error) {
-               console.log("Location error or permission denied:", error);
-               completeTransaction(null, attachments);
-             },
-           );
-         } else {
-           completeTransaction(null, attachments);
-         }
-       });
+       processAttachments(fileInput.files).then((attachments) => {});

[NoCoverage] ConditionalExpression
app.js:1090:11
-         if (navigator.geolocation) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:1090:11
-         if (navigator.geolocation) {
+         if (false) {

[NoCoverage] BlockStatement
app.js:1090:34
-         if (navigator.geolocation) {
-           navigator.geolocation.getCurrentPosition(
-             function (position) {
-               completeTransaction(
-                 {
-                   latitude: position.coords.latitude,
-                   longitude: position.coords.longitude,
-                 },
-                 attachments,
-               );
-             },
-             function (error) {
-               console.log("Location error or permission denied:", error);
-               completeTransaction(null, attachments);
-             },
-           );
-         } else {
+         if (navigator.geolocation) {} else {

[NoCoverage] BlockStatement
app.js:1092:31
-             function (position) {
-               completeTransaction(
-                 {
-                   latitude: position.coords.latitude,
-                   longitude: position.coords.longitude,
-                 },
-                 attachments,
-               );
-             },
+             function (position) {},

[NoCoverage] ObjectLiteral
app.js:1094:15
-                 {
-                   latitude: position.coords.latitude,
-                   longitude: position.coords.longitude,
-                 },
+                 {},

[NoCoverage] BlockStatement
app.js:1106:14
-         } else {
-           completeTransaction(null, attachments);
-         }
+         } else {}

[NoCoverage] BlockStatement
app.js:1125:12
-       } else {
-         completeTransaction(null);
-       }
+       } else {}

[NoCoverage] BlockStatement
app.js:1159:19
-     if (currentMap) {
-       currentMap.remove();
-       currentMap = null;
-     }
+     if (currentMap) {}

[NoCoverage] StringLiteral
app.js:1175:69
-     document.getElementById("edit-tx-desc").value = tx.description || "";
+     document.getElementById("edit-tx-desc").value = tx.description || "Stryker was here!";

[NoCoverage] StringLiteral
app.js:1177:70
-     document.getElementById("edit-tx-category").value = tx.category || "Other";
+     document.getElementById("edit-tx-category").value = tx.category || "";

[NoCoverage] StringLiteral
app.js:1181:64
-     document.getElementById("edit-tx-notes").value = tx.notes || "";
+     document.getElementById("edit-tx-notes").value = tx.notes || "Stryker was here!";

[NoCoverage] BlockStatement
app.js:1188:52
-     if (tx.attachments && tx.attachments.length > 0) {
-       tx.attachments.forEach((attachment, i) => {
-         const img = document.createElement("div");
-         img.className = "attachment-preview";
-         img.innerHTML = `
-           <img src="${attachment.data}" alt="Attachment ${i + 1}">
-           <button type="button" class="remove-attachment" data-index="${i}">×</button>
-         `;
-         attachmentContainer.appendChild(img);
-       });
-       // Add event listeners to remove buttons
-       attachmentContainer
-         .querySelectorAll(".remove-attachment")
-         .forEach((btn) => {
-           btn.addEventListener("click", function () {
-             const attachmentIndex = parseInt(this.dataset.index);
-             // We'll update the attachments array in the saveEditedTransaction function
-             this.parentElement.remove();
-           });
-         });
-     }
+     if (tx.attachments && tx.attachments.length > 0) {}

[NoCoverage] BlockStatement
app.js:1189:47
-       tx.attachments.forEach((attachment, i) => {
-         const img = document.createElement("div");
-         img.className = "attachment-preview";
-         img.innerHTML = `
-           <img src="${attachment.data}" alt="Attachment ${i + 1}">
-           <button type="button" class="remove-attachment" data-index="${i}">×</button>
-         `;
-         attachmentContainer.appendChild(img);
-       });
+       tx.attachments.forEach((attachment, i) => {});

[NoCoverage] StringLiteral
app.js:1190:42
-         const img = document.createElement("div");
+         const img = document.createElement("");

[NoCoverage] StringLiteral
app.js:1191:23
-         img.className = "attachment-preview";
+         img.className = "";

[NoCoverage] StringLiteral
app.js:1192:23
-         img.innerHTML = `
-           <img src="${attachment.data}" alt="Attachment ${i + 1}">
-           <button type="button" class="remove-attachment" data-index="${i}">×</button>
-         `;
+         img.innerHTML = ``;

[NoCoverage] ArithmeticOperator
app.js:1193:57
-           <img src="${attachment.data}" alt="Attachment ${i + 1}">
+           <img src="${attachment.data}" alt="Attachment ${i - 1}">

[NoCoverage] StringLiteral
app.js:1201:25
-         .querySelectorAll(".remove-attachment")
+         .querySelectorAll("")

[NoCoverage] BlockStatement
app.js:1202:25
-         .forEach((btn) => {
-           btn.addEventListener("click", function () {
-             const attachmentIndex = parseInt(this.dataset.index);
-             // We'll update the attachments array in the saveEditedTransaction function
-             this.parentElement.remove();
-           });
-         });
+         .forEach((btn) => {});

[NoCoverage] StringLiteral
app.js:1203:30
-           btn.addEventListener("click", function () {
+           btn.addEventListener("", function () {

[NoCoverage] BlockStatement
app.js:1203:51
-           btn.addEventListener("click", function () {
-             const attachmentIndex = parseInt(this.dataset.index);
-             // We'll update the attachments array in the saveEditedTransaction function
-             this.parentElement.remove();
-           });
+           btn.addEventListener("click", function () {});

[NoCoverage] BlockStatement
app.js:1216:19
-     if (currentMap) {
-       currentMap.remove();
-       currentMap = null;
-     }
+     if (currentMap) {}

[NoCoverage] ArrayDeclaration
app.js:1240:57
-     const existingAttachments = [...(oldTx.attachments || [])];
+     const existingAttachments = [...(oldTx.attachments || ["Stryker was here"])];

[NoCoverage] BooleanLiteral
app.js:1247:15
-       (_, i) => !removedIndices.includes(i),
+       (_, i) => removedIndices.includes(i),

[NoCoverage] ArrayDeclaration
app.js:1258:32
-           const allAttachments = [...remainingAttachments, ...attachments];
+           const allAttachments = [];

[NoCoverage] AssignmentOperator
app.js:1261:9
-           data.balances[oldTx.account] -=
-             oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+           data.balances[oldTx.account] += oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;

[NoCoverage] ConditionalExpression
app.js:1262:11
-             oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+             true ? -oldTx.amount : oldTx.amount;

[NoCoverage] ConditionalExpression
app.js:1262:11
-             oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+             false ? -oldTx.amount : oldTx.amount;

[NoCoverage] EqualityOperator
app.js:1262:11
-             oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+             oldTx.type !== "expense" ? -oldTx.amount : oldTx.amount;

[NoCoverage] StringLiteral
app.js:1262:26
-             oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+             oldTx.type === "" ? -oldTx.amount : oldTx.amount;

[NoCoverage] UnaryOperator
app.js:1262:38
-             oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+             oldTx.type === "expense" ? +oldTx.amount : oldTx.amount;

[NoCoverage] AssignmentOperator
app.js:1265:9
-           data.balances[newAccount] +=
-             newType === "expense" ? -newAmount : newAmount;
+           data.balances[newAccount] -= newType === "expense" ? -newAmount : newAmount;

[NoCoverage] ConditionalExpression
app.js:1266:11
-             newType === "expense" ? -newAmount : newAmount;
+             true ? -newAmount : newAmount;

[NoCoverage] ConditionalExpression
app.js:1266:11
-             newType === "expense" ? -newAmount : newAmount;
+             false ? -newAmount : newAmount;

[NoCoverage] EqualityOperator
app.js:1266:11
-             newType === "expense" ? -newAmount : newAmount;
+             newType !== "expense" ? -newAmount : newAmount;

[NoCoverage] StringLiteral
app.js:1266:23
-             newType === "expense" ? -newAmount : newAmount;
+             newType === "" ? -newAmount : newAmount;

[NoCoverage] UnaryOperator
app.js:1266:35
-             newType === "expense" ? -newAmount : newAmount;
+             newType === "expense" ? +newAmount : newAmount;

[NoCoverage] ConditionalExpression
app.js:1270:11
-             oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+             true;

[NoCoverage] ConditionalExpression
app.js:1270:11
-             oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+             false;

[NoCoverage] LogicalOperator
app.js:1270:11
-             oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+             oldTx.id && "tx-" + Math.random().toString(36).substr(2, 9);

[NoCoverage] StringLiteral
app.js:1270:23
-             oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+             oldTx.id || "" + Math.random().toString(36).substr(2, 9);

[NoCoverage] MethodExpression
app.js:1270:31
-             oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+             oldTx.id || "tx-" + Math.random().toString(36);

[NoCoverage] ObjectLiteral
app.js:1273:27
-           const updatedTx = {
-             id: txId,
-             amount: newAmount,
-             account: newAccount,
-             type: newType,
-             description: newDesc,
-             date: newDate,
-             category: newCategory,
-             isRecurring,
-             isPinned,
-             notes,
-             location: oldTx.location, // Preserve original location data
-             attachments: allAttachments,
-           };
+           const updatedTx = {};

[NoCoverage] ConditionalExpression
app.js:1289:13
-           if (isPinned && !oldTx.isPinned) {
+           if (true) {

[NoCoverage] ConditionalExpression
app.js:1289:13
-           if (isPinned && !oldTx.isPinned) {
+           if (false) {

[NoCoverage] LogicalOperator
app.js:1289:13
-           if (isPinned && !oldTx.isPinned) {
+           if (isPinned || !oldTx.isPinned) {
