[NoCoverage] BooleanLiteral
app.js:1289:25
-           if (isPinned && !oldTx.isPinned) {
+           if (isPinned && oldTx.isPinned) {

[NoCoverage] BlockStatement
app.js:1289:42
-           if (isPinned && !oldTx.isPinned) {
-             // Add to pinned list
-             if (!data.settings.pinnedTransactions.includes(txId)) {
-               data.settings.pinnedTransactions.push(txId);
-             }
-           } else if (!isPinned && oldTx.isPinned) {
+           if (isPinned && !oldTx.isPinned) {} else if (!isPinned && oldTx.isPinned) {

[NoCoverage] BooleanLiteral
app.js:1291:15
-             if (!data.settings.pinnedTransactions.includes(txId)) {
+             if (data.settings.pinnedTransactions.includes(txId)) {

[NoCoverage] ConditionalExpression
app.js:1291:15
-             if (!data.settings.pinnedTransactions.includes(txId)) {
+             if (true) {

[NoCoverage] ConditionalExpression
app.js:1291:15
-             if (!data.settings.pinnedTransactions.includes(txId)) {
+             if (false) {

[NoCoverage] BlockStatement
app.js:1291:65
-             if (!data.settings.pinnedTransactions.includes(txId)) {
-               data.settings.pinnedTransactions.push(txId);
-             }
+             if (!data.settings.pinnedTransactions.includes(txId)) {}

[NoCoverage] ConditionalExpression
app.js:1294:20
-           } else if (!isPinned && oldTx.isPinned) {
+           } else if (true) {

[NoCoverage] ConditionalExpression
app.js:1294:20
-           } else if (!isPinned && oldTx.isPinned) {
+           } else if (false) {

[NoCoverage] LogicalOperator
app.js:1294:20
-           } else if (!isPinned && oldTx.isPinned) {
+           } else if (!isPinned || oldTx.isPinned) {

[NoCoverage] BooleanLiteral
app.js:1294:20
-           } else if (!isPinned && oldTx.isPinned) {
+           } else if (isPinned && oldTx.isPinned) {

[NoCoverage] BlockStatement
app.js:1294:49
-           } else if (!isPinned && oldTx.isPinned) {
-             // Remove from pinned list
-             data.settings.pinnedTransactions =
-               data.settings.pinnedTransactions.filter((id) => id !== txId);
-           }
+           } else if (!isPinned && oldTx.isPinned) {}

[NoCoverage] MethodExpression
app.js:1297:13
-               data.settings.pinnedTransactions.filter((id) => id !== txId);
+               data.settings.pinnedTransactions;

[NoCoverage] ArrowFunction
app.js:1297:53
-               data.settings.pinnedTransactions.filter((id) => id !== txId);
+               data.settings.pinnedTransactions.filter(() => undefined);

[NoCoverage] ConditionalExpression
app.js:1297:61
-               data.settings.pinnedTransactions.filter((id) => id !== txId);
+               data.settings.pinnedTransactions.filter((id) => true);

[NoCoverage] ConditionalExpression
app.js:1297:61
-               data.settings.pinnedTransactions.filter((id) => id !== txId);
+               data.settings.pinnedTransactions.filter((id) => false);

[NoCoverage] EqualityOperator
app.js:1297:61
-               data.settings.pinnedTransactions.filter((id) => id !== txId);
+               data.settings.pinnedTransactions.filter((id) => id === txId);

[NoCoverage] StringLiteral
app.js:1311:33
-           document.getElementById("reset-confirm-modal").classList.add("hidden");
+           document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:1311:70
-           document.getElementById("reset-confirm-modal").classList.add("hidden");
+           document.getElementById("reset-confirm-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:1312:40
-           document.body.classList.remove("modal-open");
+           document.body.classList.remove("");

[NoCoverage] StringLiteral
app.js:1328:28
-     const txId = oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = oldTx.id || "" + Math.random().toString(36).substr(2, 9);

[NoCoverage] MethodExpression
app.js:1328:36
-     const txId = oldTx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = oldTx.id || "tx-" + Math.random().toString(36);

[NoCoverage] ConditionalExpression
app.js:1475:5
-       case "week":
-         startDate = new Date(now);
-         startDate.setDate(now.getDate() - 7);
-         interval = "day";
-         break;
+       case "week":

[NoCoverage] MethodExpression
app.js:1477:7
-         startDate.setDate(now.getDate() - 7);
+         startDate.setTime(now.getDate() - 7);

[NoCoverage] ArithmeticOperator
app.js:1477:25
-         startDate.setDate(now.getDate() - 7);
+         startDate.setDate(now.getDate() + 7);

[NoCoverage] StringLiteral
app.js:1478:18
-         interval = "day";
+         interval = "";

[NoCoverage] ConditionalExpression
app.js:1485:5
-       case "quarter":
-         startDate = new Date(now);
-         startDate.setMonth(now.getMonth() - 3);
-         interval = "week";
-         break;
+       case "quarter":

[NoCoverage] StringLiteral
app.js:1485:10
-       case "quarter":
+       case "":

[NoCoverage] MethodExpression
app.js:1487:7
-         startDate.setMonth(now.getMonth() - 3);
+         startDate.setFullYear(now.getMonth() - 3);

[NoCoverage] ArithmeticOperator
app.js:1487:26
-         startDate.setMonth(now.getMonth() - 3);
+         startDate.setMonth(now.getMonth() + 3);

[NoCoverage] StringLiteral
app.js:1488:18
-         interval = "week";
+         interval = "";

[NoCoverage] ConditionalExpression
app.js:1490:5
-       case "year":
-         startDate = new Date(now);
-         startDate.setFullYear(now.getFullYear() - 1);
-         interval = "month";
-         break;
+       case "year":

[NoCoverage] StringLiteral
app.js:1490:10
-       case "year":
+       case "":

[NoCoverage] MethodExpression
app.js:1492:7
-         startDate.setFullYear(now.getFullYear() - 1);
+         startDate.setMonth(now.getFullYear() - 1);

[NoCoverage] ArithmeticOperator
app.js:1492:29
-         startDate.setFullYear(now.getFullYear() - 1);
+         startDate.setFullYear(now.getFullYear() + 1);

[NoCoverage] StringLiteral
app.js:1493:18
-         interval = "month";
+         interval = "";

[NoCoverage] ConditionalExpression
app.js:1495:5
-       default:
-         startDate = new Date(now);
-         startDate.setDate(now.getDate() - 7);
-         interval = "day";
+       default:

[NoCoverage] MethodExpression
app.js:1497:7
-         startDate.setDate(now.getDate() - 7);
+         startDate.setTime(now.getDate() - 7);

[NoCoverage] ArithmeticOperator
app.js:1497:25
-         startDate.setDate(now.getDate() - 7);
+         startDate.setDate(now.getDate() + 7);

[NoCoverage] StringLiteral
app.js:1498:18
-         interval = "day";
+         interval = "";

[NoCoverage] ConditionalExpression
app.js:1512:7
-         case "week":
-           current.setDate(current.getDate() + 7);
-           break;
+         case "week":

[NoCoverage] StringLiteral
app.js:1512:12
-         case "week":
+         case "":

[NoCoverage] MethodExpression
app.js:1513:9
-           current.setDate(current.getDate() + 7);
+           current.setTime(current.getDate() + 7);

[NoCoverage] ArithmeticOperator
app.js:1513:25
-           current.setDate(current.getDate() + 7);
+           current.setDate(current.getDate() - 7);

[NoCoverage] ConditionalExpression
app.js:1515:7
-         case "month":
-           current.setMonth(current.getMonth() + 1);
-           break;
+         case "month":

[NoCoverage] StringLiteral
app.js:1515:12
-         case "month":
+         case "":

[NoCoverage] MethodExpression
app.js:1516:9
-           current.setMonth(current.getMonth() + 1);
+           current.setFullYear(current.getMonth() + 1);

[NoCoverage] ArithmeticOperator
app.js:1516:26
-           current.setMonth(current.getMonth() + 1);
+           current.setMonth(current.getMonth() - 1);

[NoCoverage] ConditionalExpression
app.js:1528:15
-         (tx) => new Date(tx.date) <= date,
+         (tx) => true,

[NoCoverage] ConditionalExpression
app.js:1528:15
-         (tx) => new Date(tx.date) <= date,
+         (tx) => false,

[NoCoverage] EqualityOperator
app.js:1528:15
-         (tx) => new Date(tx.date) <= date,
+         (tx) => new Date(tx.date) < date,

[NoCoverage] EqualityOperator
app.js:1528:15
-         (tx) => new Date(tx.date) <= date,
+         (tx) => new Date(tx.date) > date,

[NoCoverage] ConditionalExpression
app.js:1541:17
-           (tx) => new Date(tx.date) > date,
+           (tx) => true,

[NoCoverage] ConditionalExpression
app.js:1541:17
-           (tx) => new Date(tx.date) > date,
+           (tx) => false,

[NoCoverage] EqualityOperator
app.js:1541:17
-           (tx) => new Date(tx.date) > date,
+           (tx) => new Date(tx.date) >= date,

[NoCoverage] EqualityOperator
app.js:1541:17
-           (tx) => new Date(tx.date) > date,
+           (tx) => new Date(tx.date) <= date,

[NoCoverage] BlockStatement
app.js:1545:65
-         const adjustment = futureTransactions.reduce((sum, tx) => {
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
-         }, 0);
+         const adjustment = futureTransactions.reduce((sum, tx) => {}, 0);

[NoCoverage] ArithmeticOperator
app.js:1546:16
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum - (tx.type === "expense" ? tx.amount : -tx.amount);

[NoCoverage] ConditionalExpression
app.js:1546:23
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (true ? tx.amount : -tx.amount);

[NoCoverage] ConditionalExpression
app.js:1546:23
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (false ? tx.amount : -tx.amount);

[NoCoverage] EqualityOperator
app.js:1546:23
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (tx.type !== "expense" ? tx.amount : -tx.amount);

[NoCoverage] StringLiteral
app.js:1546:35
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (tx.type === "" ? tx.amount : -tx.amount);

[NoCoverage] UnaryOperator
app.js:1546:59
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (tx.type === "expense" ? tx.amount : +tx.amount);

[NoCoverage] BlockStatement
app.js:1551:12
-       } else {
-         // Calculate balance for specific account
-         let accountBalance = data.balances[account] || 0;
-         // Adjust for transactions not included in the current date
-         const futureTransactions = data.transactions.filter(
-           (tx) => tx.account === account && new Date(tx.date) > date,
-         );
-         // Calculate the effect of future transactions on the balance
-         const adjustment = futureTransactions.reduce((sum, tx) => {
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
-         }, 0);
-         // Add adjusted balance to array
-         balances.push(accountBalance - adjustment);
-       }
+       } else {}

[NoCoverage] ConditionalExpression
app.js:1553:28
-         let accountBalance = data.balances[account] || 0;
+         let accountBalance = true;

[NoCoverage] ConditionalExpression
app.js:1553:28
-         let accountBalance = data.balances[account] || 0;
+         let accountBalance = false;

[NoCoverage] LogicalOperator
app.js:1553:28
-         let accountBalance = data.balances[account] || 0;
+         let accountBalance = data.balances[account] && 0;

[NoCoverage] MethodExpression
app.js:1556:34
-         const futureTransactions = data.transactions.filter(
-           (tx) => tx.account === account && new Date(tx.date) > date,
-         );
+         const futureTransactions = data.transactions;

[NoCoverage] ArrowFunction
app.js:1557:9
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           () => undefined,

[NoCoverage] ConditionalExpression
app.js:1557:17
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => true,

[NoCoverage] ConditionalExpression
app.js:1557:17
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => false,

[NoCoverage] LogicalOperator
app.js:1557:17
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => tx.account === account || new Date(tx.date) > date,

[NoCoverage] ConditionalExpression
app.js:1557:17
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => true && new Date(tx.date) > date,

[NoCoverage] EqualityOperator
app.js:1557:17
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => tx.account !== account && new Date(tx.date) > date,

[NoCoverage] ConditionalExpression
app.js:1557:43
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => tx.account === account && true,

[NoCoverage] EqualityOperator
app.js:1557:43
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => tx.account === account && new Date(tx.date) >= date,

[NoCoverage] EqualityOperator
app.js:1557:43
-           (tx) => tx.account === account && new Date(tx.date) > date,
+           (tx) => tx.account === account && new Date(tx.date) <= date,

[NoCoverage] BlockStatement
app.js:1561:65
-         const adjustment = futureTransactions.reduce((sum, tx) => {
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
-         }, 0);
+         const adjustment = futureTransactions.reduce((sum, tx) => {}, 0);

[NoCoverage] ArithmeticOperator
app.js:1562:16
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum - (tx.type === "expense" ? tx.amount : -tx.amount);

[NoCoverage] ConditionalExpression
app.js:1562:23
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (true ? tx.amount : -tx.amount);

[NoCoverage] ConditionalExpression
app.js:1562:23
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (false ? tx.amount : -tx.amount);

[NoCoverage] EqualityOperator
app.js:1562:23
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (tx.type !== "expense" ? tx.amount : -tx.amount);

[NoCoverage] StringLiteral
app.js:1562:35
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (tx.type === "" ? tx.amount : -tx.amount);

[NoCoverage] UnaryOperator
app.js:1562:59
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
+           return sum + (tx.type === "expense" ? tx.amount : +tx.amount);

[NoCoverage] ArithmeticOperator
app.js:1566:21
-         balances.push(accountBalance - adjustment);
+         balances.push(accountBalance + adjustment);

[NoCoverage] ConditionalExpression
app.js:1578:7
-         case "week":
-           return date.toLocaleDateString("en-GB", {
-             day: "numeric",
-             month: "short",
-           });
+         case "week":

[NoCoverage] StringLiteral
app.js:1578:12
-         case "week":
+         case "":

[NoCoverage] StringLiteral
app.js:1579:40
-           return date.toLocaleDateString("en-GB", {
+           return date.toLocaleDateString("", {

[NoCoverage] ObjectLiteral
app.js:1579:49
-           return date.toLocaleDateString("en-GB", {
-             day: "numeric",
-             month: "short",
-           });
+           return date.toLocaleDateString("en-GB", {});

[NoCoverage] StringLiteral
app.js:1580:16
-             day: "numeric",
+             day: "",

[NoCoverage] StringLiteral
app.js:1581:18
-             month: "short",
+             month: "",

[NoCoverage] ConditionalExpression
app.js:1583:7
-         case "month":
-           return date.toLocaleDateString("en-GB", {
-             month: "short",
-             year: "numeric",
-           });
+         case "month":

[NoCoverage] StringLiteral
app.js:1583:12
-         case "month":
+         case "":

[NoCoverage] StringLiteral
app.js:1584:40
-           return date.toLocaleDateString("en-GB", {
+           return date.toLocaleDateString("", {

[NoCoverage] ObjectLiteral
app.js:1584:49
-           return date.toLocaleDateString("en-GB", {
-             month: "short",
-             year: "numeric",
-           });
+           return date.toLocaleDateString("en-GB", {});

[NoCoverage] StringLiteral
app.js:1585:18
-             month: "short",
+             month: "",

[NoCoverage] StringLiteral
app.js:1586:17
-             year: "numeric",
+             year: "",

[NoCoverage] BlockStatement
app.js:1606:26
-     if (account !== "all") {
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
-     }
+     if (account !== "all") {}

[NoCoverage] StringLiteral
app.js:1607:19
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ``;

[NoCoverage] ConditionalExpression
app.js:1607:25
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${true ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;

[NoCoverage] ConditionalExpression
app.js:1607:25
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${false ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;

[NoCoverage] EqualityOperator
app.js:1607:25
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account !== "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;

[NoCoverage] StringLiteral
app.js:1607:37
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;

[NoCoverage] StringLiteral
app.js:1607:44
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "" : account === "revolut" ? "Revolut" : "Cash"}`;

[NoCoverage] ConditionalExpression
app.js:1607:61
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "Credit Union" : true ? "Revolut" : "Cash"}`;

[NoCoverage] ConditionalExpression
app.js:1607:61
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "Credit Union" : false ? "Revolut" : "Cash"}`;

[NoCoverage] EqualityOperator
app.js:1607:61
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "Credit Union" : account !== "revolut" ? "Revolut" : "Cash"}`;

[NoCoverage] StringLiteral
app.js:1607:73
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "" ? "Revolut" : "Cash"}`;

[NoCoverage] StringLiteral
app.js:1607:85
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "" : "Cash"}`;

[NoCoverage] StringLiteral
app.js:1607:97
-       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : "Cash"}`;
+       chartTitle += ` - ${account === "cu" ? "Credit Union" : account === "revolut" ? "Revolut" : ""}`;

[NoCoverage] ConditionalExpression
app.js:1614:9
-         : account === "cu"
+         : true

[NoCoverage] ConditionalExpression
app.js:1614:9
-         : account === "cu"
+         : false

[NoCoverage] EqualityOperator
app.js:1614:9
-         : account === "cu"
+         : account !== "cu"

[NoCoverage] StringLiteral
app.js:1614:21
-         : account === "cu"
+         : account === ""

[NoCoverage] StringLiteral
app.js:1615:11
-           ? "#6a75ca"
+           ? ""

[NoCoverage] ConditionalExpression
app.js:1616:11
-           : account === "revolut"
+           : true

[NoCoverage] ConditionalExpression
app.js:1616:11
-           : account === "revolut"
+           : false

[NoCoverage] EqualityOperator
app.js:1616:11
-           : account === "revolut"
+           : account !== "revolut"

[NoCoverage] StringLiteral
app.js:1616:23
-           : account === "revolut"
+           : account === ""

[NoCoverage] StringLiteral
app.js:1617:13
-             ? "#f37736"
+             ? ""

[NoCoverage] StringLiteral
app.js:1618:13
-             : "#4caf50";
+             : "";

[NoCoverage] BlockStatement
app.js:1648:39
-               label: function (context) {
-                 return `Balance: ${formatAmt(context.raw)}`;
-               },
+               label: function (context) {},

[NoCoverage] StringLiteral
app.js:1649:22
-                 return `Balance: ${formatAmt(context.raw)}`;
+                 return ``;

[NoCoverage] BlockStatement
app.js:1658:40
-               callback: function (value) {
-                 return formatAmt(value);
-               },
+               callback: function (value) {},

[NoCoverage] StringLiteral
app.js:1670:64
-     const storedVersion = localStorage.getItem("app-version") || "0.0.0";
+     const storedVersion = localStorage.getItem("app-version") || "";

[NoCoverage] BlockStatement
app.js:1686:22
-       setTimeout(() => {
-         window.location.reload();
-       }, 1500);
+       setTimeout(() => {}, 1500);

[NoCoverage] BlockStatement
app.js:1753:41
-           if (processed === files.length) {
-             resolve(attachments);
-           }
+           if (processed === files.length) {}

[NoCoverage] StringLiteral
app.js:1776:73
-           document.documentElement.setAttribute("data-theme", e.matches ? "dark" : "light");
+           document.documentElement.setAttribute("data-theme", e.matches ? "" : "light");

[NoCoverage] BlockStatement
app.js:1786:24
-   function toggleTheme() {
-     const currentTheme = data.settings.theme || "light";
-     let newTheme;
-     
-     switch (currentTheme) {
-       case "light":
-         newTheme = "dark";
-         break;
-       case "dark":
-         newTheme = "system";
-         break;
-       default:
-         newTheme = "light";
-     }
-     
-     applyTheme(newTheme);
-     saveData();
-     
-     // Update theme buttons in settings if they exist
-     updateThemeButtons();
-   }
+   function toggleTheme() {}

[NoCoverage] ConditionalExpression
app.js:1787:24
-     const currentTheme = data.settings.theme || "light";
+     const currentTheme = true;

[NoCoverage] ConditionalExpression
app.js:1787:24
-     const currentTheme = data.settings.theme || "light";
+     const currentTheme = false;

[NoCoverage] LogicalOperator
app.js:1787:24
-     const currentTheme = data.settings.theme || "light";
+     const currentTheme = data.settings.theme && "light";

[NoCoverage] StringLiteral
app.js:1787:47
-     const currentTheme = data.settings.theme || "light";
+     const currentTheme = data.settings.theme || "";

[NoCoverage] ConditionalExpression
app.js:1791:5
-       case "light":
-         newTheme = "dark";
-         break;
+       case "light":

[NoCoverage] StringLiteral
app.js:1791:10
-       case "light":
+       case "":

[NoCoverage] StringLiteral
app.js:1792:18
-         newTheme = "dark";
+         newTheme = "";

[NoCoverage] ConditionalExpression
app.js:1794:5
-       case "dark":
-         newTheme = "system";
-         break;
+       case "dark":

[NoCoverage] StringLiteral
app.js:1794:10
-       case "dark":
+       case "":

[NoCoverage] StringLiteral
app.js:1795:18
-         newTheme = "system";
+         newTheme = "";

[NoCoverage] ConditionalExpression
app.js:1797:5
-       default:
-         newTheme = "light";
+       default:

[NoCoverage] StringLiteral
app.js:1798:18
-         newTheme = "light";
+         newTheme = "";

[NoCoverage] StringLiteral
app.js:1811:37
-     applyTheme(data.settings.theme || "light");
+     applyTheme(data.settings.theme || "");

[NoCoverage] StringLiteral
app.js:1814:94
-     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || '#4a90e2');
+     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || "");

[NoCoverage] StringLiteral
app.js:1815:105
-     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || '#4a90e2', -20));
+     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || "", -20));

[NoCoverage] StringLiteral
app.js:1816:106
-     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || '#4a90e2', 40, true));
+     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || "", 40, true));

[NoCoverage] StringLiteral
app.js:1861:73
-       totalBalanceWidget.style.display = widgets.totalBalance ? "block" : "none";
+       totalBalanceWidget.style.display = widgets.totalBalance ? "block" : "";

[NoCoverage] StringLiteral
app.js:1867:65
-       accountsSection.style.display = widgets.accounts ? "flex" : "none";
+       accountsSection.style.display = widgets.accounts ? "flex" : "";

[NoCoverage] BlockStatement
app.js:1916:90
-     document.getElementById("auto-create-recurring").addEventListener("change", function() {
-       data.settings.recurring.autoCreate = this.checked;
-       saveData();
-     });
+     document.getElementById("auto-create-recurring").addEventListener("change", function() {});

[NoCoverage] BlockStatement
app.js:1921:85
-     document.getElementById("notify-recurring").addEventListener("change", function() {
-       data.settings.recurring.notifications = this.checked;
-       saveData();
-     });
+     document.getElementById("notify-recurring").addEventListener("change", function() {});

[NoCoverage] BlockStatement
app.js:1927:88
-     document.getElementById("manage-recurring-btn").addEventListener("click", function() {
-       showRecurringTransactionsModal();
-     });
+     document.getElementById("manage-recurring-btn").addEventListener("click", function() {});

[NoCoverage] BlockStatement
app.js:1932:89
-     document.getElementById("manage-categories-btn").addEventListener("click", function() {
-       showCategoriesModal();
-     });
+     document.getElementById("manage-categories-btn").addEventListener("click", function() {});

[NoCoverage] BlockStatement
app.js:1947:49
-       button.addEventListener('click', function() {
-         const theme = this.getAttribute('data-theme');
-         applyTheme(theme);
-         updateThemeButtons();
-         saveData();
-       });
+       button.addEventListener('click', function() {});

[NoCoverage] StringLiteral
app.js:1948:39
-         const theme = this.getAttribute('data-theme');
+         const theme = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:1966:49
-       button.addEventListener('click', function() {
-         const color = this.getAttribute('data-color');
-         data.settings.accentColor = color;
-         
-         // Update active state
-         document.querySelectorAll('.color-selector .color-option').forEach(btn => {
-           btn.classList.remove('active');
-         });
-         this.classList.add('active');
-         
-         // Apply the color
-         document.documentElement.style.setProperty('--primary-color', color);
-         document.documentElement.style.setProperty('--primary-dark', adjustColor(color, -20));
-         document.documentElement.style.setProperty('--primary-light', adjustColor(color, 40, true));
-         
-         saveData();
-         showUpdateNotification("Accent color updated");
-       });
+       button.addEventListener('click', function() {});

[NoCoverage] StringLiteral
app.js:1967:39
-         const color = this.getAttribute('data-color');
+         const color = this.getAttribute("");

[NoCoverage] StringLiteral
app.js:1971:33
-         document.querySelectorAll('.color-selector .color-option').forEach(btn => {
+         document.querySelectorAll("").forEach(btn => {

[NoCoverage] BlockStatement
app.js:1971:81
-         document.querySelectorAll('.color-selector .color-option').forEach(btn => {
-           btn.classList.remove('active');
-         });
+         document.querySelectorAll('.color-selector .color-option').forEach(btn => {});

[NoCoverage] StringLiteral
app.js:1972:30
-           btn.classList.remove('active');
+           btn.classList.remove("");

[NoCoverage] StringLiteral
app.js:1974:26
-         this.classList.add('active');
+         this.classList.add("");

[NoCoverage] StringLiteral
app.js:1977:50
-         document.documentElement.style.setProperty('--primary-color', color);
+         document.documentElement.style.setProperty("", color);

[NoCoverage] StringLiteral
app.js:1978:50
-         document.documentElement.style.setProperty('--primary-dark', adjustColor(color, -20));
+         document.documentElement.style.setProperty("", adjustColor(color, -20));

[NoCoverage] UnaryOperator
app.js:1978:87
-         document.documentElement.style.setProperty('--primary-dark', adjustColor(color, -20));
+         document.documentElement.style.setProperty('--primary-dark', adjustColor(color, +20));
