[NoCoverage] StringLiteral
app.js:1979:50
-         document.documentElement.style.setProperty('--primary-light', adjustColor(color, 40, true));
+         document.documentElement.style.setProperty("", adjustColor(color, 40, true));

[NoCoverage] BooleanLiteral
app.js:1979:92
-         document.documentElement.style.setProperty('--primary-light', adjustColor(color, 40, true));
+         document.documentElement.style.setProperty('--primary-light', adjustColor(color, 40, false));

[NoCoverage] StringLiteral
app.js:1982:30
-         showUpdateNotification("Accent color updated");
+         showUpdateNotification("");

[NoCoverage] BlockStatement
app.js:1999:89
-     document.getElementById('widget-total-balance').addEventListener('change', function() {
-       data.settings.dashboard.widgets.totalBalance = this.checked;
-       saveData();
-       applyDashboardWidgets();
-     });
+     document.getElementById('widget-total-balance').addEventListener('change', function() {});

[NoCoverage] BlockStatement
app.js:2005:84
-     document.getElementById('widget-accounts').addEventListener('change', function() {
-       data.settings.dashboard.widgets.accounts = this.checked;
-       saveData();
-       applyDashboardWidgets();
-     });
+     document.getElementById('widget-accounts').addEventListener('change', function() {});

[NoCoverage] BlockStatement
app.js:2011:95
-     document.getElementById('widget-recent-transactions').addEventListener('change', function() {
-       data.settings.dashboard.widgets.recentTransactions = this.checked;
-       saveData();
-       applyDashboardWidgets();
-     });
+     document.getElementById('widget-recent-transactions').addEventListener('change', function() {});

[NoCoverage] BlockStatement
app.js:2017:90
-     document.getElementById('widget-upcoming-bills').addEventListener('change', function() {
-       data.settings.dashboard.widgets.upcomingBills = this.checked;
-       saveData();
-       applyDashboardWidgets();
-     });
+     document.getElementById('widget-upcoming-bills').addEventListener('change', function() {});

[NoCoverage] BlockStatement
app.js:2023:90
-     document.getElementById('widget-spending-chart').addEventListener('change', function() {
-       data.settings.dashboard.widgets.spendingChart = this.checked;
-       saveData();
-       applyDashboardWidgets();
-     });
+     document.getElementById('widget-spending-chart').addEventListener('change', function() {});

[NoCoverage] BlockStatement
app.js:2037:59
-     defaultViewSelect.addEventListener('change', function() {
-       data.settings.dashboard.defaultView = this.value;
-       saveData();
-     });
+     defaultViewSelect.addEventListener('change', function() {});

[NoCoverage] BlockStatement
app.js:2093:46
-       btn.addEventListener("click", function() {
-         const tag = this.getAttribute("data-tag");
-         removeTag(tag);
-       });
+       btn.addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2094:37
-         const tag = this.getAttribute("data-tag");
+         const tag = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:2168:54
-       if (data.settings.backup.googleDrive.lastBackup) {
-         const backupDate = new Date(data.settings.backup.googleDrive.lastBackup);
-         lastBackupInfo.textContent = `Last backup: ${backupDate.toLocaleString()}`;
-       } else {
+       if (data.settings.backup.googleDrive.lastBackup) {} else {

[NoCoverage] StringLiteral
app.js:2170:36
-         lastBackupInfo.textContent = `Last backup: ${backupDate.toLocaleString()}`;
+         lastBackupInfo.textContent = ``;

[NoCoverage] BlockStatement
app.js:2439:89
-       document.getElementById("recurring-close-btn").addEventListener("click", function() {
-         document.getElementById("recurring-tx-modal").classList.add("hidden");
-         document.body.classList.remove("modal-open");
-       });
+       document.getElementById("recurring-close-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2440:31
-         document.getElementById("recurring-tx-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:2440:67
-         document.getElementById("recurring-tx-modal").classList.add("hidden");
+         document.getElementById("recurring-tx-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:2441:38
-         document.body.classList.remove("modal-open");
+         document.body.classList.remove("");

[NoCoverage] BlockStatement
app.js:2444:87
-       document.getElementById("add-recurring-btn").addEventListener("click", function() {
-         // Show transaction modal with recurring checked
-         document.getElementById("recurring-tx-modal").classList.add("hidden");
-         document.getElementById("tx-modal").classList.remove("hidden");
-         document.getElementById("tx-recurring").checked = true;
-       });
+       document.getElementById("add-recurring-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2446:31
-         document.getElementById("recurring-tx-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:2446:67
-         document.getElementById("recurring-tx-modal").classList.add("hidden");
+         document.getElementById("recurring-tx-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:2447:31
-         document.getElementById("tx-modal").classList.remove("hidden");
+         document.getElementById("").classList.remove("hidden");

[NoCoverage] StringLiteral
app.js:2447:60
-         document.getElementById("tx-modal").classList.remove("hidden");
+         document.getElementById("tx-modal").classList.remove("");

[NoCoverage] StringLiteral
app.js:2448:31
-         document.getElementById("tx-recurring").checked = true;
+         document.getElementById("").checked = true;

[NoCoverage] BooleanLiteral
app.js:2448:57
-         document.getElementById("tx-recurring").checked = true;
+         document.getElementById("tx-recurring").checked = false;

[NoCoverage] ArrayDeclaration
app.js:2468:63
-     const recurringTxs = data.settings.recurringTransactions || [];
+     const recurringTxs = data.settings.recurringTransactions || ["Stryker was here"];

[NoCoverage] StringLiteral
app.js:2490:70
-           <button class="toggle-recurring-btn ${tx.active ? 'active' : ''}" data-id="${tx.id}">
+           <button class="toggle-recurring-btn ${tx.active ? 'active' : "Stryker was here!"}" data-id="${tx.id}">

[NoCoverage] StringLiteral
app.js:2491:56
-             <i class="fas fa-${tx.active ? 'toggle-on' : 'toggle-off'}"></i>
+             <i class="fas fa-${tx.active ? 'toggle-on' : ""}"></i>

[NoCoverage] BlockStatement
app.js:2507:46
-       btn.addEventListener("click", function() {
-         const txId = this.getAttribute("data-id");
-         toggleRecurringTransaction(txId);
-       });
+       btn.addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2508:38
-         const txId = this.getAttribute("data-id");
+         const txId = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:2514:46
-       btn.addEventListener("click", function() {
-         const txId = this.getAttribute("data-id");
-         editRecurringTransaction(txId);
-       });
+       btn.addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2515:38
-         const txId = this.getAttribute("data-id");
+         const txId = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:2521:46
-       btn.addEventListener("click", function() {
-         const txId = this.getAttribute("data-id");
-         deleteRecurringTransaction(txId);
-       });
+       btn.addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2522:38
-         const txId = this.getAttribute("data-id");
+         const txId = this.getAttribute("");

[NoCoverage] StringLiteral
app.js:2574:63
-     showUpdateNotification(`Recurring transaction ${tx.active ? 'activated' : 'deactivated'}`);
+     showUpdateNotification(`Recurring transaction ${tx.active ? "" : 'deactivated'}`);

[NoCoverage] ConditionalExpression
app.js:2609:7
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (true) {

[NoCoverage] ConditionalExpression
app.js:2609:7
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (false) {

[NoCoverage] LogicalOperator
app.js:2609:7
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (!data.bills && !Array.isArray(data.bills)) {

[NoCoverage] BooleanLiteral
app.js:2609:7
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (data.bills || !Array.isArray(data.bills)) {

[NoCoverage] BooleanLiteral
app.js:2609:22
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (!data.bills || Array.isArray(data.bills)) {

[NoCoverage] BlockStatement
app.js:2609:50
-     if (!data.bills || !Array.isArray(data.bills)) {
-       data.bills = [];
-     }
+     if (!data.bills || !Array.isArray(data.bills)) {}

[NoCoverage] ArrayDeclaration
app.js:2610:18
-       data.bills = [];
+       data.bills = ["Stryker was here"];

[NoCoverage] BooleanLiteral
app.js:2614:7
-     if (!document.getElementById("bill-calendar-widget")) {
+     if (document.getElementById("bill-calendar-widget")) {

[NoCoverage] ConditionalExpression
app.js:2614:7
-     if (!document.getElementById("bill-calendar-widget")) {
+     if (true) {

[NoCoverage] ConditionalExpression
app.js:2614:7
-     if (!document.getElementById("bill-calendar-widget")) {
+     if (false) {

[NoCoverage] StringLiteral
app.js:2614:32
-     if (!document.getElementById("bill-calendar-widget")) {
+     if (!document.getElementById("")) {

[NoCoverage] StringLiteral
app.js:2616:30
-       const billCalendarHTML = `
-         <section class="bill-calendar-container card">
-           <h2>Upcoming Bills</h2>
-           <div id="bill-calendar">
-             <div class="bill-calendar-header">
-               <button id="prev-month" class="calendar-nav-btn"><i class="fas fa-chevron-left"></i></button>
-               <h3 id="calendar-month">March 2023</h3>
-               <button id="next-month" class="calendar-nav-btn"><i class="fas fa-chevron-right"></i></button>
-             </div>
-             <div id="calendar-grid">
-               <!-- Calendar will be rendered here -->
-             </div>
-           </div>
-           <div class="bill-calendar-footer">
-             <button id="add-bill-btn" class="primary-btn"><i class="fas fa-plus"></i> Add Bill</button>
-           </div>
-         </section>
-       `;
+       const billCalendarHTML = ``;

[NoCoverage] StringLiteral
app.js:2636:53
-       const totalBalanceCard = document.querySelector(".total-balance.card");
+       const totalBalanceCard = document.querySelector("");

[NoCoverage] ConditionalExpression
app.js:2637:9
-       if (totalBalanceCard) {
+       if (true) {

[NoCoverage] ConditionalExpression
app.js:2637:9
-       if (totalBalanceCard) {
+       if (false) {

[NoCoverage] BlockStatement
app.js:2637:27
-       if (totalBalanceCard) {
-         totalBalanceCard.insertAdjacentHTML('afterend', billCalendarHTML);
-         
-         // Add event listeners
-         document.getElementById("prev-month").addEventListener("click", () => navigateCalendar(-1));
-         document.getElementById("next-month").addEventListener("click", () => navigateCalendar(1));
-         document.getElementById("add-bill-btn").addEventListener("click", showAddBillModal);
-         
-         // Render the calendar
-         renderCalendar(new Date());
-       }
+       if (totalBalanceCard) {}

[NoCoverage] StringLiteral
app.js:2638:43
-         totalBalanceCard.insertAdjacentHTML('afterend', billCalendarHTML);
+         totalBalanceCard.insertAdjacentHTML("", billCalendarHTML);

[NoCoverage] StringLiteral
app.js:2641:31
-         document.getElementById("prev-month").addEventListener("click", () => navigateCalendar(-1));
+         document.getElementById("").addEventListener("click", () => navigateCalendar(-1));

[NoCoverage] StringLiteral
app.js:2641:62
-         document.getElementById("prev-month").addEventListener("click", () => navigateCalendar(-1));
+         document.getElementById("prev-month").addEventListener("", () => navigateCalendar(-1));

[NoCoverage] ArrowFunction
app.js:2641:71
-         document.getElementById("prev-month").addEventListener("click", () => navigateCalendar(-1));
+         document.getElementById("prev-month").addEventListener("click", () => undefined);

[NoCoverage] UnaryOperator
app.js:2641:94
-         document.getElementById("prev-month").addEventListener("click", () => navigateCalendar(-1));
+         document.getElementById("prev-month").addEventListener("click", () => navigateCalendar(+1));

[NoCoverage] StringLiteral
app.js:2642:31
-         document.getElementById("next-month").addEventListener("click", () => navigateCalendar(1));
+         document.getElementById("").addEventListener("click", () => navigateCalendar(1));

[NoCoverage] StringLiteral
app.js:2642:62
-         document.getElementById("next-month").addEventListener("click", () => navigateCalendar(1));
+         document.getElementById("next-month").addEventListener("", () => navigateCalendar(1));

[NoCoverage] ArrowFunction
app.js:2642:71
-         document.getElementById("next-month").addEventListener("click", () => navigateCalendar(1));
+         document.getElementById("next-month").addEventListener("click", () => undefined);

[NoCoverage] StringLiteral
app.js:2643:31
-         document.getElementById("add-bill-btn").addEventListener("click", showAddBillModal);
+         document.getElementById("").addEventListener("click", showAddBillModal);

[NoCoverage] StringLiteral
app.js:2643:64
-         document.getElementById("add-bill-btn").addEventListener("click", showAddBillModal);
+         document.getElementById("add-bill-btn").addEventListener("", showAddBillModal);

[NoCoverage] BlockStatement
app.js:2648:10
-     } else {
-       // Just refresh the calendar if it already exists
-       renderCalendar(new Date());
-     }
+     } else {}

[NoCoverage] StringLiteral
app.js:2660:27
-     document.getElementById("calendar-month").textContent = 
+     document.getElementById("").textContent =

[NoCoverage] StringLiteral
app.js:2661:25
-       date.toLocaleString('default', { month: 'long', year: 'numeric' });
+       date.toLocaleString("", { month: 'long', year: 'numeric' });

[NoCoverage] ObjectLiteral
app.js:2661:36
-       date.toLocaleString('default', { month: 'long', year: 'numeric' });
+       date.toLocaleString('default', {});

[NoCoverage] StringLiteral
app.js:2661:45
-       date.toLocaleString('default', { month: 'long', year: 'numeric' });
+       date.toLocaleString('default', { month: "", year: 'numeric' });

[NoCoverage] StringLiteral
app.js:2661:59
-       date.toLocaleString('default', { month: 'long', year: 'numeric' });
+       date.toLocaleString('default', { month: 'long', year: "" });

[NoCoverage] StringLiteral
app.js:2664:28
-     calendarGrid.innerHTML = '';
+     calendarGrid.innerHTML = "Stryker was here!";

[NoCoverage] ArrayDeclaration
app.js:2667:20
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = [];

[NoCoverage] StringLiteral
app.js:2667:21
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ["", 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];

[NoCoverage] StringLiteral
app.js:2667:28
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ['Sun', "", 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];

[NoCoverage] StringLiteral
app.js:2667:35
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ['Sun', 'Mon', "", 'Wed', 'Thu', 'Fri', 'Sat'];

[NoCoverage] StringLiteral
app.js:2667:42
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ['Sun', 'Mon', 'Tue', "", 'Thu', 'Fri', 'Sat'];

[NoCoverage] StringLiteral
app.js:2667:49
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', "", 'Fri', 'Sat'];

[NoCoverage] StringLiteral
app.js:2667:56
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', "", 'Sat'];

[NoCoverage] StringLiteral
app.js:2667:63
-     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat'];
+     const weekdays = ['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri', ""];

[NoCoverage] BlockStatement
app.js:2668:27
-     weekdays.forEach(day => {
-       const dayEl = document.createElement("div");
-       dayEl.className = "calendar-day-header";
-       dayEl.textContent = day;
-       calendarGrid.appendChild(dayEl);
-     });
+     weekdays.forEach(day => {});

[NoCoverage] StringLiteral
app.js:2669:42
-       const dayEl = document.createElement("div");
+       const dayEl = document.createElement("");

[NoCoverage] StringLiteral
app.js:2670:23
-       dayEl.className = "calendar-day-header";
+       dayEl.className = "";

[NoCoverage] ArithmeticOperator
app.js:2677:48
-     const lastDay = new Date(date.getFullYear(), date.getMonth() + 1, 0);
+     const lastDay = new Date(date.getFullYear(), date.getMonth() - 1, 0);

[NoCoverage] ConditionalExpression
app.js:2680:19
-     for (let i = 0; i < firstDay.getDay(); i++) {
+     for (let i = 0; false; i++) {

[NoCoverage] EqualityOperator
app.js:2680:19
-     for (let i = 0; i < firstDay.getDay(); i++) {
+     for (let i = 0; i <= firstDay.getDay(); i++) {

[NoCoverage] EqualityOperator
app.js:2680:19
-     for (let i = 0; i < firstDay.getDay(); i++) {
+     for (let i = 0; i >= firstDay.getDay(); i++) {

[NoCoverage] UpdateOperator
app.js:2680:42
-     for (let i = 0; i < firstDay.getDay(); i++) {
+     for (let i = 0; i < firstDay.getDay(); i--) {

[NoCoverage] BlockStatement
app.js:2680:47
-     for (let i = 0; i < firstDay.getDay(); i++) {
-       const emptyDay = document.createElement("div");
-       emptyDay.className = "calendar-day empty";
-       calendarGrid.appendChild(emptyDay);
-     }
+     for (let i = 0; i < firstDay.getDay(); i++) {}

[NoCoverage] StringLiteral
app.js:2681:45
-       const emptyDay = document.createElement("div");
+       const emptyDay = document.createElement("");

[NoCoverage] StringLiteral
app.js:2682:26
-       emptyDay.className = "calendar-day empty";
+       emptyDay.className = "";

[NoCoverage] MethodExpression
app.js:2688:3
-     today.setHours(0, 0, 0, 0);
+     today.setMinutes(0, 0, 0, 0);

[NoCoverage] ConditionalExpression
app.js:2691:19
-     for (let i = 1; i <= lastDay.getDate(); i++) {
+     for (let i = 1; false; i++) {

[NoCoverage] EqualityOperator
app.js:2691:19
-     for (let i = 1; i <= lastDay.getDate(); i++) {
+     for (let i = 1; i < lastDay.getDate(); i++) {

[NoCoverage] EqualityOperator
app.js:2691:19
-     for (let i = 1; i <= lastDay.getDate(); i++) {
+     for (let i = 1; i > lastDay.getDate(); i++) {

[NoCoverage] UpdateOperator
app.js:2691:43
-     for (let i = 1; i <= lastDay.getDate(); i++) {
+     for (let i = 1; i <= lastDay.getDate(); i--) {

[NoCoverage] StringLiteral
app.js:2692:42
-       const dayEl = document.createElement("div");
+       const dayEl = document.createElement("");

[NoCoverage] StringLiteral
app.js:2696:23
-       dayEl.className = "calendar-day";
+       dayEl.className = "";

[NoCoverage] ConditionalExpression
app.js:2697:9
-       if (currentDate.getTime() === today.getTime()) {
+       if (true) {

[NoCoverage] ConditionalExpression
app.js:2697:9
-       if (currentDate.getTime() === today.getTime()) {
+       if (false) {

[NoCoverage] EqualityOperator
app.js:2697:9
-       if (currentDate.getTime() === today.getTime()) {
+       if (currentDate.getTime() !== today.getTime()) {

[NoCoverage] BlockStatement
app.js:2697:52
-       if (currentDate.getTime() === today.getTime()) {
-         dayEl.classList.add("today");
-       }
+       if (currentDate.getTime() === today.getTime()) {}

[NoCoverage] StringLiteral
app.js:2698:27
-         dayEl.classList.add("today");
+         dayEl.classList.add("");

[NoCoverage] StringLiteral
app.js:2702:47
-       const dateNumber = document.createElement("div");
+       const dateNumber = document.createElement("");

[NoCoverage] StringLiteral
app.js:2703:28
-       dateNumber.className = "date-number";
+       dateNumber.className = "";

[NoCoverage] StringLiteral
app.js:2708:53
-       const dateStr = currentDate.toISOString().split('T')[0];
+       const dateStr = currentDate.toISOString().split("")[0];

[NoCoverage] MethodExpression
app.js:2709:22
-       const dayBills = data.bills.filter(bill => {
-         const billDate = new Date(bill.date);
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
-                billDate.getFullYear() === date.getFullYear();
-       });
+       const dayBills = data.bills;

[NoCoverage] BlockStatement
app.js:2709:48
-       const dayBills = data.bills.filter(bill => {
-         const billDate = new Date(bill.date);
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
-                billDate.getFullYear() === date.getFullYear();
-       });
+       const dayBills = data.bills.filter(bill => {});

[NoCoverage] ConditionalExpression
app.js:2711:14
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
-                billDate.getFullYear() === date.getFullYear();
+         return true;

[NoCoverage] ConditionalExpression
app.js:2711:14
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
-                billDate.getFullYear() === date.getFullYear();
+         return false;

[NoCoverage] LogicalOperator
app.js:2711:14
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
-                billDate.getFullYear() === date.getFullYear();
+         return billDate.getDate() === i && billDate.getMonth() === date.getMonth() || billDate.getFullYear() === date.getFullYear();

[NoCoverage] ConditionalExpression
app.js:2711:14
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
+         return true &&

[NoCoverage] LogicalOperator
app.js:2711:14
-         return billDate.getDate() === i && 
-                billDate.getMonth() === date.getMonth() && 
+         return billDate.getDate() === i || billDate.getMonth() === date.getMonth() &&

[NoCoverage] ConditionalExpression
app.js:2711:14
-         return billDate.getDate() === i && 
+         return true &&

[NoCoverage] EqualityOperator
app.js:2711:14
-         return billDate.getDate() === i && 
+         return billDate.getDate() !== i &&

[NoCoverage] ConditionalExpression
app.js:2712:14
-                billDate.getMonth() === date.getMonth() && 
+                true &&

[NoCoverage] EqualityOperator
app.js:2712:14
-                billDate.getMonth() === date.getMonth() && 
+                billDate.getMonth() !== date.getMonth() &&

[NoCoverage] ConditionalExpression
app.js:2713:14
-                billDate.getFullYear() === date.getFullYear();
+                true;

[NoCoverage] EqualityOperator
app.js:2713:14
-                billDate.getFullYear() === date.getFullYear();
+                billDate.getFullYear() !== date.getFullYear();

[NoCoverage] ConditionalExpression
app.js:2716:9
-       if (dayBills.length > 0) {
+       if (true) {

[NoCoverage] ConditionalExpression
app.js:2716:9
-       if (dayBills.length > 0) {
+       if (false) {

[NoCoverage] EqualityOperator
app.js:2716:9
-       if (dayBills.length > 0) {
+       if (dayBills.length >= 0) {

[NoCoverage] EqualityOperator
app.js:2716:9
-       if (dayBills.length > 0) {
+       if (dayBills.length <= 0) {

[NoCoverage] BlockStatement
app.js:2716:30
-       if (dayBills.length > 0) {
-         const billsList = document.createElement("div");
-         billsList.className = "day-bills";
-         
-         dayBills.forEach(bill => {
-           const billItem = document.createElement("div");
-           billItem.className = "bill-item";
-           billItem.innerHTML = `
-             <span class="bill-amount">${formatAmt(bill.amount)}</span>
-             <span class="bill-name">${bill.description}</span>
-           `;
-           billItem.addEventListener("click", () => showBillDetails(bill.id));
-           billsList.appendChild(billItem);
-         });
-         
-         dayEl.appendChild(billsList);
-         dayEl.classList.add("has-bills");
-       }
+       if (dayBills.length > 0) {}

[NoCoverage] StringLiteral
app.js:2717:48
-         const billsList = document.createElement("div");
+         const billsList = document.createElement("");

[NoCoverage] StringLiteral
app.js:2718:29
-         billsList.className = "day-bills";
+         billsList.className = "";

[NoCoverage] BlockStatement
app.js:2720:32
-         dayBills.forEach(bill => {
-           const billItem = document.createElement("div");
-           billItem.className = "bill-item";
-           billItem.innerHTML = `
-             <span class="bill-amount">${formatAmt(bill.amount)}</span>
-             <span class="bill-name">${bill.description}</span>
-           `;
-           billItem.addEventListener("click", () => showBillDetails(bill.id));
-           billsList.appendChild(billItem);
-         });
+         dayBills.forEach(bill => {});

[NoCoverage] StringLiteral
app.js:2721:49
-           const billItem = document.createElement("div");
+           const billItem = document.createElement("");

[NoCoverage] StringLiteral
app.js:2722:30
-           billItem.className = "bill-item";
+           billItem.className = "";

[NoCoverage] StringLiteral
app.js:2723:30
-           billItem.innerHTML = `
-             <span class="bill-amount">${formatAmt(bill.amount)}</span>
-             <span class="bill-name">${bill.description}</span>
-           `;
+           billItem.innerHTML = ``;

[NoCoverage] StringLiteral
app.js:2727:35
-           billItem.addEventListener("click", () => showBillDetails(bill.id));
+           billItem.addEventListener("", () => showBillDetails(bill.id));

[NoCoverage] ArrowFunction
app.js:2727:44
-           billItem.addEventListener("click", () => showBillDetails(bill.id));
+           billItem.addEventListener("click", () => undefined);

[NoCoverage] StringLiteral
app.js:2732:27
-         dayEl.classList.add("has-bills");
+         dayEl.classList.add("");

[NoCoverage] BlockStatement
app.js:2740:40
-   function navigateCalendar(monthOffset) {
-     const currentMonth = document.getElementById("calendar-month").textContent;
-     const [monthName, year] = currentMonth.split(" ");
-     
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
-                         'July', 'August', 'September', 'October', 'November', 'December'];
-     const currentMonthIndex = monthNames.indexOf(monthName);
-     
-     const newDate = new Date(parseInt(year), currentMonthIndex + monthOffset, 1);
-     renderCalendar(newDate);
-   }
+   function navigateCalendar(monthOffset) {}

[NoCoverage] StringLiteral
app.js:2741:48
-     const currentMonth = document.getElementById("calendar-month").textContent;
+     const currentMonth = document.getElementById("").textContent;

[NoCoverage] StringLiteral
app.js:2742:48
-     const [monthName, year] = currentMonth.split(" ");
+     const [monthName, year] = currentMonth.split("");

[NoCoverage] ArrayDeclaration
app.js:2744:22
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+     const monthNames = [];

[NoCoverage] StringLiteral
app.js:2744:23
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
+     const monthNames = ["", 'February', 'March', 'April', 'May', 'June',

[NoCoverage] StringLiteral
app.js:2744:34
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
+     const monthNames = ['January', "", 'March', 'April', 'May', 'June',

[NoCoverage] StringLiteral
app.js:2744:46
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
+     const monthNames = ['January', 'February', "", 'April', 'May', 'June',

[NoCoverage] StringLiteral
app.js:2744:55
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
+     const monthNames = ['January', 'February', 'March', "", 'May', 'June',

[NoCoverage] StringLiteral
app.js:2744:64
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
+     const monthNames = ['January', 'February', 'March', 'April', "", 'June',

[NoCoverage] StringLiteral
app.js:2744:71
-     const monthNames = ['January', 'February', 'March', 'April', 'May', 'June', 
+     const monthNames = ['January', 'February', 'March', 'April', 'May', "",

[NoCoverage] StringLiteral
app.js:2745:23
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+                         "", 'August', 'September', 'October', 'November', 'December'];

[NoCoverage] StringLiteral
app.js:2745:31
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+                         'July', "", 'September', 'October', 'November', 'December'];
