[NoCoverage] StringLiteral
app.js:2745:41
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+                         'July', 'August', "", 'October', 'November', 'December'];

[NoCoverage] StringLiteral
app.js:2745:54
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+                         'July', 'August', 'September', "", 'November', 'December'];

[NoCoverage] StringLiteral
app.js:2745:65
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+                         'July', 'August', 'September', 'October', "", 'December'];

[NoCoverage] StringLiteral
app.js:2745:77
-                         'July', 'August', 'September', 'October', 'November', 'December'];
+                         'July', 'August', 'September', 'October', 'November', ""];

[NoCoverage] ArithmeticOperator
app.js:2748:44
-     const newDate = new Date(parseInt(year), currentMonthIndex + monthOffset, 1);
+     const newDate = new Date(parseInt(year), currentMonthIndex - monthOffset, 1);

[NoCoverage] BlockStatement
app.js:2811:84
-       document.getElementById("bill-close-btn").addEventListener("click", function() {
-         document.getElementById("bill-modal").classList.add("hidden");
-         document.body.classList.remove("modal-open");
-       });
+       document.getElementById("bill-close-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2812:31
-         document.getElementById("bill-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:2812:59
-         document.getElementById("bill-modal").classList.add("hidden");
+         document.getElementById("bill-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:2813:38
-         document.body.classList.remove("modal-open");
+         document.body.classList.remove("");

[NoCoverage] BlockStatement
app.js:2816:85
-       document.getElementById("bill-cancel-btn").addEventListener("click", function() {
-         document.getElementById("bill-modal").classList.add("hidden");
-         document.body.classList.remove("modal-open");
-       });
+       document.getElementById("bill-cancel-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2817:31
-         document.getElementById("bill-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:2817:59
-         document.getElementById("bill-modal").classList.add("hidden");
+         document.getElementById("bill-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:2818:38
-         document.body.classList.remove("modal-open");
+         document.body.classList.remove("");

[NoCoverage] BlockStatement
app.js:2821:81
-       document.getElementById("bill-form").addEventListener("submit", function(e) {
-         e.preventDefault();
-         saveBill();
-       });
+       document.getElementById("bill-form").addEventListener("submit", function(e) {});

[NoCoverage] BlockStatement
app.js:2924:92
-       document.getElementById("bill-details-close-btn").addEventListener("click", function() {
-         document.getElementById("bill-details-modal").classList.add("hidden");
-         document.body.classList.remove("modal-open");
-       });
+       document.getElementById("bill-details-close-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2925:31
-         document.getElementById("bill-details-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:2925:67
-         document.getElementById("bill-details-modal").classList.add("hidden");
+         document.getElementById("bill-details-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:2926:38
-         document.body.classList.remove("modal-open");
+         document.body.classList.remove("");

[NoCoverage] BlockStatement
app.js:2929:82
-       document.getElementById("pay-bill-btn").addEventListener("click", function() {
-         payBill(this.getAttribute("data-id"));
-       });
+       document.getElementById("pay-bill-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2930:33
-         payBill(this.getAttribute("data-id"));
+         payBill(this.getAttribute(""));

[NoCoverage] BlockStatement
app.js:2933:83
-       document.getElementById("edit-bill-btn").addEventListener("click", function() {
-         editBill(this.getAttribute("data-id"));
-       });
+       document.getElementById("edit-bill-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2934:34
-         editBill(this.getAttribute("data-id"));
+         editBill(this.getAttribute(""));

[NoCoverage] BlockStatement
app.js:2937:85
-       document.getElementById("delete-bill-btn").addEventListener("click", function() {
-         deleteBill(this.getAttribute("data-id"));
-       });
+       document.getElementById("delete-bill-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:2938:36
-         deleteBill(this.getAttribute("data-id"));
+         deleteBill(this.getAttribute(""));

[NoCoverage] BlockStatement
app.js:2943:56
-     if (!data.accounts || !Array.isArray(data.accounts)) {
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
-     }
+     if (!data.accounts || !Array.isArray(data.accounts)) {}

[NoCoverage] ArrayDeclaration
app.js:2944:21
-       data.accounts = [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ];
+       data.accounts = [];

[NoCoverage] ObjectLiteral
app.js:2945:7
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         {},

[NoCoverage] StringLiteral
app.js:2945:13
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:2945:25
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "", icon: "university", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:2945:47
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },

[NoCoverage] StringLiteral
app.js:2945:68
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "university", color: "" },

[NoCoverage] ObjectLiteral
app.js:2946:7
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         {},

[NoCoverage] StringLiteral
app.js:2946:13
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:2946:30
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:2946:47
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },

[NoCoverage] StringLiteral
app.js:2946:69
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },

[NoCoverage] ObjectLiteral
app.js:2947:7
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         {}

[NoCoverage] StringLiteral
app.js:2947:13
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:2947:27
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:2947:41
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "", color: "#ff9800" }

[NoCoverage] StringLiteral
app.js:2947:67
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }

[NoCoverage] StringLiteral
app.js:2953:48
-     const accountName = account ? account.name : "Unknown Account";
+     const accountName = account ? account.name : "";

[NoCoverage] StringLiteral
app.js:2956:83
-     document.getElementById("bill-details-title").textContent = bill.description || "Untitled Bill";
+     document.getElementById("bill-details-title").textContent = bill.description || "";

[NoCoverage] StringLiteral
app.js:2962:66
-       <p><strong>Recurring:</strong> ${bill.recurring === 'none' ? 'No' : bill.recurring}</p>
+       <p><strong>Recurring:</strong> ${bill.recurring === 'none' ? "" : bill.recurring}</p>

[NoCoverage] StringLiteral
app.js:2963:69
-       ${bill.notes ? `<p><strong>Notes:</strong> ${bill.notes}</p>` : ''}
+       ${bill.notes ? `<p><strong>Notes:</strong> ${bill.notes}</p>` : "Stryker was here!"}

[NoCoverage] StringLiteral
app.js:3025:65
-     showUpdateNotification(`Bill marked as ${bill.paid ? 'paid' : 'unpaid'}`);
+     showUpdateNotification(`Bill marked as ${bill.paid ? 'paid' : ""}`);

[NoCoverage] StringLiteral
app.js:3048:63
-     document.getElementById("bill-notes").value = bill.notes || '';
+     document.getElementById("bill-notes").value = bill.notes || "Stryker was here!";

[NoCoverage] BlockStatement
app.js:3052:31
-     form.onsubmit = function(e) {
-       e.preventDefault();
-       
-       // Update bill properties
-       bill.description = document.getElementById("bill-desc").value;
-       bill.amount = parseFloat(document.getElementById("bill-amount").value);
-       bill.date = document.getElementById("bill-date").value;
-       bill.account = document.getElementById("bill-account").value;
-       bill.category = document.getElementById("bill-category").value;
-       bill.recurring = document.getElementById("bill-recurring").value;
-       bill.notes = document.getElementById("bill-notes").value;
-       
-       // Save data
-       saveData();
-       
-       // Close modal
-       document.getElementById("bill-modal").classList.add("hidden");
-       document.body.classList.remove("modal-open");
-       
-       // Refresh calendar
-       renderCalendar(new Date(bill.date));
-       
-       showUpdateNotification("Bill updated successfully");
-     };
+     form.onsubmit = function(e) {};

[NoCoverage] StringLiteral
app.js:3056:48
-       bill.description = document.getElementById("bill-desc").value;
+       bill.description = document.getElementById("").value;

[NoCoverage] StringLiteral
app.js:3057:54
-       bill.amount = parseFloat(document.getElementById("bill-amount").value);
+       bill.amount = parseFloat(document.getElementById("").value);

[NoCoverage] StringLiteral
app.js:3058:41
-       bill.date = document.getElementById("bill-date").value;
+       bill.date = document.getElementById("").value;

[NoCoverage] StringLiteral
app.js:3059:44
-       bill.account = document.getElementById("bill-account").value;
+       bill.account = document.getElementById("").value;

[NoCoverage] StringLiteral
app.js:3060:45
-       bill.category = document.getElementById("bill-category").value;
+       bill.category = document.getElementById("").value;

[NoCoverage] StringLiteral
app.js:3061:46
-       bill.recurring = document.getElementById("bill-recurring").value;
+       bill.recurring = document.getElementById("").value;

[NoCoverage] StringLiteral
app.js:3062:42
-       bill.notes = document.getElementById("bill-notes").value;
+       bill.notes = document.getElementById("").value;

[NoCoverage] StringLiteral
app.js:3068:29
-       document.getElementById("bill-modal").classList.add("hidden");
+       document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:3068:57
-       document.getElementById("bill-modal").classList.add("hidden");
+       document.getElementById("bill-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:3069:36
-       document.body.classList.remove("modal-open");
+       document.body.classList.remove("");

[NoCoverage] StringLiteral
app.js:3074:28
-       showUpdateNotification("Bill updated successfully");
+       showUpdateNotification("");

[NoCoverage] BlockStatement
app.js:3121:90
-       document.getElementById("categories-close-btn").addEventListener("click", function() {
-         document.getElementById("categories-modal").classList.add("hidden");
-         document.body.classList.remove("modal-open");
-       });
+       document.getElementById("categories-close-btn").addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:3122:31
-         document.getElementById("categories-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:3122:65
-         document.getElementById("categories-modal").classList.add("hidden");
+         document.getElementById("categories-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:3123:38
-         document.body.classList.remove("modal-open");
+         document.body.classList.remove("");

[NoCoverage] BlockStatement
app.js:3145:60
-     if (!data.categories || !Array.isArray(data.categories)) {
-       data.categories = [
-         "Food & Dining",
-         "Shopping",
-         "Transportation",
-         "Bills & Utilities",
-         "Entertainment",
-         "Health & Fitness",
-         "Travel",
-         "Education",
-         "Personal Care",
-         "Gifts",
-         "Other"
-       ];
-     }
+     if (!data.categories || !Array.isArray(data.categories)) {}

[NoCoverage] ArrayDeclaration
app.js:3146:23
-       data.categories = [
-         "Food & Dining",
-         "Shopping",
-         "Transportation",
-         "Bills & Utilities",
-         "Entertainment",
-         "Health & Fitness",
-         "Travel",
-         "Education",
-         "Personal Care",
-         "Gifts",
-         "Other"
-       ];
+       data.categories = [];

[NoCoverage] StringLiteral
app.js:3147:7
-         "Food & Dining",
+         "",

[NoCoverage] StringLiteral
app.js:3148:7
-         "Shopping",
+         "",

[NoCoverage] StringLiteral
app.js:3149:7
-         "Transportation",
+         "",

[NoCoverage] StringLiteral
app.js:3150:7
-         "Bills & Utilities",
+         "",

[NoCoverage] StringLiteral
app.js:3151:7
-         "Entertainment",
+         "",

[NoCoverage] StringLiteral
app.js:3152:7
-         "Health & Fitness",
+         "",

[NoCoverage] StringLiteral
app.js:3153:7
-         "Travel",
+         "",

[NoCoverage] StringLiteral
app.js:3154:7
-         "Education",
+         "",

[NoCoverage] StringLiteral
app.js:3155:7
-         "Personal Care",
+         "",

[NoCoverage] StringLiteral
app.js:3156:7
-         "Gifts",
+         "",

[NoCoverage] StringLiteral
app.js:3157:7
-         "Other"
+         ""

[NoCoverage] BlockStatement
app.js:3174:46
-       btn.addEventListener("click", function() {
-         const category = this.getAttribute("data-category");
-         deleteCategory(category);
-       });
+       btn.addEventListener("click", function() {});

[NoCoverage] StringLiteral
app.js:3175:42
-         const category = this.getAttribute("data-category");
+         const category = this.getAttribute("");

[NoCoverage] BlockStatement
app.js:3186:18
-     if (!category) {
-       categoryInput.classList.add("input-error");
-       setTimeout(() => {
-         categoryInput.classList.remove("input-error");
-       }, 2000);
-       return;
-     }
+     if (!category) {}

[NoCoverage] StringLiteral
app.js:3187:33
-       categoryInput.classList.add("input-error");
+       categoryInput.classList.add("");

[NoCoverage] BlockStatement
app.js:3188:22
-       setTimeout(() => {
-         categoryInput.classList.remove("input-error");
-       }, 2000);
+       setTimeout(() => {}, 2000);

[NoCoverage] StringLiteral
app.js:3189:38
-         categoryInput.classList.remove("input-error");
+         categoryInput.classList.remove("");

[NoCoverage] BlockStatement
app.js:3219:136
-     if (!confirm(`Are you sure you want to delete the "${category}" category? Transactions with this category will be set to "Other".`)) {
-       return;
-     }
+     if (!confirm(`Are you sure you want to delete the "${category}" category? Transactions with this category will be set to "Other".`)) {}

[NoCoverage] StringLiteral
app.js:3329:39
-         const category = tx.category || "Other";
+         const category = tx.category || "";

[NoCoverage] StringLiteral
app.js:3419:37
-       const desc = (tx.description || "").toLowerCase();
+       const desc = (tx.description || "Stryker was here!").toLowerCase();

[NoCoverage] StringLiteral
app.js:3420:38
-       const category = (tx.category || "").toLowerCase();
+       const category = (tx.category || "Stryker was here!").toLowerCase();

[NoCoverage] ArithmeticOperator
app.js:3447:36
-         searchResults.sort((a, b) => new Date(b.date) - new Date(a.date));
+         searchResults.sort((a, b) => new Date(b.date) + new Date(a.date));

[NoCoverage] ConditionalExpression
app.js:3449:5
-       case "date-asc":
-         searchResults.sort((a, b) => new Date(a.date) - new Date(b.date));
-         break;
+       case "date-asc":

[NoCoverage] StringLiteral
app.js:3449:10
-       case "date-asc":
+       case "":

[NoCoverage] MethodExpression
app.js:3450:7
-         searchResults.sort((a, b) => new Date(a.date) - new Date(b.date));
+         searchResults;

[NoCoverage] ArrowFunction
app.js:3450:26
-         searchResults.sort((a, b) => new Date(a.date) - new Date(b.date));
+         searchResults.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:3450:36
-         searchResults.sort((a, b) => new Date(a.date) - new Date(b.date));
+         searchResults.sort((a, b) => new Date(a.date) + new Date(b.date));

[NoCoverage] ConditionalExpression
app.js:3452:5
-       case "amount-desc":
-         searchResults.sort((a, b) => b.amount - a.amount);
-         break;
+       case "amount-desc":

[NoCoverage] StringLiteral
app.js:3452:10
-       case "amount-desc":
+       case "":

[NoCoverage] MethodExpression
app.js:3453:7
-         searchResults.sort((a, b) => b.amount - a.amount);
+         searchResults;

[NoCoverage] ArrowFunction
app.js:3453:26
-         searchResults.sort((a, b) => b.amount - a.amount);
+         searchResults.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:3453:36
-         searchResults.sort((a, b) => b.amount - a.amount);
+         searchResults.sort((a, b) => b.amount + a.amount);

[NoCoverage] ConditionalExpression
app.js:3455:5
-       case "amount-asc":
-         searchResults.sort((a, b) => a.amount - b.amount);
-         break;
+       case "amount-asc":

[NoCoverage] StringLiteral
app.js:3455:10
-       case "amount-asc":
+       case "":

[NoCoverage] MethodExpression
app.js:3456:7
-         searchResults.sort((a, b) => a.amount - b.amount);
+         searchResults;

[NoCoverage] ArrowFunction
app.js:3456:26
-         searchResults.sort((a, b) => a.amount - b.amount);
+         searchResults.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:3456:36
-         searchResults.sort((a, b) => a.amount - b.amount);
+         searchResults.sort((a, b) => a.amount + b.amount);

[NoCoverage] StringLiteral
app.js:3466:16
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id || "" + Math.random().toString(36).substr(2, 9),

[NoCoverage] MethodExpression
app.js:3466:24
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id || "tx-" + Math.random().toString(36),

[NoCoverage] BlockStatement
app.js:3469:22
-       if (tx.isPinned) {
-         li.classList.add("pinned");
-       }
+       if (tx.isPinned) {}

[NoCoverage] StringLiteral
app.js:3470:24
-         li.classList.add("pinned");
+         li.classList.add("");

[NoCoverage] StringLiteral
app.js:3474:9
-         ? `<i class="fas fa-sync-alt recurring-icon" title="Recurring Transaction"></i>`
+         ? ``

[NoCoverage] StringLiteral
app.js:3482:29
-           ${tx.description || "(no desc)"}
+           ${tx.description || ""}

[NoCoverage] StringLiteral
app.js:3484:78
-           ${tx.category ? `<span class="category-tag">${tx.category}</span>` : ""}
+           ${tx.category ? `<span class="category-tag">${tx.category}</span>` : "Stryker was here!"}

[NoCoverage] BlockStatement
app.js:3489:46
-       li.addEventListener("click", function () {
-         const index = data.transactions.findIndex(
-           (t) =>
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
-         );
-         if (index !== -1) {
-           currentTxIndex = index;
-           openTransactionDetails(tx);
-         }
-       });
+       li.addEventListener("click", function () {});

[NoCoverage] ArrowFunction
app.js:3491:9
-           (t) =>
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+           () => undefined,

[NoCoverage] ConditionalExpression
app.js:3492:11
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             true,

[NoCoverage] ConditionalExpression
app.js:3492:11
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             false,

[NoCoverage] LogicalOperator
app.js:3492:11
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             t.id === tx.id && t.date === tx.date && t.amount === tx.amount && t.description === tx.description && t.type === tx.type && t.account === tx.account,

[NoCoverage] ConditionalExpression
app.js:3492:11
-             t.id === tx.id ||
+             false ||

[NoCoverage] EqualityOperator
app.js:3492:11
-             t.id === tx.id ||
+             t.id !== tx.id ||

[NoCoverage] ConditionalExpression
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             (false),

[NoCoverage] LogicalOperator
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             (t.date === tx.date && t.amount === tx.amount && t.description === tx.description && t.type === tx.type || t.account === tx.account),

[NoCoverage] ConditionalExpression
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
+             (true &&

[NoCoverage] LogicalOperator
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
+             (t.date === tx.date && t.amount === tx.amount && t.description === tx.description || t.type === tx.type &&

[NoCoverage] ConditionalExpression
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
+             (true &&

[NoCoverage] LogicalOperator
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
+             (t.date === tx.date && t.amount === tx.amount || t.description === tx.description &&

[NoCoverage] ConditionalExpression
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
+             (true &&

[NoCoverage] LogicalOperator
app.js:3493:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
+             (t.date === tx.date || t.amount === tx.amount &&

[NoCoverage] ConditionalExpression
app.js:3493:12
-             (t.date === tx.date &&
+             (true &&

[NoCoverage] EqualityOperator
app.js:3493:12
-             (t.date === tx.date &&
+             (t.date !== tx.date &&

[NoCoverage] ConditionalExpression
app.js:3494:13
-               t.amount === tx.amount &&
+               true &&

[NoCoverage] EqualityOperator
app.js:3494:13
-               t.amount === tx.amount &&
+               t.amount !== tx.amount &&

[NoCoverage] ConditionalExpression
app.js:3495:13
-               t.description === tx.description &&
+               true &&

[NoCoverage] EqualityOperator
app.js:3495:13
-               t.description === tx.description &&
+               t.description !== tx.description &&

[NoCoverage] ConditionalExpression
app.js:3496:13
-               t.type === tx.type &&
+               true &&

[NoCoverage] EqualityOperator
app.js:3496:13
-               t.type === tx.type &&
+               t.type !== tx.type &&

[NoCoverage] ConditionalExpression
app.js:3497:13
-               t.account === tx.account),
+               true),

[NoCoverage] EqualityOperator
app.js:3497:13
-               t.account === tx.account),
+               t.account !== tx.account),

[NoCoverage] ConditionalExpression
app.js:3500:11
-         if (index !== -1) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:3500:11
-         if (index !== -1) {
+         if (false) {

[NoCoverage] EqualityOperator
app.js:3500:11
-         if (index !== -1) {
+         if (index === -1) {

[NoCoverage] UnaryOperator
app.js:3500:21
-         if (index !== -1) {
+         if (index !== +1) {

[NoCoverage] BlockStatement
app.js:3500:25
-         if (index !== -1) {
-           currentTxIndex = index;
-           openTransactionDetails(tx);
-         }
+         if (index !== -1) {}

[NoCoverage] StringLiteral
app.js:3519:37
-       return account ? account.name : "Unknown Account";
+       return account ? account.name : "";

[NoCoverage] StringLiteral
app.js:3524:24
-       (tx.description || "(no desc)") +
+       (tx.description || "") +

[NoCoverage] StringLiteral
app.js:3533:29
-       (tx.type === "income" ? "Income" : "Expense") +
+       (tx.type === "income" ? "" : "Expense") +

[NoCoverage] StringLiteral
app.js:3539:21
-       (tx.category || "Uncategorized") +
+       (tx.category || "") +

[NoCoverage] BlockStatement
app.js:3542:23
-     if (tx.isRecurring) {
-       detailsHtml += "<p><strong>Recurring:</strong> Yes</p>";
-     }
+     if (tx.isRecurring) {}

[NoCoverage] StringLiteral
app.js:3543:20
-       detailsHtml += "<p><strong>Recurring:</strong> Yes</p>";
+       detailsHtml += "";

[NoCoverage] BlockStatement
app.js:3550:52
-     if (tx.attachments && tx.attachments.length > 0) {
-       detailsHtml +=
-         "<div class='attachment-section'><strong>Attachments:</strong><div class='attachment-list'>";
-       tx.attachments.forEach((attachment) => {
-         detailsHtml += `<div class='attachment-item'><img src='${attachment.data}' alt='Receipt'></div>`;
-       });
-       detailsHtml += "</div></div>";
-     }
+     if (tx.attachments && tx.attachments.length > 0) {}

[NoCoverage] StringLiteral
app.js:3552:7
-         "<div class='attachment-section'><strong>Attachments:</strong><div class='attachment-list'>";
+         "";

[NoCoverage] BlockStatement
app.js:3553:44
-       tx.attachments.forEach((attachment) => {
-         detailsHtml += `<div class='attachment-item'><img src='${attachment.data}' alt='Receipt'></div>`;
-       });
+       tx.attachments.forEach((attachment) => {});

[NoCoverage] StringLiteral
app.js:3554:22
-         detailsHtml += `<div class='attachment-item'><img src='${attachment.data}' alt='Receipt'></div>`;
+         detailsHtml += ``;

[NoCoverage] StringLiteral
app.js:3556:20
-       detailsHtml += "</div></div>";
+       detailsHtml += "";

[NoCoverage] BlockStatement
app.js:3563:20
-     if (tx.isPinned) {
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Unpin`;
-       pinBtn.classList.add("active");
-     } else {
+     if (tx.isPinned) {} else {

[NoCoverage] StringLiteral
app.js:3564:24
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Unpin`;
+       pinBtn.innerHTML = ``;
