[NoCoverage] StringLiteral
app.js:3565:26
-       pinBtn.classList.add("active");
+       pinBtn.classList.add("");

[NoCoverage] BlockStatement
app.js:3573:19
-     if (currentMap) {
-       currentMap.remove();
-       currentMap = null;
-     }
+     if (currentMap) {}

[NoCoverage] BlockStatement
app.js:3582:20
-     setTimeout(() => {
-       if (tx.location) {
-         try {
-           currentMap = L.map("map-preview").setView(
-             [tx.location.latitude, tx.location.longitude],
-             13,
-           );
-           L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-             attribution: "&copy; OpenStreetMap contributors",
-           }).addTo(currentMap);
-           L.marker([tx.location.latitude, tx.location.longitude]).addTo(
-             currentMap,
-           );
-           // Force map to recalculate size
-           currentMap.invalidateSize();
-         } catch (e) {
-           console.error("Error initializing map:", e);
-           mapPreview.innerHTML =
-             "<div class='no-location'>Error loading map</div>";
-         }
-       } else {
-         mapPreview.innerHTML =
-           "<div class='no-location'>No location data available</div>";
-       }
-     }, 100);
+     setTimeout(() => {}, 100);

[NoCoverage] ConditionalExpression
app.js:3583:9
-       if (tx.location) {
+       if (true) {

[NoCoverage] ConditionalExpression
app.js:3583:9
-       if (tx.location) {
+       if (false) {

[NoCoverage] BlockStatement
app.js:3583:22
-       if (tx.location) {
-         try {
-           currentMap = L.map("map-preview").setView(
-             [tx.location.latitude, tx.location.longitude],
-             13,
-           );
-           L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-             attribution: "&copy; OpenStreetMap contributors",
-           }).addTo(currentMap);
-           L.marker([tx.location.latitude, tx.location.longitude]).addTo(
-             currentMap,
-           );
-           // Force map to recalculate size
-           currentMap.invalidateSize();
-         } catch (e) {
-           console.error("Error initializing map:", e);
-           mapPreview.innerHTML =
-             "<div class='no-location'>Error loading map</div>";
-         }
-       } else {
+       if (tx.location) {} else {

[NoCoverage] BlockStatement
app.js:3584:11
-         try {
-           currentMap = L.map("map-preview").setView(
-             [tx.location.latitude, tx.location.longitude],
-             13,
-           );
-           L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-             attribution: "&copy; OpenStreetMap contributors",
-           }).addTo(currentMap);
-           L.marker([tx.location.latitude, tx.location.longitude]).addTo(
-             currentMap,
-           );
-           // Force map to recalculate size
-           currentMap.invalidateSize();
-         } catch (e) {
+         try {} catch (e) {

[NoCoverage] StringLiteral
app.js:3585:28
-           currentMap = L.map("map-preview").setView(
+           currentMap = L.map("").setView(

[NoCoverage] ArrayDeclaration
app.js:3586:11
-             [tx.location.latitude, tx.location.longitude],
+             [],

[NoCoverage] StringLiteral
app.js:3589:21
-           L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
+           L.tileLayer("", {

[NoCoverage] ObjectLiteral
app.js:3589:75
-           L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {
-             attribution: "&copy; OpenStreetMap contributors",
-           }).addTo(currentMap);
+           L.tileLayer("https://{s}.tile.openstreetmap.org/{z}/{x}/{y}.png", {}).addTo(currentMap);

[NoCoverage] StringLiteral
app.js:3590:24
-             attribution: "&copy; OpenStreetMap contributors",
+             attribution: "",

[NoCoverage] ArrayDeclaration
app.js:3592:18
-           L.marker([tx.location.latitude, tx.location.longitude]).addTo(
+           L.marker([]).addTo(

[NoCoverage] BlockStatement
app.js:3597:19
-         } catch (e) {
-           console.error("Error initializing map:", e);
-           mapPreview.innerHTML =
-             "<div class='no-location'>Error loading map</div>";
-         }
+         } catch (e) {}

[NoCoverage] StringLiteral
app.js:3598:23
-           console.error("Error initializing map:", e);
+           console.error("", e);

[NoCoverage] StringLiteral
app.js:3600:11
-             "<div class='no-location'>Error loading map</div>";
+             "";

[NoCoverage] BlockStatement
app.js:3602:12
-       } else {
-         mapPreview.innerHTML =
-           "<div class='no-location'>No location data available</div>";
-       }
+       } else {}

[NoCoverage] StringLiteral
app.js:3604:9
-           "<div class='no-location'>No location data available</div>";
+           "";

[NoCoverage] ConditionalExpression
app.js:3695:5
-       case "date-asc":
-         filteredTx.sort((a, b) => new Date(a.date) - new Date(b.date));
-         break;
+       case "date-asc":

[NoCoverage] StringLiteral
app.js:3695:10
-       case "date-asc":
+       case "":

[NoCoverage] MethodExpression
app.js:3696:7
-         filteredTx.sort((a, b) => new Date(a.date) - new Date(b.date));
+         filteredTx;

[NoCoverage] ArrowFunction
app.js:3696:23
-         filteredTx.sort((a, b) => new Date(a.date) - new Date(b.date));
+         filteredTx.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:3696:33
-         filteredTx.sort((a, b) => new Date(a.date) - new Date(b.date));
+         filteredTx.sort((a, b) => new Date(a.date) + new Date(b.date));

[NoCoverage] ConditionalExpression
app.js:3698:5
-       case "amount-desc":
-         filteredTx.sort((a, b) => b.amount - a.amount);
-         break;
+       case "amount-desc":

[NoCoverage] StringLiteral
app.js:3698:10
-       case "amount-desc":
+       case "":

[NoCoverage] MethodExpression
app.js:3699:7
-         filteredTx.sort((a, b) => b.amount - a.amount);
+         filteredTx;

[NoCoverage] ArrowFunction
app.js:3699:23
-         filteredTx.sort((a, b) => b.amount - a.amount);
+         filteredTx.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:3699:33
-         filteredTx.sort((a, b) => b.amount - a.amount);
+         filteredTx.sort((a, b) => b.amount + a.amount);

[NoCoverage] ConditionalExpression
app.js:3701:5
-       case "amount-asc":
-         filteredTx.sort((a, b) => a.amount - b.amount);
-         break;
+       case "amount-asc":

[NoCoverage] StringLiteral
app.js:3701:10
-       case "amount-asc":
+       case "":

[NoCoverage] MethodExpression
app.js:3702:7
-         filteredTx.sort((a, b) => a.amount - b.amount);
+         filteredTx;

[NoCoverage] ArrowFunction
app.js:3702:23
-         filteredTx.sort((a, b) => a.amount - b.amount);
+         filteredTx.sort(() => undefined);

[NoCoverage] ArithmeticOperator
app.js:3702:33
-         filteredTx.sort((a, b) => a.amount - b.amount);
+         filteredTx.sort((a, b) => a.amount + b.amount);

[NoCoverage] StringLiteral
app.js:3712:16
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id || "" + Math.random().toString(36).substr(2, 9),

[NoCoverage] MethodExpression
app.js:3712:24
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id || "tx-" + Math.random().toString(36),

[NoCoverage] BlockStatement
app.js:3715:22
-       if (tx.isPinned) {
-         li.classList.add("pinned");
-       }
+       if (tx.isPinned) {}

[NoCoverage] StringLiteral
app.js:3716:24
-         li.classList.add("pinned");
+         li.classList.add("");

[NoCoverage] StringLiteral
app.js:3720:9
-         ? `<i class="fas fa-sync-alt recurring-icon" title="Recurring Transaction"></i>`
+         ? ``

[NoCoverage] StringLiteral
app.js:3725:67
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : ""}"

[NoCoverage] StringLiteral
app.js:3728:29
-           ${tx.description || "(no desc)"}
+           ${tx.description || ""}

[NoCoverage] StringLiteral
app.js:3730:78
-           ${tx.category ? `<span class="category-tag">${tx.category}</span>` : ""}
+           ${tx.category ? `<span class="category-tag">${tx.category}</span>` : "Stryker was here!"}

[NoCoverage] BlockStatement
app.js:3735:46
-       li.addEventListener("click", function () {
-         const index = data.transactions.findIndex(
-           (t) =>
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
-         );
-         if (index !== -1) {
-           currentTxIndex = index;
-           openTransactionDetails(tx);
-         }
-       });
+       li.addEventListener("click", function () {});

[NoCoverage] ArrowFunction
app.js:3737:9
-           (t) =>
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+           () => undefined,

[NoCoverage] ConditionalExpression
app.js:3738:11
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             true,

[NoCoverage] ConditionalExpression
app.js:3738:11
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             false,

[NoCoverage] LogicalOperator
app.js:3738:11
-             t.id === tx.id ||
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             t.id === tx.id && t.date === tx.date && t.amount === tx.amount && t.description === tx.description && t.type === tx.type && t.account === tx.account,

[NoCoverage] ConditionalExpression
app.js:3738:11
-             t.id === tx.id ||
+             false ||

[NoCoverage] EqualityOperator
app.js:3738:11
-             t.id === tx.id ||
+             t.id !== tx.id ||

[NoCoverage] ConditionalExpression
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             (false),

[NoCoverage] LogicalOperator
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
-               t.account === tx.account),
+             (t.date === tx.date && t.amount === tx.amount && t.description === tx.description && t.type === tx.type || t.account === tx.account),

[NoCoverage] ConditionalExpression
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
+             (true &&

[NoCoverage] LogicalOperator
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
-               t.type === tx.type &&
+             (t.date === tx.date && t.amount === tx.amount && t.description === tx.description || t.type === tx.type &&

[NoCoverage] ConditionalExpression
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
+             (true &&

[NoCoverage] LogicalOperator
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
-               t.description === tx.description &&
+             (t.date === tx.date && t.amount === tx.amount || t.description === tx.description &&

[NoCoverage] ConditionalExpression
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
+             (true &&

[NoCoverage] LogicalOperator
app.js:3739:12
-             (t.date === tx.date &&
-               t.amount === tx.amount &&
+             (t.date === tx.date || t.amount === tx.amount &&

[NoCoverage] ConditionalExpression
app.js:3739:12
-             (t.date === tx.date &&
+             (true &&

[NoCoverage] EqualityOperator
app.js:3739:12
-             (t.date === tx.date &&
+             (t.date !== tx.date &&

[NoCoverage] ConditionalExpression
app.js:3740:13
-               t.amount === tx.amount &&
+               true &&

[NoCoverage] EqualityOperator
app.js:3740:13
-               t.amount === tx.amount &&
+               t.amount !== tx.amount &&

[NoCoverage] ConditionalExpression
app.js:3741:13
-               t.description === tx.description &&
+               true &&

[NoCoverage] EqualityOperator
app.js:3741:13
-               t.description === tx.description &&
+               t.description !== tx.description &&

[NoCoverage] ConditionalExpression
app.js:3742:13
-               t.type === tx.type &&
+               true &&

[NoCoverage] EqualityOperator
app.js:3742:13
-               t.type === tx.type &&
+               t.type !== tx.type &&

[NoCoverage] ConditionalExpression
app.js:3743:13
-               t.account === tx.account),
+               true),

[NoCoverage] EqualityOperator
app.js:3743:13
-               t.account === tx.account),
+               t.account !== tx.account),

[NoCoverage] ConditionalExpression
app.js:3746:11
-         if (index !== -1) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:3746:11
-         if (index !== -1) {
+         if (false) {

[NoCoverage] EqualityOperator
app.js:3746:11
-         if (index !== -1) {
+         if (index === -1) {

[NoCoverage] UnaryOperator
app.js:3746:21
-         if (index !== -1) {
+         if (index !== +1) {

[NoCoverage] BlockStatement
app.js:3746:25
-         if (index !== -1) {
-           currentTxIndex = index;
-           openTransactionDetails(tx);
-         }
+         if (index !== -1) {}

[NoCoverage] ArrayDeclaration
app.js:3795:41
-     const categories = data.categories || [];
+     const categories = data.categories || ["Stryker was here"];

[NoCoverage] StringLiteral
app.js:3813:37
-       const category = tx.category || "Other";
+       const category = tx.category || "";

[NoCoverage] StringLiteral
app.js:3836:45
-       if (progressPercent > 90) statusColor = "var(--expense-color)";
+       if (progressPercent > 90) statusColor = "";

[NoCoverage] StringLiteral
app.js:3837:50
-       else if (progressPercent > 70) statusColor = "orange";
+       else if (progressPercent > 70) statusColor = "";

[NoCoverage] BlockStatement
app.js:3862:46
-         .addEventListener("click", function () {
-           const category = this.dataset.category;
-           const currentBudget = (data.budgets && data.budgets[category]) || 0;
-           const newBudget = prompt(`Set budget for ${category}:`, currentBudget);
-           if (newBudget !== null) {
-             // Parse and validate budget amount
-             const budgetAmount = parseFloat(newBudget);
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
-               // Initialize budgets object if it doesn't exist
-               if (!data.budgets) data.budgets = {};
-               // Set budget
-               data.budgets[category] = budgetAmount;
-               // Save data
-               saveData();
-               // Re-render budgets
-               renderBudgets();
-             } else {
-               alert("Please enter a valid budget amount.");
-             }
-           }
-         });
+         .addEventListener("click", function () {});

[NoCoverage] ConditionalExpression
app.js:3864:31
-           const currentBudget = (data.budgets && data.budgets[category]) || 0;
+           const currentBudget = true;

[NoCoverage] ConditionalExpression
app.js:3864:31
-           const currentBudget = (data.budgets && data.budgets[category]) || 0;
+           const currentBudget = false;

[NoCoverage] LogicalOperator
app.js:3864:31
-           const currentBudget = (data.budgets && data.budgets[category]) || 0;
+           const currentBudget = data.budgets && data.budgets[category] && 0;

[NoCoverage] ConditionalExpression
app.js:3864:32
-           const currentBudget = (data.budgets && data.budgets[category]) || 0;
+           const currentBudget = (false) || 0;

[NoCoverage] LogicalOperator
app.js:3864:32
-           const currentBudget = (data.budgets && data.budgets[category]) || 0;
+           const currentBudget = (data.budgets || data.budgets[category]) || 0;

[NoCoverage] StringLiteral
app.js:3865:34
-           const newBudget = prompt(`Set budget for ${category}:`, currentBudget);
+           const newBudget = prompt(``, currentBudget);

[NoCoverage] ConditionalExpression
app.js:3867:13
-           if (newBudget !== null) {
+           if (true) {

[NoCoverage] ConditionalExpression
app.js:3867:13
-           if (newBudget !== null) {
+           if (false) {

[NoCoverage] EqualityOperator
app.js:3867:13
-           if (newBudget !== null) {
+           if (newBudget === null) {

[NoCoverage] BlockStatement
app.js:3867:33
-           if (newBudget !== null) {
-             // Parse and validate budget amount
-             const budgetAmount = parseFloat(newBudget);
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
-               // Initialize budgets object if it doesn't exist
-               if (!data.budgets) data.budgets = {};
-               // Set budget
-               data.budgets[category] = budgetAmount;
-               // Save data
-               saveData();
-               // Re-render budgets
-               renderBudgets();
-             } else {
-               alert("Please enter a valid budget amount.");
-             }
-           }
+           if (newBudget !== null) {}

[NoCoverage] ConditionalExpression
app.js:3870:15
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (true) {

[NoCoverage] ConditionalExpression
app.js:3870:15
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (false) {

[NoCoverage] LogicalOperator
app.js:3870:15
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (!isNaN(budgetAmount) || budgetAmount >= 0) {

[NoCoverage] BooleanLiteral
app.js:3870:15
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (isNaN(budgetAmount) && budgetAmount >= 0) {

[NoCoverage] ConditionalExpression
app.js:3870:39
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (!isNaN(budgetAmount) && true) {

[NoCoverage] EqualityOperator
app.js:3870:39
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (!isNaN(budgetAmount) && budgetAmount > 0) {

[NoCoverage] EqualityOperator
app.js:3870:39
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
+             if (!isNaN(budgetAmount) && budgetAmount < 0) {

[NoCoverage] BlockStatement
app.js:3870:58
-             if (!isNaN(budgetAmount) && budgetAmount >= 0) {
-               // Initialize budgets object if it doesn't exist
-               if (!data.budgets) data.budgets = {};
-               // Set budget
-               data.budgets[category] = budgetAmount;
-               // Save data
-               saveData();
-               // Re-render budgets
-               renderBudgets();
-             } else {
+             if (!isNaN(budgetAmount) && budgetAmount >= 0) {} else {

[NoCoverage] BooleanLiteral
app.js:3872:17
-               if (!data.budgets) data.budgets = {};
+               if (data.budgets) data.budgets = {};

[NoCoverage] ConditionalExpression
app.js:3872:17
-               if (!data.budgets) data.budgets = {};
+               if (true) data.budgets = {};

[NoCoverage] ConditionalExpression
app.js:3872:17
-               if (!data.budgets) data.budgets = {};
+               if (false) data.budgets = {};

[NoCoverage] BlockStatement
app.js:3879:18
-             } else {
-               alert("Please enter a valid budget amount.");
-             }
+             } else {}

[NoCoverage] StringLiteral
app.js:3880:19
-               alert("Please enter a valid budget amount.");
+               alert("");

[NoCoverage] BlockStatement
app.js:3910:33
-     if (!data.settings.recurring) {
-       data.settings.recurring = {
-         autoCreate: false,
-         notifications: false
-       };
-     }
+     if (!data.settings.recurring) {}

[NoCoverage] ObjectLiteral
app.js:3911:31
-       data.settings.recurring = {
-         autoCreate: false,
-         notifications: false
-       };
+       data.settings.recurring = {};

[NoCoverage] BooleanLiteral
app.js:3912:19
-         autoCreate: false,
+         autoCreate: true,

[NoCoverage] BooleanLiteral
app.js:3913:22
-         notifications: false
+         notifications: true

[NoCoverage] BlockStatement
app.js:3918:45
-     if (!data.settings.recurringTransactions) {
-       data.settings.recurringTransactions = [];
-     }
+     if (!data.settings.recurringTransactions) {}

[NoCoverage] ArrayDeclaration
app.js:3919:43
-       data.settings.recurringTransactions = [];
+       data.settings.recurringTransactions = ["Stryker was here"];

[NoCoverage] BlockStatement
app.js:3923:70
-     if (data.settings.recurring && data.settings.recurring.autoCreate) {
-       processRecurringTransactions();
-     }
+     if (data.settings.recurring && data.settings.recurring.autoCreate) {}

[NoCoverage] BlockStatement
app.js:3928:116
-     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
-       renderBillCalendar();
-     }
+     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {}

[NoCoverage] BlockStatement
app.js:3939:44
-       .addEventListener("click", function () {
-         filters.account = "all";
-         filters.type = "all";
-         document.getElementById("account-filter").value = "all";
-         document.getElementById("type-filter").value = "all";
-         document.getElementById("date-range-filter").value = "all";
-         document.getElementById("search-input").value = "";
-         updateActiveAccountCard();
-         renderTransactions();
-       });
+       .addEventListener("click", function () {});

[NoCoverage] StringLiteral
app.js:3940:25
-         filters.account = "all";
+         filters.account = "";

[NoCoverage] StringLiteral
app.js:3941:22
-         filters.type = "all";
+         filters.type = "";

[NoCoverage] StringLiteral
app.js:3942:31
-         document.getElementById("account-filter").value = "all";
+         document.getElementById("").value = "all";

[NoCoverage] StringLiteral
app.js:3942:57
-         document.getElementById("account-filter").value = "all";
+         document.getElementById("account-filter").value = "";

[NoCoverage] StringLiteral
app.js:3943:31
-         document.getElementById("type-filter").value = "all";
+         document.getElementById("").value = "all";

[NoCoverage] StringLiteral
app.js:3943:54
-         document.getElementById("type-filter").value = "all";
+         document.getElementById("type-filter").value = "";

[NoCoverage] StringLiteral
app.js:3944:31
-         document.getElementById("date-range-filter").value = "all";
+         document.getElementById("").value = "all";

[NoCoverage] StringLiteral
app.js:3944:60
-         document.getElementById("date-range-filter").value = "all";
+         document.getElementById("date-range-filter").value = "";

[NoCoverage] StringLiteral
app.js:3945:31
-         document.getElementById("search-input").value = "";
+         document.getElementById("").value = "";

[NoCoverage] StringLiteral
app.js:3945:55
-         document.getElementById("search-input").value = "";
+         document.getElementById("search-input").value = "Stryker was here!";

[NoCoverage] BlockStatement
app.js:3952:48
-       item.addEventListener("click", function () {
-         switchView(this.dataset.view);
-       });
+       item.addEventListener("click", function () {});

[NoCoverage] ConditionalExpression
app.js:3979:9
-           case "today":
-             startDate = new Date(
-               now.getFullYear(),
-               now.getMonth(),
-               now.getDate(),
-             );
-             endDate = new Date(
-               now.getFullYear(),
-               now.getMonth(),
-               now.getDate(),
-               23,
-               59,
-               59,
-             );
-             break;
+           case "today":

[NoCoverage] ConditionalExpression
app.js:3994:9
-           case "week":
-             startDate = new Date(now);
-             startDate.setDate(now.getDate() - now.getDay());
-             endDate = new Date(now);
-             endDate.setDate(startDate.getDate() + 6);
-             endDate.setHours(23, 59, 59);
-             break;
+           case "week":

[NoCoverage] MethodExpression
app.js:3996:11
-             startDate.setDate(now.getDate() - now.getDay());
+             startDate.setTime(now.getDate() - now.getDay());

[NoCoverage] ArithmeticOperator
app.js:3996:29
-             startDate.setDate(now.getDate() - now.getDay());
+             startDate.setDate(now.getDate() + now.getDay());

[NoCoverage] MethodExpression
app.js:3998:11
-             endDate.setDate(startDate.getDate() + 6);
+             endDate.setTime(startDate.getDate() + 6);

[NoCoverage] ArithmeticOperator
app.js:3998:27
-             endDate.setDate(startDate.getDate() + 6);
+             endDate.setDate(startDate.getDate() - 6);

[NoCoverage] MethodExpression
app.js:3999:11
-             endDate.setHours(23, 59, 59);
+             endDate.setMinutes(23, 59, 59);

[NoCoverage] ConditionalExpression
app.js:4001:9
-           case "month":
-             startDate = new Date(now.getFullYear(), now.getMonth(), 1);
-             endDate = new Date(
-               now.getFullYear(),
-               now.getMonth() + 1,
-               0,
-               23,
-               59,
-               59,
-             );
-             break;
+           case "month":

[NoCoverage] ArithmeticOperator
app.js:4005:13
-               now.getMonth() + 1,
+               now.getMonth() - 1,

[NoCoverage] ConditionalExpression
app.js:4012:9
-           case "year":
-             startDate = new Date(now.getFullYear(), 0, 1);
-             endDate = new Date(now.getFullYear(), 11, 31, 23, 59, 59);
-             break;
+           case "year":

[NoCoverage] ConditionalExpression
app.js:4022:9
-           default:
-             // All transactions (no date filter)
-             filterByDateRange(null, null);
-             document.getElementById("custom-date-range").classList.add("hidden");
-             return;
+           default:

[NoCoverage] StringLiteral
app.js:4025:35
-             document.getElementById("custom-date-range").classList.add("hidden");
+             document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:4025:70
-             document.getElementById("custom-date-range").classList.add("hidden");
+             document.getElementById("custom-date-range").classList.add("");

[NoCoverage] StringLiteral
app.js:4029:31
-         document.getElementById("custom-date-range").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:4029:66
-         document.getElementById("custom-date-range").classList.add("hidden");
+         document.getElementById("custom-date-range").classList.add("");

[NoCoverage] BlockStatement
app.js:4051:79
-     document.getElementById("pin-tx-btn").addEventListener("click", function () {
-       togglePinTransaction(currentTxIndex);
-     });
+     document.getElementById("pin-tx-btn").addEventListener("click", function () {});

[NoCoverage] BlockStatement
app.js:4058:44
-       .addEventListener("click", function () {
-         toggleTheme();
-       });
+       .addEventListener("click", function () {});

[NoCoverage] BlockStatement
app.js:4063:80
-     document.getElementById("refresh-btn").addEventListener("click", function () {
-       checkForUpdates();
-       this.classList.add("spinning");
-       setTimeout(() => this.classList.remove("spinning"), 500);
-     });
+     document.getElementById("refresh-btn").addEventListener("click", function () {});

[NoCoverage] StringLiteral
app.js:4065:24
-       this.classList.add("spinning");
+       this.classList.add("");

[NoCoverage] ArrowFunction
app.js:4066:16
-       setTimeout(() => this.classList.remove("spinning"), 500);
+       setTimeout(() => undefined, 500);

[NoCoverage] StringLiteral
app.js:4066:44
-       setTimeout(() => this.classList.remove("spinning"), 500);
+       setTimeout(() => this.classList.remove(""), 500);

[NoCoverage] BlockStatement
app.js:4072:22
-       function (event) {
-         if (event.scale !== 1) {
-           event.preventDefault();
-         }
-       },
+       function (event) {},

[NoCoverage] ConditionalExpression
app.js:4073:11
-         if (event.scale !== 1) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:4073:11
-         if (event.scale !== 1) {
+         if (false) {

[NoCoverage] EqualityOperator
app.js:4073:11
-         if (event.scale !== 1) {
+         if (event.scale === 1) {
