[NoCoverage] BlockStatement
app.js:4073:30
-         if (event.scale !== 1) {
-           event.preventDefault();
-         }
+         if (event.scale !== 1) {}

[NoCoverage] BlockStatement
app.js:4082:58
-     document.addEventListener("touchend", function (event) {
-       const currentTime = new Date().getTime();
-       const tapLength = currentTime - lastTapTime;
-       if (tapLength < 300 && tapLength > 0) {
-         event.preventDefault();
-       }
-       lastTapTime = currentTime;
-     });
+     document.addEventListener("touchend", function (event) {});

[NoCoverage] ArithmeticOperator
app.js:4084:23
-       const tapLength = currentTime - lastTapTime;
+       const tapLength = currentTime + lastTapTime;

[NoCoverage] ConditionalExpression
app.js:4085:9
-       if (tapLength < 300 && tapLength > 0) {
+       if (true) {

[NoCoverage] ConditionalExpression
app.js:4085:9
-       if (tapLength < 300 && tapLength > 0) {
+       if (false) {

[NoCoverage] LogicalOperator
app.js:4085:9
-       if (tapLength < 300 && tapLength > 0) {
+       if (tapLength < 300 || tapLength > 0) {

[NoCoverage] ConditionalExpression
app.js:4085:9
-       if (tapLength < 300 && tapLength > 0) {
+       if (true && tapLength > 0) {

[NoCoverage] EqualityOperator
app.js:4085:9
-       if (tapLength < 300 && tapLength > 0) {
+       if (tapLength <= 300 && tapLength > 0) {

[NoCoverage] EqualityOperator
app.js:4085:9
-       if (tapLength < 300 && tapLength > 0) {
+       if (tapLength >= 300 && tapLength > 0) {

[NoCoverage] ConditionalExpression
app.js:4085:28
-       if (tapLength < 300 && tapLength > 0) {
+       if (tapLength < 300 && true) {

[NoCoverage] EqualityOperator
app.js:4085:28
-       if (tapLength < 300 && tapLength > 0) {
+       if (tapLength < 300 && tapLength >= 0) {

[NoCoverage] EqualityOperator
app.js:4085:28
-       if (tapLength < 300 && tapLength > 0) {
+       if (tapLength < 300 && tapLength <= 0) {

[NoCoverage] BlockStatement
app.js:4085:43
-       if (tapLength < 300 && tapLength > 0) {
-         event.preventDefault();
-       }
+       if (tapLength < 300 && tapLength > 0) {}

[NoCoverage] BlockStatement
app.js:4109:45
-       .addEventListener("click", function (e) {
-         e.stopPropagation();
-         document.getElementById("transaction-modal").classList.add("hidden");
-         document.body.classList.remove("modal-open");
-         if (currentMap) {
-           currentMap.remove();
-           currentMap = null;
-         }
-         // Restore scroll position when closing modal
-         const scrollPos = parseInt(modal.dataset.scrollPosition || "0");
-         setTimeout(() => window.scrollTo(0, scrollPos), 0);
-       });
+       .addEventListener("click", function (e) {});

[NoCoverage] StringLiteral
app.js:4111:31
-         document.getElementById("transaction-modal").classList.add("hidden");
+         document.getElementById("").classList.add("hidden");

[NoCoverage] StringLiteral
app.js:4111:66
-         document.getElementById("transaction-modal").classList.add("hidden");
+         document.getElementById("transaction-modal").classList.add("");

[NoCoverage] StringLiteral
app.js:4112:38
-         document.body.classList.remove("modal-open");
+         document.body.classList.remove("");

[NoCoverage] ConditionalExpression
app.js:4113:11
-         if (currentMap) {
+         if (true) {

[NoCoverage] ConditionalExpression
app.js:4113:11
-         if (currentMap) {
+         if (false) {

[NoCoverage] BlockStatement
app.js:4113:23
-         if (currentMap) {
-           currentMap.remove();
-           currentMap = null;
-         }
+         if (currentMap) {}

[NoCoverage] ConditionalExpression
app.js:4118:34
-         const scrollPos = parseInt(modal.dataset.scrollPosition || "0");
+         const scrollPos = parseInt(true);

[NoCoverage] ConditionalExpression
app.js:4118:34
-         const scrollPos = parseInt(modal.dataset.scrollPosition || "0");
+         const scrollPos = parseInt(false);

[NoCoverage] LogicalOperator
app.js:4118:34
-         const scrollPos = parseInt(modal.dataset.scrollPosition || "0");
+         const scrollPos = parseInt(modal.dataset.scrollPosition && "0");

[NoCoverage] StringLiteral
app.js:4118:66
-         const scrollPos = parseInt(modal.dataset.scrollPosition || "0");
+         const scrollPos = parseInt(modal.dataset.scrollPosition || "");

[NoCoverage] ArrowFunction
app.js:4119:18
-         setTimeout(() => window.scrollTo(0, scrollPos), 0);
+         setTimeout(() => undefined, 0);

[NoCoverage] BlockStatement
app.js:4125:30
-         if (e.target === this) {
-           this.classList.add("hidden");
-           document.body.classList.remove("modal-open");
-           if (currentMap) {
-             currentMap.remove();
-             currentMap = null;
-           }
-           // Restore scroll position when closing modal
-           const scrollPos = parseInt(this.dataset.scrollPosition || "0");
-           setTimeout(() => window.scrollTo(0, scrollPos), 0);
-         }
+         if (e.target === this) {}

[NoCoverage] StringLiteral
app.js:4126:28
-           this.classList.add("hidden");
+           this.classList.add("");

[NoCoverage] StringLiteral
app.js:4127:40
-           document.body.classList.remove("modal-open");
+           document.body.classList.remove("");

[NoCoverage] ConditionalExpression
app.js:4128:13
-           if (currentMap) {
+           if (true) {

[NoCoverage] ConditionalExpression
app.js:4128:13
-           if (currentMap) {
+           if (false) {

[NoCoverage] BlockStatement
app.js:4128:25
-           if (currentMap) {
-             currentMap.remove();
-             currentMap = null;
-           }
+           if (currentMap) {}

[NoCoverage] ConditionalExpression
app.js:4133:36
-           const scrollPos = parseInt(this.dataset.scrollPosition || "0");
+           const scrollPos = parseInt(true);

[NoCoverage] ConditionalExpression
app.js:4133:36
-           const scrollPos = parseInt(this.dataset.scrollPosition || "0");
+           const scrollPos = parseInt(false);

[NoCoverage] LogicalOperator
app.js:4133:36
-           const scrollPos = parseInt(this.dataset.scrollPosition || "0");
+           const scrollPos = parseInt(this.dataset.scrollPosition && "0");

[NoCoverage] StringLiteral
app.js:4133:67
-           const scrollPos = parseInt(this.dataset.scrollPosition || "0");
+           const scrollPos = parseInt(this.dataset.scrollPosition || "");

[NoCoverage] ArrowFunction
app.js:4134:20
-           setTimeout(() => window.scrollTo(0, scrollPos), 0);
+           setTimeout(() => undefined, 0);

[NoCoverage] BlockStatement
app.js:4141:44
-       .addEventListener("click", function () {
-         deleteTransaction(currentTxIndex);
-       });
+       .addEventListener("click", function () {});

[NoCoverage] BlockStatement
app.js:4235:14
-         } else {
-           // Set filter to this account
-           filters.account = account;
-           document.getElementById("account-filter").value = account;
-         }
+         } else {}

[NoCoverage] StringLiteral
app.js:4238:33
-           document.getElementById("account-filter").value = account;
+           document.getElementById("").value = account;

[Survived] UnaryOperator
app.js:6:22
-   let currentTxIndex = -1;
+   let currentTxIndex = +1;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:5:24
-   let modalInitialized = false;
+   let modalInitialized = true;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:7:19
-   let currentView = "transactions"; // Can be: transactions, charts, budgets, settings
+   let currentView = ""; // Can be: transactions, charts, budgets, settings
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:12:5
-       { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+       {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:12:11
-       { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+       { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:12:23
-       { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+       { id: "cu", name: "", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:12:45
-       { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+       { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:12:66
-       { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+       { id: "cu", name: "Credit Union", icon: "university", color: "" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:13:5
-       { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+       {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:13:11
-       { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+       { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:13:28
-       { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+       { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:13:45
-       { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+       { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:13:67
-       { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+       { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:14:39
-       { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+       { id: "cash", name: "Cash", icon: "", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:14:25
-       { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+       { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:14:65
-       { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+       { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:18:5
-       "Food & Dining",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:20:5
-       "Transportation",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:19:5
-       "Shopping",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:21:5
-       "Bills & Utilities",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:22:5
-       "Entertainment",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:24:5
-       "Travel",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:23:5
-       "Health & Fitness",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:25:5
-       "Education",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:26:5
-       "Personal Care",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:27:5
-       "Gifts",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:30:9
-     tags: [],
+     tags: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:33:12
-       theme: "light",
+       theme: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:34:18
-       accentColor: "#4a90e2",
+       accentColor: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:35:25
-       pinnedTransactions: [],
+       pinnedTransactions: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:36:28
-       recurringTransactions: [],
+       recurringTransactions: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:37:14
-       version: "0.3.5",
+       version: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:39:16
-         widgets: {
-           totalBalance: true,
-           accounts: true,
-           recentTransactions: true,
-           upcomingBills: false,
-           spendingChart: false
-         },
+         widgets: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:40:23
-           totalBalance: true,
+           totalBalance: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:41:19
-           accounts: true,
+           accounts: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:42:29
-           recentTransactions: true,
+           recentTransactions: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:43:24
-           upcomingBills: false,
+           upcomingBills: true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:44:24
-           spendingChart: false
+           spendingChart: true
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:46:20
-         defaultView: "transactions"
+         defaultView: ""
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:49:20
-         googleDrive: {
-           connected: false,
-           lastBackup: null
-         }
+         googleDrive: {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:50:20
-           connected: false,
+           connected: true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:54:16
-       recurring: {
-         autoCreate: false,
-         notifications: false
-       }
+       recurring: {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:56:22
-         notifications: false
+         notifications: true
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:71:18
-          balances: savedData.balances || { cu: 0, revolut: 0, cash: 0 },
+          balances: true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:71:18
-          balances: savedData.balances || { cu: 0, revolut: 0, cash: 0 },
+          balances: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] LogicalOperator
app.js:71:18
-          balances: savedData.balances || { cu: 0, revolut: 0, cash: 0 },
+          balances: savedData.balances && {
+     cu: 0,
+     revolut: 0,
+     cash: 0
+   },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:73:20
-          categories: savedData.categories || [
-            "Food & Dining",
-            "Shopping",
-            "Transportation",
-            "Bills & Utilities",
-            "Entertainment",
-            "Health & Fitness",
-            "Travel",
-            "Education",
-            "Personal Care",
-            "Gifts & Donations",
-            "Income",
-            "Other",
-          ],
+          categories: true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:73:20
-          categories: savedData.categories || [
-            "Food & Dining",
-            "Shopping",
-            "Transportation",
-            "Bills & Utilities",
-            "Entertainment",
-            "Health & Fitness",
-            "Travel",
-            "Education",
-            "Personal Care",
-            "Gifts & Donations",
-            "Income",
-            "Other",
-          ],
+          categories: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings
