[Survived] LogicalOperator
app.js:73:20
-          categories: savedData.categories || [
-            "Food & Dining",
-            "Shopping",
-            "Transportation",
-            "Bills & Utilities",
-            "Entertainment",
-            "Health & Fitness",
-            "Travel",
-            "Education",
-            "Personal Care",
-            "Gifts & Donations",
-            "Income",
-            "Other",
-          ],
+          categories: savedData.categories && ["Food & Dining", "Shopping", "Transportation", "Bills & Utilities", "Entertainment", "Health & Fitness", "Travel", "Education", "Personal Care", "Gifts & Donations", "Income", "Other"],
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ArrayDeclaration
app.js:73:44
-          categories: savedData.categories || [
-            "Food & Dining",
-            "Shopping",
-            "Transportation",
-            "Bills & Utilities",
-            "Entertainment",
-            "Health & Fitness",
-            "Travel",
-            "Education",
-            "Personal Care",
-            "Gifts & Donations",
-            "Income",
-            "Other",
-          ],
+          categories: savedData.categories || [],
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:74:10
-            "Food & Dining",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:75:10
-            "Shopping",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:76:10
-            "Transportation",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:77:10
-            "Bills & Utilities",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:78:10
-            "Entertainment",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:79:10
-            "Health & Fitness",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:80:10
-            "Travel",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:81:10
-            "Education",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:82:10
-            "Personal Care",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:83:10
-            "Gifts & Donations",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:84:10
-            "Income",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:85:10
-            "Other",
+            "",
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:87:17
-          budgets: savedData.budgets || {},
+          budgets: true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:87:17
-          budgets: savedData.budgets || {},
+          budgets: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] LogicalOperator
app.js:87:17
-          budgets: savedData.budgets || {},
+          budgets: savedData.budgets && {},
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:92:10
-        if (!data.settings) data.settings = {};
+        if (false) data.settings = {};
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:93:10
-        if (!data.settings.theme) data.settings.theme = "light";
+        if (data.settings.theme) data.settings.theme = "light";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:93:10
-        if (!data.settings.theme) data.settings.theme = "light";
+        if (true) data.settings.theme = "light";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:93:10
-        if (!data.settings.theme) data.settings.theme = "light";
+        if (false) data.settings.theme = "light";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:93:54
-        if (!data.settings.theme) data.settings.theme = "light";
+        if (!data.settings.theme) data.settings.theme = "";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:94:10
-        if (!data.settings.accentColor) data.settings.accentColor = "#4a90e2";
+        if (data.settings.accentColor) data.settings.accentColor = "#4a90e2";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:94:10
-        if (!data.settings.accentColor) data.settings.accentColor = "#4a90e2";
+        if (true) data.settings.accentColor = "#4a90e2";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:94:10
-        if (!data.settings.accentColor) data.settings.accentColor = "#4a90e2";
+        if (false) data.settings.accentColor = "#4a90e2";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:94:66
-        if (!data.settings.accentColor) data.settings.accentColor = "#4a90e2";
+        if (!data.settings.accentColor) data.settings.accentColor = "";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:95:10
-        if (!data.settings.pinnedTransactions) data.settings.pinnedTransactions = [];
+        if (true) data.settings.pinnedTransactions = [];
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ArrayDeclaration
app.js:95:80
-        if (!data.settings.pinnedTransactions) data.settings.pinnedTransactions = [];
+        if (!data.settings.pinnedTransactions) data.settings.pinnedTransactions = ["Stryker was here"];
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:96:10
-        if (!data.settings.recurringTransactions) data.settings.recurringTransactions = [];
+        if (data.settings.recurringTransactions) data.settings.recurringTransactions = [];
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:96:10
-        if (!data.settings.recurringTransactions) data.settings.recurringTransactions = [];
+        if (true) data.settings.recurringTransactions = [];
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:96:10
-        if (!data.settings.recurringTransactions) data.settings.recurringTransactions = [];
+        if (false) data.settings.recurringTransactions = [];
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ArrayDeclaration
app.js:96:86
-        if (!data.settings.recurringTransactions) data.settings.recurringTransactions = [];
+        if (!data.settings.recurringTransactions) data.settings.recurringTransactions = ["Stryker was here"];
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:99:10
-        if (!data.settings.dashboard) data.settings.dashboard = {};
+        if (true) data.settings.dashboard = {};
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:100:10
-        if (!data.settings.dashboard.widgets) data.settings.dashboard.widgets = {
+        if (true) data.settings.dashboard.widgets = {
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ObjectLiteral
app.js:100:78
-        if (!data.settings.dashboard.widgets) data.settings.dashboard.widgets = {
-          totalBalance: true,
-          accounts: true,
-          recentTransactions: true,
-          upcomingBills: false,
-          spendingChart: false
-        };
+        if (!data.settings.dashboard.widgets) data.settings.dashboard.widgets = {};
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:101:22
-          totalBalance: true,
+          totalBalance: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:102:18
-          accounts: true,
+          accounts: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:103:28
-          recentTransactions: true,
+          recentTransactions: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:104:23
-          upcomingBills: false,
+          upcomingBills: true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:105:23
-          spendingChart: false
+          spendingChart: true
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:107:10
-        if (!data.settings.dashboard.defaultView) data.settings.dashboard.defaultView = "transactions";
+        if (true) data.settings.dashboard.defaultView = "transactions";
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:110:10
-        if (!data.settings.backup) data.settings.backup = {};
+        if (true) data.settings.backup = {};
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:111:10
-        if (!data.settings.backup.googleDrive) data.settings.backup.googleDrive = {
+        if (true) data.settings.backup.googleDrive = {
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:117:10
-        if (!data.settings.recurring) data.settings.recurring = {
+        if (true) data.settings.recurring = {
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:119:23
-          notifications: false
+          notifications: true
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ObjectLiteral
app.js:126:9
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           {},
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:126:15
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:126:27
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "cu", name: "", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:126:49
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:126:70
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "cu", name: "Credit Union", icon: "university", color: "" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] ObjectLiteral
app.js:127:9
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           {},
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:127:15
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:127:49
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:127:32
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:127:71
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] ObjectLiteral
app.js:128:9
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           {}
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:128:29
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:128:15
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:128:43
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "cash", name: "Cash", icon: "", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:128:69
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version

[Survived] StringLiteral
app.js:141:58
-           category: tx.category || (tx.type === "income" ? "Income" : "Other"),
+           category: tx.category || (tx.type === "income" ? "" : "Other"),
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:141:35
-           category: tx.category || (tx.type === "income" ? "Income" : "Other"),
+           category: tx.category || (false ? "Income" : "Other"),
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:141:47
-           category: tx.category || (tx.type === "income" ? "Income" : "Other"),
+           category: tx.category || (tx.type === "" ? "Income" : "Other"),
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:142:22
-           isRecurring: tx.isRecurring || false,
+           isRecurring: true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:142:22
-           isRecurring: tx.isRecurring || false,
+           isRecurring: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] LogicalOperator
app.js:142:22
-           isRecurring: tx.isRecurring || false,
+           isRecurring: tx.isRecurring && false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:142:40
-           isRecurring: tx.isRecurring || false,
+           isRecurring: tx.isRecurring || true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:143:19
-           isPinned: tx.isPinned || false,
+           isPinned: true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:143:19
-           isPinned: tx.isPinned || false,
+           isPinned: false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] LogicalOperator
app.js:143:19
-           isPinned: tx.isPinned || false,
+           isPinned: tx.isPinned && false,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] BooleanLiteral
app.js:143:34
-           isPinned: tx.isPinned || false,
+           isPinned: tx.isPinned || true,
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:152:11
-         if (!account.color) {
+         if (true) {
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:156:13
-           if (account.id === "cash") return { ...account, color: "#ff9800" };
+           if (true) return { ...account, color: "#ff9800" };
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:158:43
-           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
+           const defaultColors = ["#4a90e2", "", "#f44336", "#ff9800", "#9c27b0", "#795548"];
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:158:54
-           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
+           const defaultColors = ["#4a90e2", "#50c878", "", "#ff9800", "#9c27b0", "#795548"];
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:158:65
-           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
+           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "", "#9c27b0", "#795548"];
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings
