[Survived] ArithmeticOperator
app.js:159:54
-           const randomColor = defaultColors[Math.floor(Math.random() * defaultColors.length)];
+           const randomColor = defaultColors[Math.floor(Math.random() / defaultColors.length)];
Tests ran:
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:177:19
-       console.error("Error loading data:", error);
+       console.error("", error);
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ObjectLiteral
app.js:180:17
-         balances: { cu: 0, revolut: 0, cash: 0 },
+         balances: {},
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ObjectLiteral
app.js:183:9
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           {},
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:183:15
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:183:49
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:183:27
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "cu", name: "", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:184:15
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ObjectLiteral
app.js:184:9
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           {},
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:183:70
-           { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+           { id: "cu", name: "Credit Union", icon: "university", color: "" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:184:32
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:184:71
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:184:49
-           { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+           { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ObjectLiteral
app.js:185:9
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           {}
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:185:15
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:185:43
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "cash", name: "Cash", icon: "", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:185:29
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:185:69
-           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+           { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ArrayDeclaration
app.js:187:19
-         categories: [
-           "Food & Dining",
-           "Shopping",
-           "Transportation",
-           "Bills & Utilities",
-           "Entertainment",
-           "Health & Fitness",
-           "Travel",
-           "Education",
-           "Personal Care",
-           "Gifts",
-           "Other",
-         ],
+         categories: [],
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:188:9
-           "Food & Dining",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:189:9
-           "Shopping",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:190:9
-           "Transportation",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:191:9
-           "Bills & Utilities",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:194:9
-           "Travel",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:195:9
-           "Education",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:193:9
-           "Health & Fitness",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:192:9
-           "Entertainment",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:196:9
-           "Personal Care",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:198:9
-           "Other",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] StringLiteral
app.js:197:9
-           "Gifts",
+           "",
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ArrayDeclaration
app.js:203:29
-           pinnedTransactions: [],
+           pinnedTransactions: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] ArrayDeclaration
app.js:204:32
-           recurringTransactions: [],
+           recurringTransactions: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests resets to defaults when saved data cannot be parsed

[Survived] BlockStatement
app.js:218:7
-     try {
-       localStorage.setItem(STORAGE_KEY, JSON.stringify(data));
-     } catch (error) {
+     try {} catch (error) {
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
  and 36 more tests!

[Survived] BlockStatement
app.js:217:21
-   function saveData() {
-     try {
-       localStorage.setItem(STORAGE_KEY, JSON.stringify(data));
-     } catch (error) {
-       console.error("Error saving data:", error);
-       showUpdateNotification("Error saving data. Local storage may be full.");
-     }
-   }
+   function saveData() {}
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
  and 36 more tests!

[Survived] StringLiteral
app.js:215:24
-     localStorage.setItem("app-version", APP_VERSION);
+     localStorage.setItem("", APP_VERSION);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:241:70
-     document.querySelectorAll(".card[data-account]").forEach((card) => {
-       const acc = card.dataset.account;
-       let balance = data.balances[acc] !== undefined ? data.balances[acc] : 0;
-       card.querySelector(".balance").textContent = formatAmt(balance);
-     });
+     document.querySelectorAll(".card[data-account]").forEach((card) => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:243:19
-       let balance = data.balances[acc] !== undefined ? data.balances[acc] : 0;
+       let balance = true ? data.balances[acc] : 0;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:243:19
-       let balance = data.balances[acc] !== undefined ? data.balances[acc] : 0;
+       let balance = false ? data.balances[acc] : 0;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:243:19
-       let balance = data.balances[acc] !== undefined ? data.balances[acc] : 0;
+       let balance = data.balances[acc] === undefined ? data.balances[acc] : 0;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:254:31
-     balancesSection.innerHTML = "";
+     balancesSection.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:257:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:257:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts && !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:267:7
-     if (!data.tags || !Array.isArray(data.tags)) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:267:7
-     if (!data.tags || !Array.isArray(data.tags)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:267:7
-     if (!data.tags || !Array.isArray(data.tags)) {
+     if (!data.tags && !Array.isArray(data.tags)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:267:7
-     if (!data.tags || !Array.isArray(data.tags)) {
+     if (data.tags || !Array.isArray(data.tags)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:267:21
-     if (!data.tags || !Array.isArray(data.tags)) {
+     if (!data.tags || Array.isArray(data.tags)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:272:7
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:272:7
-     if (!data.bills || !Array.isArray(data.bills)) {
+     if (!data.bills && !Array.isArray(data.bills)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:282:9
-       if (account.color) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:282:9
-       if (account.color) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:282:24
-       if (account.color) {
-         card.style.borderLeft = `4px solid ${account.color}`;
-       }
+       if (account.color) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:283:31
-         card.style.borderLeft = `4px solid ${account.color}`;
+         card.style.borderLeft = ``;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:298:11
-         if (e.target.closest('.edit-account-btn')) return;
+         if (false) return;
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound
    black-box functional tests using EP, BA, EG, and simple combinations Combinatorial: clicking the same account card twice toggles the account filter off

[Survived] ArrowFunction
app.js:300:64
-         document.querySelectorAll(".card[data-account]").forEach(c => c.classList.remove("active"));
+         document.querySelectorAll(".card[data-account]").forEach(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound
    black-box functional tests using EP, BA, EG, and simple combinations Combinatorial: clicking the same account card twice toggles the account filter off

[Survived] StringLiteral
app.js:287:65
-         <i class="fas fa-${account.icon} fa-2x" ${account.color ? `style="color:${account.color}"` : ''}></i>
+         <i class="fas fa-${account.icon} fa-2x" ${account.color ? `` : ''}></i>
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:308:30
-       editBtn.addEventListener("click", function(e) {
+       editBtn.addEventListener("", function(e) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:319:23
-     addCard.className = "card add-account-card";
+     addCard.className = "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:328:48
-     addCard.addEventListener("click", function() {
-       openNewAccountModal();
-     });
+     addCard.addEventListener("click", function() {});
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] StringLiteral
app.js:341:53
-     document.getElementById("new-account-id").value = "";
+     document.getElementById("new-account-id").value = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] StringLiteral
app.js:321:23
-     addCard.innerHTML = `
-       <i class="fas fa-plus fa-2x"></i>
-       <div>
-         <strong>Add Account</strong>
-       </div>
-     `;
+     addCard.innerHTML = ``;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:342:55
-     document.getElementById("new-account-icon").value = "university";
+     document.getElementById("new-account-icon").value = "";
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] StringLiteral
app.js:343:56
-     document.getElementById("new-account-color").value = "#4a90e2";
+     document.getElementById("new-account-color").value = "";
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] StringLiteral
app.js:346:60
-     document.querySelector("#accounts-modal h3").innerHTML = '<i class="fas fa-plus"></i> Add New Account';
+     document.querySelector("#accounts-modal h3").innerHTML = "";
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] ArrowFunction
app.js:358:53
-     document.querySelectorAll('.icon-option').forEach(icon => icon.classList.remove('selected'));
+     document.querySelectorAll('.icon-option').forEach(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] ArrowFunction
app.js:361:54
-     document.querySelectorAll('.color-option').forEach(color => color.classList.remove('selected'));
+     document.querySelectorAll('.color-option').forEach(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] StringLiteral
app.js:328:28
-     addCard.addEventListener("click", function() {
+     addCard.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:366:32
-     nameInput.style.borderLeft = "4px solid #4a90e2";
+     nameInput.style.borderLeft = "";
Tests ran:
    white-box DOM and state integration-style tests opens the new-account modal in add mode
    black-box functional tests using EP, BA, EG, and simple combinations EG: rejects an empty account name from the account form

[Survived] MethodExpression
app.js:386:12
-     let id = idInput.value.trim().toLowerCase();
+     let id = idInput.value.toLowerCase();
Tests ran:
    white-box DOM and state integration-style tests rejects saving an account with an empty name
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name
  and 2 more tests!

[Survived] Regex
app.js:407:39
-         id = name.toLowerCase().replace(/\s+/g, '-').replace(/[^a-z0-9-]/g, '');
+         id = name.toLowerCase().replace(/\s/g, '-').replace(/[^a-z0-9-]/g, '');
Tests ran:
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] ConditionalExpression
app.js:411:14
-         while (data.accounts.some(account => account.id === uniqueId)) {
+         while (false) {
Tests ran:
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] MethodExpression
app.js:411:14
-         while (data.accounts.some(account => account.id === uniqueId)) {
+         while (data.accounts.every(account => account.id === uniqueId)) {
Tests ran:
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] ArrowFunction
app.js:411:33
-         while (data.accounts.some(account => account.id === uniqueId)) {
+         while (data.accounts.some(() => undefined)) {
Tests ran:
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] ConditionalExpression
app.js:411:44
-         while (data.accounts.some(account => account.id === uniqueId)) {
+         while (data.accounts.some(account => false)) {
Tests ran:
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] ConditionalExpression
app.js:419:9
-       if (data.accounts.some(account => account.id === id)) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] ConditionalExpression
app.js:419:39
-       if (data.accounts.some(account => account.id === id)) {
+       if (data.accounts.some(account => true)) {
Tests ran:
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] EqualityOperator
app.js:419:39
-       if (data.accounts.some(account => account.id === id)) {
+       if (data.accounts.some(account => account.id !== id)) {
Tests ran:
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name

[Survived] StringLiteral
app.js:422:30
-         showUpdateNotification(`Account ID "${id}" already exists. A unique ID will be generated for you.`);
+         showUpdateNotification(``);
Tests ran:
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually

[Survived] UpdateOperator
app.js:429:9
-           counter++;
+           counter--;
Tests ran:
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually

[Survived] StringLiteral
app.js:452:28
-       showUpdateNotification(`Account "${name}" added successfully`);
+       showUpdateNotification(``);
Tests ran:
    white-box DOM and state integration-style tests generates a unique account id when a duplicate id is entered manually
    white-box DOM and state integration-style tests auto-generates a sanitized unique account id from the account name
