[Survived] ConditionalExpression
app.js:457:9
-       if (accountIndex !== -1) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests updates an existing account without changing its id

[Survived] UnaryOperator
app.js:457:26
-       if (accountIndex !== -1) {
+       if (accountIndex !== +1) {
Tests ran:
    white-box DOM and state integration-style tests updates an existing account without changing its id

[Survived] StringLiteral
app.js:463:30
-         showUpdateNotification(`Account "${name}" updated successfully`);
+         showUpdateNotification(``);
Tests ran:
    white-box DOM and state integration-style tests updates an existing account without changing its id

[Survived] ConditionalExpression
app.js:484:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] LogicalOperator
app.js:484:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts && !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BooleanLiteral
app.js:484:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (data.accounts || !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BooleanLiteral
app.js:484:25
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts || Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled

[Survived] ObjectLiteral
app.js:486:7
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         {},
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:486:13
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:486:25
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:486:47
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:486:68
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "university", color: "" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ObjectLiteral
app.js:487:7
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         {},
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:487:13
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:487:30
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:487:47
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:487:69
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:488:41
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:488:67
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }
Tests ran:
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:498:60
-     document.querySelector("#accounts-modal h3").innerHTML = '<i class="fas fa-edit"></i> Edit Account';
+     document.querySelector("#accounts-modal h3").innerHTML = "";
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:493:7
-     if (!account) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:503:55
-     document.getElementById("new-account-icon").value = account.icon || "university";
+     document.getElementById("new-account-icon").value = true;
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:503:55
-     document.getElementById("new-account-icon").value = account.icon || "university";
+     document.getElementById("new-account-icon").value = false;
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] LogicalOperator
app.js:503:55
-     document.getElementById("new-account-icon").value = account.icon || "university";
+     document.getElementById("new-account-icon").value = account.icon && "university";
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:504:24
-     const accountColor = account.color || "#4a90e2";
+     const accountColor = true;
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:504:24
-     const accountColor = account.color || "#4a90e2";
+     const accountColor = false;
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] LogicalOperator
app.js:504:24
-     const accountColor = account.color || "#4a90e2";
+     const accountColor = account.color && "#4a90e2";
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:509:32
-     nameInput.style.borderLeft = `4px solid ${accountColor}`;
+     nameInput.style.borderLeft = ``;
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BlockStatement
app.js:518:61
-     document.querySelectorAll('.icon-option').forEach(icon => {
-       icon.classList.remove('selected');
-       if (icon.getAttribute('data-icon') === account.icon) {
-         icon.classList.add('selected');
-       }
-     });
+     document.querySelectorAll('.icon-option').forEach(icon => {});
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:520:9
-       if (icon.getAttribute('data-icon') === account.icon) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:520:9
-       if (icon.getAttribute('data-icon') === account.icon) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] EqualityOperator
app.js:520:9
-       if (icon.getAttribute('data-icon') === account.icon) {
+       if (icon.getAttribute('data-icon') !== account.icon) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:520:27
-       if (icon.getAttribute('data-icon') === account.icon) {
+       if (icon.getAttribute("") === account.icon) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BlockStatement
app.js:520:58
-       if (icon.getAttribute('data-icon') === account.icon) {
-         icon.classList.add('selected');
-       }
+       if (icon.getAttribute('data-icon') === account.icon) {}
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BlockStatement
app.js:526:63
-     document.querySelectorAll('.color-option').forEach(color => {
-       color.classList.remove('selected');
-       if (color.getAttribute('data-color') === account.color) {
-         color.classList.add('selected');
-       }
-     });
+     document.querySelectorAll('.color-option').forEach(color => {});
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:528:9
-       if (color.getAttribute('data-color') === account.color) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:528:9
-       if (color.getAttribute('data-color') === account.color) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] EqualityOperator
app.js:528:9
-       if (color.getAttribute('data-color') === account.color) {
+       if (color.getAttribute('data-color') !== account.color) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] StringLiteral
app.js:528:28
-       if (color.getAttribute('data-color') === account.color) {
+       if (color.getAttribute("") === account.color) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BlockStatement
app.js:528:61
-       if (color.getAttribute('data-color') === account.color) {
-         color.classList.add('selected');
-       }
+       if (color.getAttribute('data-color') === account.color) {}
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] BooleanLiteral
app.js:534:7
-     if (!document.querySelector('.color-option.selected')) {
+     if (document.querySelector('.color-option.selected')) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:534:7
-     if (!document.querySelector('.color-option.selected')) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:534:7
-     if (!document.querySelector('.color-option.selected')) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit-account modal with the selected account data
    white-box DOM and state integration-style tests closes the account modal when account editing is canceled
    white-box DOM and state integration-style tests restores default accounts when opening edit mode with a corrupted accounts array

[Survived] ConditionalExpression
app.js:550:7
-     if (!currentEditingAccountId) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests returns early when deleteAccount is called without a current editing account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation
  and 1 more test!

[Survived] ConditionalExpression
app.js:553:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation
    white-box DOM and state integration-style tests refuses to delete the last remaining account

[Survived] LogicalOperator
app.js:553:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts && !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation
    white-box DOM and state integration-style tests refuses to delete the last remaining account

[Survived] ConditionalExpression
app.js:567:43
-     const account = data.accounts.find(a => a.id === currentEditingAccountId);
+     const account = data.accounts.find(a => true);
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation

[Survived] EqualityOperator
app.js:567:43
-     const account = data.accounts.find(a => a.id === currentEditingAccountId);
+     const account = data.accounts.find(a => a.id !== currentEditingAccountId);
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation

[Survived] ConditionalExpression
app.js:568:7
-     if (!account) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation

[Survived] StringLiteral
app.js:571:16
-     if (!confirm(`Are you sure you want to delete the "${account.name}" account? All transactions for this account will remain but will be labeled as "Unknown Account".`)) {
+     if (!confirm(``)) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account
    white-box DOM and state integration-style tests does not delete an account when the user cancels confirmation

[Survived] ConditionalExpression
app.js:577:7
-     if (accountIndex === -1) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account

[Survived] UnaryOperator
app.js:577:24
-     if (accountIndex === -1) return;
+     if (accountIndex === +1) return;
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account

[Survived] ConditionalExpression
app.js:581:9
-       if (tx.account === currentEditingAccountId) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account

[Survived] LogicalOperator
app.js:591:22
-     const oldBalance = data.balances[currentEditingAccountId] || 0;
+     const oldBalance = data.balances[currentEditingAccountId] && 0;
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account

[Survived] StringLiteral
app.js:611:26
-     showUpdateNotification(`Account "${accountName}" deleted. Balance of ${formatAmt(oldBalance)} was removed.`);
+     showUpdateNotification(``);
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account

[Survived] BlockStatement
app.js:625:63
-     document.querySelectorAll('.icon-option').forEach(option => {
-       option.addEventListener('click', function() {
-         // Remove selected class from all options
-         document.querySelectorAll('.icon-option').forEach(opt => opt.classList.remove('selected'));
-         
-         // Add selected class to this option
-         this.classList.add('selected');
-         
-         // Update the hidden input
-         document.getElementById('new-account-icon').value = this.getAttribute('data-icon');
-       });
-     });
+     document.querySelectorAll('.icon-option').forEach(option => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:626:29
-       option.addEventListener('click', function() {
+       option.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:639:64
-     document.querySelectorAll('.color-option').forEach(option => {
-       // Set the background color based on the data-color attribute
-       option.style.backgroundColor = option.getAttribute('data-color');
-       
-       option.addEventListener('click', function() {
-         const color = this.getAttribute('data-color');
-         
-         // Remove selected class from all options
-         document.querySelectorAll('.color-option').forEach(opt => opt.classList.remove('selected'));
-         
-         // Add selected class to this option
-         this.classList.add('selected');
-         
-         // Update the hidden input
-         document.getElementById('new-account-color').value = color;
-         
-         // Update the name input border to reflect selected color
-         const nameInput = document.getElementById('new-account-name');
-         nameInput.style.borderLeft = `4px solid ${color}`;
-       });
-     });
+     document.querySelectorAll('.color-option').forEach(option => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:641:56
-       option.style.backgroundColor = option.getAttribute('data-color');
+       option.style.backgroundColor = option.getAttribute("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:643:29
-       option.addEventListener('click', function() {
+       option.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:662:7
-     if (document.querySelectorAll('.icon-option').length > 0) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:662:7
-     if (document.querySelectorAll('.icon-option').length > 0) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:662:7
-     if (document.querySelectorAll('.icon-option').length > 0) {
+     if (document.querySelectorAll('.icon-option').length >= 0) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:662:7
-     if (document.querySelectorAll('.icon-option').length > 0) {
+     if (document.querySelectorAll('.icon-option').length <= 0) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!
