[Survived] BlockStatement
app.js:662:61
-     if (document.querySelectorAll('.icon-option').length > 0) {
-       document.querySelectorAll('.icon-option')[0].classList.add('selected');
-       document.getElementById('new-account-icon').value = document.querySelectorAll('.icon-option')[0].getAttribute('data-icon');
-     }
+     if (document.querySelectorAll('.icon-option').length > 0) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:664:115
-       document.getElementById('new-account-icon').value = document.querySelectorAll('.icon-option')[0].getAttribute('data-icon');
+       document.getElementById('new-account-icon').value = document.querySelectorAll('.icon-option')[0].getAttribute("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:667:7
-     if (document.querySelectorAll('.color-option').length > 0) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:667:7
-     if (document.querySelectorAll('.color-option').length > 0) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:667:7
-     if (document.querySelectorAll('.color-option').length > 0) {
+     if (document.querySelectorAll('.color-option').length >= 0) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:667:7
-     if (document.querySelectorAll('.color-option').length > 0) {
+     if (document.querySelectorAll('.color-option').length <= 0) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:667:62
-     if (document.querySelectorAll('.color-option').length > 0) {
-       document.querySelectorAll('.color-option')[0].classList.add('selected');
-       const defaultColor = document.querySelectorAll('.color-option')[0].getAttribute('data-color');
-       document.getElementById('new-account-color').value = defaultColor;
-       
-       // Set initial color on name input
-       const nameInput = document.getElementById('new-account-name');
-       nameInput.style.borderLeft = `4px solid ${defaultColor}`;
-     }
+     if (document.querySelectorAll('.color-option').length > 0) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:669:85
-       const defaultColor = document.querySelectorAll('.color-option')[0].getAttribute('data-color');
+       const defaultColor = document.querySelectorAll('.color-option')[0].getAttribute("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:674:34
-       nameInput.style.borderLeft = `4px solid ${defaultColor}`;
+       nameInput.style.borderLeft = ``;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:678:45
-     const nameInput = document.getElementById('new-account-name');
+     const nameInput = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:679:7
-     if (nameInput) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:679:7
-     if (nameInput) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:679:18
-     if (nameInput) {
-       nameInput.addEventListener('input', function() {
-         if (this.classList.contains('input-error')) {
-           this.classList.remove('input-error');
-         }
-       });
-     }
+     if (nameInput) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:680:32
-       nameInput.addEventListener('input', function() {
+       nameInput.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:724:37
-   function getAccountColor(accountId) {
-     // Safety check to ensure accounts array exists
-     if (!data.accounts || !Array.isArray(data.accounts)) {
-       return '#607d8b'; // Default color if accounts array is missing
-     }
-     const account = data.accounts.find(a => a.id === accountId);
-     return account && account.color ? account.color : '#607d8b'; // Default color for unknown accounts
-   }
+   function getAccountColor(accountId) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ConditionalExpression
app.js:726:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ConditionalExpression
app.js:726:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ConditionalExpression
app.js:712:7
-     if (!data.balances) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:726:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts && !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] BooleanLiteral
app.js:726:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (data.accounts || !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] BooleanLiteral
app.js:726:25
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts || Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ArrowFunction
app.js:729:38
-     const account = data.accounts.find(a => a.id === accountId);
+     const account = data.accounts.find(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ConditionalExpression
app.js:729:43
-     const account = data.accounts.find(a => a.id === accountId);
+     const account = data.accounts.find(a => true);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ConditionalExpression
app.js:729:43
-     const account = data.accounts.find(a => a.id === accountId);
+     const account = data.accounts.find(a => false);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] StringLiteral
app.js:730:53
-     return account && account.color ? account.color : '#607d8b'; // Default color for unknown accounts
+     return account && account.color ? account.color : ""; // Default color for unknown accounts
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions to unknown when deleting a non-last account

[Survived] EqualityOperator
app.js:729:43
-     const account = data.accounts.find(a => a.id === accountId);
+     const account = data.accounts.find(a => a.id !== accountId);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] ConditionalExpression
app.js:730:10
-     return account && account.color ? account.color : '#607d8b'; // Default color for unknown accounts
+     return false ? account.color : '#607d8b'; // Default color for unknown accounts
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 24 more tests!

[Survived] BlockStatement
app.js:734:26
-   function updateFilters() {
-     const accountFilter = document.getElementById("account-filter");
-     if (!accountFilter) return;
-     
-     // Update account filter options
-     updateAccountOptions();
-     
-     // Select the appropriate option based on current filter state
-     if (filters.account && filters.account !== "all") {
-       if (accountFilter.querySelector(`option[value="${filters.account}"]`)) {
-         accountFilter.value = filters.account;
-       } else {
-         filters.account = "all";
-         accountFilter.value = "all";
-       }
-     }
-     
-     // Make sure the rendered transactions reflect the filter changes
-     renderTransactions();
-   }
+   function updateFilters() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:735:49
-     const accountFilter = document.getElementById("account-filter");
+     const accountFilter = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:736:7
-     if (!accountFilter) return;
+     if (accountFilter) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:736:7
-     if (!accountFilter) return;
+     if (true) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:736:7
-     if (!accountFilter) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:742:7
-     if (filters.account && filters.account !== "all") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:742:7
-     if (filters.account && filters.account !== "all") {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:742:7
-     if (filters.account && filters.account !== "all") {
+     if (filters.account || filters.account !== "all") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:742:26
-     if (filters.account && filters.account !== "all") {
+     if (filters.account && true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:742:26
-     if (filters.account && filters.account !== "all") {
+     if (filters.account && filters.account === "all") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:742:46
-     if (filters.account && filters.account !== "all") {
+     if (filters.account && filters.account !== "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:758:45
-     const txAccount = document.getElementById("tx-account");
+     const txAccount = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:759:49
-     const editTxAccount = document.getElementById("edit-tx-account");
+     const editTxAccount = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:760:49
-     const accountFilter = document.getElementById("account-filter");
+     const accountFilter = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:763:7
-     if (!txAccount || !editTxAccount) return;
+     if (true) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:763:7
-     if (!txAccount || !editTxAccount) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:763:7
-     if (!txAccount || !editTxAccount) return;
+     if (!txAccount && !editTxAccount) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:763:7
-     if (!txAccount || !editTxAccount) return;
+     if (txAccount || !editTxAccount) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:763:21
-     if (!txAccount || !editTxAccount) return;
+     if (!txAccount || editTxAccount) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:766:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:766:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts && !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:776:25
-     txAccount.innerHTML = '';
+     txAccount.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:777:29
-     editTxAccount.innerHTML = '';
+     editTxAccount.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:780:7
-     if (accountFilter) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:780:7
-     if (accountFilter) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:780:22
-     if (accountFilter) {
-       // Save the 'All Accounts' option
-       const allOption = accountFilter.querySelector('option[value="all"]');
-       accountFilter.innerHTML = '';
-       if (allOption) {
-         accountFilter.appendChild(allOption);
-       } else {
-         const option = document.createElement("option");
-         option.value = "all";
-         option.textContent = "All Accounts";
-         accountFilter.appendChild(option);
-       }
-     }
+     if (accountFilter) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:783:31
-       accountFilter.innerHTML = '';
+       accountFilter.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:784:9
-       if (allOption) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:784:9
-       if (allOption) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:784:20
-       if (allOption) {
-         accountFilter.appendChild(allOption);
-       } else {
+       if (allOption) {} else {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:808:9
-       if (accountFilter) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:821:17
-   let sortOrder = "date-desc";
+   let sortOrder = "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:829:9
-       if (filters.account !== "all" && tx.account !== filters.account)
+       if (false)
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!
