[Survived] ConditionalExpression
app.js:831:9
-       if (filters.type !== "all" && tx.type !== filters.type) return false;
+       if (false) return false;
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] StringLiteral
app.js:825:18
-     ul.innerHTML = "";
+     ul.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:837:5
-       case "date-desc":
-         filteredTransactions.sort((a, b) => new Date(b.date) - new Date(a.date));
-         break;
+       case "date-desc":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] MethodExpression
app.js:838:7
-         filteredTransactions.sort((a, b) => new Date(b.date) - new Date(a.date));
+         filteredTransactions;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:837:10
-       case "date-desc":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:843:10
-       case "amount-desc":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests updates sortOrder through the sort-by change event

[Survived] StringLiteral
app.js:840:10
-       case "date-asc":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests updates sortOrder through the sort-by change event

[Survived] ArithmeticOperator
app.js:838:43
-         filteredTransactions.sort((a, b) => new Date(b.date) - new Date(a.date));
+         filteredTransactions.sort((a, b) => new Date(b.date) + new Date(a.date));
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests clears date filtering when no start and end dates are provided
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due
  and 6 more tests!

[Survived] ConditionalExpression
app.js:846:5
-       case "amount-asc":
-         filteredTransactions.sort((a, b) => a.amount - b.amount);
-         break;
+       case "amount-asc":
Tests ran:
    white-box DOM and state integration-style tests updates sortOrder through the sort-by change event

[Survived] StringLiteral
app.js:846:10
-       case "amount-asc":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests updates sortOrder through the sort-by change event

[Survived] MethodExpression
app.js:847:7
-         filteredTransactions.sort((a, b) => a.amount - b.amount);
+         filteredTransactions;
Tests ran:
    white-box DOM and state integration-style tests updates sortOrder through the sort-by change event

[Survived] ArrowFunction
app.js:847:33
-         filteredTransactions.sort((a, b) => a.amount - b.amount);
+         filteredTransactions.sort(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests updates sortOrder through the sort-by change event

[Survived] ArrowFunction
app.js:838:33
-         filteredTransactions.sort((a, b) => new Date(b.date) - new Date(a.date));
+         filteredTransactions.sort(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:861:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         true,
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] MethodExpression
app.js:852:30
-     const pinnedTransactions = filteredTransactions.filter((tx) => tx.isPinned);
+     const pinnedTransactions = filteredTransactions;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrowFunction
app.js:852:58
-     const pinnedTransactions = filteredTransactions.filter((tx) => tx.isPinned);
+     const pinnedTransactions = filteredTransactions.filter(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] MethodExpression
app.js:853:31
-     const regularTransactions = filteredTransactions.filter((tx) => !tx.isPinned);
+     const regularTransactions = filteredTransactions;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] MethodExpression
app.js:861:24
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id || "tx-" + Math.random().toString(36),
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:861:16
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id || "" + Math.random().toString(36).substr(2, 9),
Tests ran:
    white-box DOM and state integration-style tests loads older saved data, migrates missing fields, and upgrades the saved version
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] ConditionalExpression
app.js:861:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         false,
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] BlockStatement
app.js:865:22
-       if (tx.isPinned) {
-         li.classList.add("pinned");
-       }
+       if (tx.isPinned) {}
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings

[Survived] LogicalOperator
app.js:861:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id && "tx-" + Math.random().toString(36).substr(2, 9),
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] StringLiteral
app.js:871:11
-           ? `<i class="fas fa-sync-alt recurring-icon" title="Recurring Transaction"></i>`
+           ? ``
Tests ran:
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
  and 2 more tests!

[Survived] ConditionalExpression
app.js:865:9
-       if (tx.isPinned) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] ConditionalExpression
app.js:865:9
-       if (tx.isPinned) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] StringLiteral
app.js:872:11
-           : "";
+           : "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 16 more tests!

[Survived] ConditionalExpression
app.js:875:33
-       const tagsList = tx.tags && tx.tags.length > 0 
+       const tagsList = tx.tags && true 
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 5 more tests!

[Survived] EqualityOperator
app.js:875:33
-       const tagsList = tx.tags && tx.tags.length > 0 
+       const tagsList = tx.tags && tx.tags.length >= 0 
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 5 more tests!

[Survived] StringLiteral
app.js:876:11
-           ? `<div class="tx-tags">${tx.tags.map(tag => `<span class="tx-tag">${tag}</span>`).join('')}</div>` 
+           ? `` 
Tests ran:
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ArrowFunction
app.js:876:47
-           ? `<div class="tx-tags">${tx.tags.map(tag => `<span class="tx-tag">${tag}</span>`).join('')}</div>` 
+           ? `<div class="tx-tags">${tx.tags.map(() => undefined).join('')}</div>` 
Tests ran:
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] EqualityOperator
app.js:875:33
-       const tagsList = tx.tags && tx.tags.length > 0 
+       const tagsList = tx.tags && tx.tags.length <= 0 
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 5 more tests!

[Survived] ConditionalExpression
app.js:875:22
-       const tagsList = tx.tags && tx.tags.length > 0 
+       const tagsList = false 
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] StringLiteral
app.js:876:54
-           ? `<div class="tx-tags">${tx.tags.map(tag => `<span class="tx-tag">${tag}</span>`).join('')}</div>` 
+           ? `<div class="tx-tags">${tx.tags.map(tag => ``).join('')}</div>` 
Tests ran:
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:876:97
-           ? `<div class="tx-tags">${tx.tags.map(tag => `<span class="tx-tag">${tag}</span>`).join('')}</div>` 
+           ? `<div class="tx-tags">${tx.tags.map(tag => `<span class="tx-tag">${tag}</span>`).join("Stryker was here!")}</div>` 
Tests ran:
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:877:11
-           : '';
+           : "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 20 more tests!

[Survived] ConditionalExpression
app.js:881:30
-             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+             <i class="fas fa-${true ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] ConditionalExpression
app.js:881:30
-             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+             <i class="fas fa-${false ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] EqualityOperator
app.js:881:30
-             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+             <i class="fas fa-${tx.type !== "expense" ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] StringLiteral
app.js:881:69
-             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : ""}"
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings
  and 4 more tests!

[Survived] StringLiteral
app.js:881:42
-             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+             <i class="fas fa-${tx.type === "" ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] StringLiteral
app.js:881:54
-             <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+             <i class="fas fa-${tx.type === "expense" ? "" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 18 more tests!

[Survived] StringLiteral
app.js:890:25
-       li.addEventListener("click", function () {
+       li.addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle
  and 21 more tests!

[Survived] ConditionalExpression
app.js:995:7
-     if (filteredTransactions.length === 0) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:995:42
-     if (filteredTransactions.length === 0) {
-       ul.innerHTML =
-         "<li class='no-transactions'>No transactions match your filters</li>";
-     }
+     if (filteredTransactions.length === 0) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:997:7
-         "<li class='no-transactions'>No transactions match your filters</li>";
+         "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1002:39
-   const modal = document.getElementById("tx-modal");
+   const modal = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1004:26
-     modal.classList.remove("hidden");
+     modal.classList.remove("");
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ArrowFunction
app.js:1003:46
-   document.getElementById("add-btn").onclick = () =>
-     modal.classList.remove("hidden");
+   document.getElementById("add-btn").onclick = () => undefined;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:1022:14
-     let tags = [];
+     let tags = ["Stryker was here"];
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] StringLiteral
app.js:1023:45
-     const tagsInput = document.getElementById("tx-tags");
+     const tagsInput = document.getElementById("");
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1024:7
-     if (tagsInput && tagsInput.value) {
+     if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ArrowFunction
app.js:1005:49
-   document.getElementById("cancel-btn").onclick = () =>
-     modal.classList.add("hidden");
+   document.getElementById("cancel-btn").onclick = () => undefined;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1031:16
-     const txId = "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = "" + Math.random().toString(36).substr(2, 9);
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] MethodExpression
app.js:1031:24
-     const txId = "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = "tx-" + Math.random().toString(36);
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ArrayDeclaration
app.js:1044:18
-       attachments: [],
+       attachments: ["Stryker was here"],
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ArrayDeclaration
app.js:1047:56
-     const completeTransaction = (location, attachments = []) => {
+     const completeTransaction = (location, attachments = ["Stryker was here"]) => {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1048:9
-       if (location) {
+       if (true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1048:9
-       if (location) {
+       if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] BlockStatement
app.js:1048:19
-       if (location) {
-         transaction.location = location;
-       }
+       if (location) {}
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1052:9
-       if (attachments && attachments.length > 0) {
+       if (true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1052:9
-       if (attachments && attachments.length > 0) {
+       if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!
