[Survived] LogicalOperator
app.js:1052:9
-       if (attachments && attachments.length > 0) {
+       if (attachments || attachments.length > 0) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1052:24
-       if (attachments && attachments.length > 0) {
+       if (attachments && true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] EqualityOperator
app.js:1052:24
-       if (attachments && attachments.length > 0) {
+       if (attachments && attachments.length >= 0) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] EqualityOperator
app.js:1052:24
-       if (attachments && attachments.length > 0) {
+       if (attachments && attachments.length <= 0) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1057:27
-       data.balances[acc] += type === "expense" ? -amt : amt;
+       data.balances[acc] += true ? -amt : amt;
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1060:9
-       if (isPinned) {
+       if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1060:9
-       if (isPinned) {
+       if (true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1065:9
-       if (isRecurring) {
+       if (true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1065:9
-       if (isRecurring) {
+       if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] StringLiteral
app.js:1079:25
-       modal.classList.add("hidden");
+       modal.classList.add("");
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] StringLiteral
app.js:1083:29
-       document.getElementById("tx-attachments-preview").innerHTML = "";
+       document.getElementById("").innerHTML = "";
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] StringLiteral
app.js:1083:67
-       document.getElementById("tx-attachments-preview").innerHTML = "";
+       document.getElementById("tx-attachments-preview").innerHTML = "Stryker was here!";
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1087:7
-     if (fileInput.files.length > 0) {
+     if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1112:9
-       if (navigator.geolocation) {
+       if (true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1112:9
-       if (navigator.geolocation) {
+       if (false) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] ConditionalExpression
app.js:1133:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ObjectLiteral
app.js:1115:31
-             completeTransaction({
-               latitude: position.coords.latitude,
-               longitude: position.coords.longitude,
-             });
+             completeTransaction({});
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 5 more tests!

[Survived] LogicalOperator
app.js:1133:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 && index >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1133:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (false || index >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1133:20
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 || false) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] EqualityOperator
app.js:1133:20
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 || index > data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1137:32
-     data.balances[tx.account] -= tx.type === "expense" ? -tx.amount : tx.amount;
+     data.balances[tx.account] -= true ? -tx.amount : tx.amount;
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1140:7
-     if (tx.isPinned) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ArrowFunction
app.js:1143:7
-         (id) => id !== txId,
+         () => undefined,
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1143:15
-         (id) => id !== txId,
+         (id) => false,
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1159:7
-     if (currentMap) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests deletes a transaction and reverses its balance effect

[Survived] ConditionalExpression
app.js:1167:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] LogicalOperator
app.js:1167:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 && index >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1167:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (false || index >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1167:20
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 || false) return;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] EqualityOperator
app.js:1167:20
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 || index > data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1177:55
-     document.getElementById("edit-tx-category").value = tx.category || "Other";
+     document.getElementById("edit-tx-category").value = true;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1177:55
-     document.getElementById("edit-tx-category").value = tx.category || "Other";
+     document.getElementById("edit-tx-category").value = false;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] LogicalOperator
app.js:1177:55
-     document.getElementById("edit-tx-category").value = tx.category || "Other";
+     document.getElementById("edit-tx-category").value = tx.category && "Other";
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1179:5
-       tx.isRecurring || false;
+       true;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1179:5
-       tx.isRecurring || false;
+       false;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] LogicalOperator
app.js:1179:5
-       tx.isRecurring || false;
+       tx.isRecurring && false;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] BooleanLiteral
app.js:1179:23
-       tx.isRecurring || false;
+       tx.isRecurring || true;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1180:55
-     document.getElementById("edit-tx-pinned").checked = tx.isPinned || false;
+     document.getElementById("edit-tx-pinned").checked = true;
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] BooleanLiteral
app.js:1180:70
-     document.getElementById("edit-tx-pinned").checked = tx.isPinned || false;
+     document.getElementById("edit-tx-pinned").checked = tx.isPinned || true;
Tests ran:
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] StringLiteral
app.js:1187:35
-     attachmentContainer.innerHTML = "";
+     attachmentContainer.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1188:7
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1188:7
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] LogicalOperator
app.js:1188:7
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments || tx.attachments.length > 0) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1188:25
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments && true) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] EqualityOperator
app.js:1188:25
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments && tx.attachments.length >= 0) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] EqualityOperator
app.js:1188:25
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments && tx.attachments.length <= 0) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1216:7
-     if (currentMap) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests populates the edit-transaction form from an existing transaction
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:1224:7
-     if (currentTxIndex < 0 || currentTxIndex >= data.transactions.length) return;
+     if (false || currentTxIndex >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests returns early from saveEditedTransaction when the current index is invalid
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
  and 1 more test!

[Survived] EqualityOperator
app.js:1224:29
-     if (currentTxIndex < 0 || currentTxIndex >= data.transactions.length) return;
+     if (currentTxIndex < 0 || currentTxIndex > data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests returns early from saveEditedTransaction when the current index is invalid
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
  and 1 more test!

[Survived] ArrayDeclaration
app.js:1240:31
-     const existingAttachments = [...(oldTx.attachments || [])];
+     const existingAttachments = [];
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] LogicalOperator
app.js:1240:36
-     const existingAttachments = [...(oldTx.attachments || [])];
+     const existingAttachments = [...(oldTx.attachments && [])];
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ArrowFunction
app.js:1243:9
-     ).map((el) => parseInt(el.dataset.index));
+     ).map(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] MethodExpression
app.js:1246:32
-     const remainingAttachments = existingAttachments.filter(
-       (_, i) => !removedIndices.includes(i),
-     );
+     const remainingAttachments = existingAttachments;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ArrowFunction
app.js:1247:5
-       (_, i) => !removedIndices.includes(i),
+       () => undefined,
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ArrayDeclaration
app.js:1252:26
-     const newAttachments = [];
+     const newAttachments = ["Stryker was here"];
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ConditionalExpression
app.js:1253:7
-     if (fileInput.files.length > 0) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ConditionalExpression
app.js:1322:5
-       oldTx.type === "expense" ? -oldTx.amount : oldTx.amount;
+       true ? -oldTx.amount : oldTx.amount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ConditionalExpression
app.js:1325:32
-     data.balances[newAccount] += newType === "expense" ? -newAmount : newAmount;
+     data.balances[newAccount] += false ? -newAmount : newAmount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] UnaryOperator
app.js:1325:56
-     data.balances[newAccount] += newType === "expense" ? -newAmount : newAmount;
+     data.balances[newAccount] += newType === "expense" ? +newAmount : newAmount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] StringLiteral
app.js:1325:44
-     data.balances[newAccount] += newType === "expense" ? -newAmount : newAmount;
+     data.balances[newAccount] += newType === "" ? -newAmount : newAmount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] LogicalOperator
app.js:1348:7
-     if (isPinned && !oldTx.isPinned) {
+     if (isPinned || !oldTx.isPinned) {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ConditionalExpression
app.js:1350:9
-       if (!data.settings.pinnedTransactions.includes(txId)) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings

[Survived] ConditionalExpression
app.js:1353:14
-     } else if (!isPinned && oldTx.isPinned) {
+     } else if (true) {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] LogicalOperator
app.js:1353:14
-     } else if (!isPinned && oldTx.isPinned) {
+     } else if (!isPinned || oldTx.isPinned) {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ArrowFunction
app.js:1356:7
-         (id) => id !== txId,
+         () => undefined,
Tests ran:
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned

[Survived] ConditionalExpression
app.js:1356:15
-         (id) => id !== txId,
+         (id) => false,
Tests ran:
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
