[Survived] ArrayDeclaration
app.js:1387:15
-       accounts: [
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
-       ],
+       accounts: [],
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1388:7
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         {},
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1388:13
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "", name: "Credit Union", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1388:25
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "", icon: "university", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1388:47
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "", color: "#4a90e2" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1388:68
-         { id: "cu", name: "Credit Union", icon: "university", color: "#4a90e2" },
+         { id: "cu", name: "Credit Union", icon: "university", color: "" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1389:7
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         {},
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1389:13
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "", name: "Revolut", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1389:30
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "", icon: "credit-card", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1389:47
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "", color: "#50c878" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1389:69
-         { id: "revolut", name: "Revolut", icon: "credit-card", color: "#50c878" },
+         { id: "revolut", name: "Revolut", icon: "credit-card", color: "" },
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1390:7
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         {}
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1390:27
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1390:13
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1390:41
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "", color: "#ff9800" }
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1390:67
-         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "#ff9800" }
+         { id: "cash", name: "Cash", icon: "money-bill-wave", color: "" }
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ArrayDeclaration
app.js:1392:17
-       categories: [
-         "Food & Dining",
-         "Shopping",
-         "Transportation",
-         "Bills & Utilities",
-         "Entertainment",
-         "Health & Fitness",
-         "Travel",
-         "Education",
-         "Personal Care",
-         "Gifts",
-         "Other",
-       ],
+       categories: [],
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1393:7
-         "Food & Dining",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1394:7
-         "Shopping",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1395:7
-         "Transportation",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1396:7
-         "Bills & Utilities",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1397:7
-         "Entertainment",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1398:7
-         "Health & Fitness",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1399:7
-         "Travel",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1400:7
-         "Education",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1401:7
-         "Personal Care",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1402:7
-         "Gifts",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1403:7
-         "Other",
+         "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ArrayDeclaration
app.js:1405:11
-       tags: [],
+       tags: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ArrayDeclaration
app.js:1406:12
-       bills: [],
+       bills: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1408:15
-       settings: {
-         theme: "light",
-         accentColor: "#4a90e2",
-         pinnedTransactions: [],
-         recurringTransactions: [],
-         version: APP_VERSION,
-         dashboard: {
-           widgets: {
-             totalBalance: true,
-             accounts: true,
-             recentTransactions: true,
-             upcomingBills: false,
-             spendingChart: false
-           },
-           defaultView: "transactions"
-         },
-         backup: {
-           googleDrive: {
-             connected: false,
-             lastBackup: null
-           }
-         },
-         recurring: {
-           autoCreate: false,
-           notifications: false
-         }
-       },
+       settings: {},

[Survived] StringLiteral
app.js:1409:14
-         theme: "light",
+         theme: "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1410:20
-         accentColor: "#4a90e2",
+         accentColor: "",
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ArrayDeclaration
app.js:1412:30
-         recurringTransactions: [],
+         recurringTransactions: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ArrayDeclaration
app.js:1411:27
-         pinnedTransactions: [],
+         pinnedTransactions: ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1414:18
-         dashboard: {
-           widgets: {
-             totalBalance: true,
-             accounts: true,
-             recentTransactions: true,
-             upcomingBills: false,
-             spendingChart: false
-           },
-           defaultView: "transactions"
-         },
+         dashboard: {},
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1415:18
-           widgets: {
-             totalBalance: true,
-             accounts: true,
-             recentTransactions: true,
-             upcomingBills: false,
-             spendingChart: false
-           },
+           widgets: {},
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1416:25
-             totalBalance: true,
+             totalBalance: false,
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1417:21
-             accounts: true,
+             accounts: false,
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1418:31
-             recentTransactions: true,
+             recentTransactions: false,
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1420:26
-             spendingChart: false
+             spendingChart: true
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1419:26
-             upcomingBills: false,
+             upcomingBills: true,
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1422:22
-           defaultView: "transactions"
+           defaultView: ""
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1425:22
-           googleDrive: {
-             connected: false,
-             lastBackup: null
-           }
+           googleDrive: {}
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1424:15
-         backup: {
-           googleDrive: {
-             connected: false,
-             lastBackup: null
-           }
-         },
+         backup: {},
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1426:22
-             connected: false,
+             connected: true,
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] ObjectLiteral
app.js:1430:18
-         recurring: {
-           autoCreate: false,
-           notifications: false
-         }
+         recurring: {}
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1431:21
-           autoCreate: false,
+           autoCreate: true,
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BooleanLiteral
app.js:1432:24
-           notifications: false
+           notifications: true
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] StringLiteral
app.js:1444:26
-     showUpdateNotification("All data has been reset successfully");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests resets balances and transactions to defaults after confirmation

[Survived] BlockStatement
app.js:1448:37
-   function initBalanceOverTimeChart() {
-     // Set up event listeners for chart controls
-     document
-       .getElementById("balance-timespan")
-       .addEventListener("change", updateBalanceOverTimeChart);
-     document
-       .getElementById("balance-account")
-       .addEventListener("change", updateBalanceOverTimeChart);
-     // Initial chart update
-     updateBalanceOverTimeChart();
-   }
+   function initBalanceOverTimeChart() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1452:23
-       .addEventListener("change", updateBalanceOverTimeChart);
+       .addEventListener("", updateBalanceOverTimeChart);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1455:23
-       .addEventListener("change", updateBalanceOverTimeChart);
+       .addEventListener("", updateBalanceOverTimeChart);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1472:18
-     let interval = "day";
+     let interval = "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1480:5
-       case "month":
-         startDate = new Date(now);
-         startDate.setMonth(now.getMonth() - 1);
-         interval = "day";
-         break;
+       case "month":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1475:10
-       case "week":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1480:10
-       case "month":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArithmeticOperator
app.js:1482:26
-         startDate.setMonth(now.getMonth() - 1);
+         startDate.setMonth(now.getMonth() + 1);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1505:10
-     while (current <= endDate) {
+     while (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1505:10
-     while (current <= endDate) {
+     while (current < endDate) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1505:10
-     while (current <= endDate) {
+     while (current > endDate) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1509:7
-         case "day":
-           current.setDate(current.getDate() + 1);
-           break;
+         case "day":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:1522:20
-     const balances = [];
+     const balances = ["Stryker was here"];
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] MethodExpression
app.js:1527:24
-       const txUpToDate = data.transactions.filter(
-         (tx) => new Date(tx.date) <= date,
-       );
+       const txUpToDate = data.transactions;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrowFunction
app.js:1528:7
-         (tx) => new Date(tx.date) <= date,
+         () => undefined,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1532:9
-       if (account === "all") {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1532:9
-       if (account === "all") {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1532:9
-       if (account === "all") {
+       if (account !== "all") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1532:21
-       if (account === "all") {
+       if (account === "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1532:28
-       if (account === "all") {
-         // Calculate total balance across all accounts
-         const totalBalance = Object.values(data.balances).reduce(
-           (sum, bal) => sum + bal,
-           0,
-         );
-         // Adjust for transactions not included in the current date
-         const futureTransactions = data.transactions.filter(
-           (tx) => new Date(tx.date) > date,
-         );
-         // Calculate the effect of future transactions on the balance
-         const adjustment = futureTransactions.reduce((sum, tx) => {
-           return sum + (tx.type === "expense" ? tx.amount : -tx.amount);
-         }, 0);
-         // Add adjusted balance to array
-         balances.push(totalBalance - adjustment);
-       } else {
+       if (account === "all") {} else {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrowFunction
app.js:1535:9
-           (sum, bal) => sum + bal,
+           () => undefined,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArithmeticOperator
app.js:1535:23
-           (sum, bal) => sum + bal,
+           (sum, bal) => sum - bal,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] MethodExpression
app.js:1540:34
-         const futureTransactions = data.transactions.filter(
-           (tx) => new Date(tx.date) > date,
-         );
+         const futureTransactions = data.transactions;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrowFunction
app.js:1541:9
-           (tx) => new Date(tx.date) > date,
+           () => undefined,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArithmeticOperator
app.js:1550:21
-         balances.push(totalBalance - adjustment);
+         balances.push(totalBalance + adjustment);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1571:32
-     const formatDate = (date) => {
-       switch (interval) {
-         case "day":
-           return date.toLocaleDateString("en-GB", {
-             day: "numeric",
-             month: "short",
-           });
-         case "week":
-           return date.toLocaleDateString("en-GB", {
-             day: "numeric",
-             month: "short",
-           });
-         case "month":
-           return date.toLocaleDateString("en-GB", {
-             month: "short",
-             year: "numeric",
-           });
-       }
-     };
+     const formatDate = (date) => {};
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1573:7
-         case "day":
-           return date.toLocaleDateString("en-GB", {
-             day: "numeric",
-             month: "short",
-           });
+         case "day":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1573:12
-         case "day":
+         case "":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1574:49
-           return date.toLocaleDateString("en-GB", {
-             day: "numeric",
-             month: "short",
-           });
+           return date.toLocaleDateString("en-GB", {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1597:17
-       .getContext("2d");
+       .getContext("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1600:7
-     if (window.balanceOverTimeChart) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!
