[Survived] BlockStatement
app.js:1600:36
-     if (window.balanceOverTimeChart) {
-       window.balanceOverTimeChart.destroy();
-     }
+     if (window.balanceOverTimeChart) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1605:20
-     let chartTitle = "Balance Over Time";
+     let chartTitle = "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1606:7
-     if (account !== "all") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1606:7
-     if (account !== "all") {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1606:7
-     if (account !== "all") {
+     if (account === "all") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1606:19
-     if (account !== "all") {
+     if (account !== "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1612:5
-       account === "all"
+       true
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1612:5
-       account === "all"
+       false
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1612:5
-       account === "all"
+       account !== "all"
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1612:17
-       account === "all"
+       account === ""
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1613:9
-         ? "#4a90e2"
+         ? ""
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1622:11
-       type: "line",
+       type: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1623:11
-       data: {
-         labels: labels,
-         datasets: [
-           {
-             label: "Balance",
-             data: balances,
-             backgroundColor: `${chartColor}33`,
-             borderColor: chartColor,
-             borderWidth: 2,
-             fill: true,
-             tension: 0.2,
-             pointRadius: 3,
-             pointHoverRadius: 5,
-           },
-         ],
-       },
+       data: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:1625:17
-         datasets: [
-           {
-             label: "Balance",
-             data: balances,
-             backgroundColor: `${chartColor}33`,
-             borderColor: chartColor,
-             borderWidth: 2,
-             fill: true,
-             tension: 0.2,
-             pointRadius: 3,
-             pointHoverRadius: 5,
-           },
-         ],
+         datasets: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1626:9
-           {
-             label: "Balance",
-             data: balances,
-             backgroundColor: `${chartColor}33`,
-             borderColor: chartColor,
-             borderWidth: 2,
-             fill: true,
-             tension: 0.2,
-             pointRadius: 3,
-             pointHoverRadius: 5,
-           },
+           {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1627:18
-             label: "Balance",
+             label: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1629:28
-             backgroundColor: `${chartColor}33`,
+             backgroundColor: ``,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:1632:17
-             fill: true,
+             fill: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1639:14
-       options: {
-         responsive: true,
-         plugins: {
-           title: {
-             display: true,
-             text: chartTitle,
-           },
-           tooltip: {
-             callbacks: {
-               label: function (context) {
-                 return `Balance: ${formatAmt(context.raw)}`;
-               },
-             },
-           },
-         },
-         scales: {
-           y: {
-             beginAtZero: false,
-             ticks: {
-               callback: function (value) {
-                 return formatAmt(value);
-               },
-             },
-           },
-         },
-       },
+       options: {},
Tests ran:

[Survived] BooleanLiteral
app.js:1640:19
-         responsive: true,
+         responsive: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1641:16
-         plugins: {
-           title: {
-             display: true,
-             text: chartTitle,
-           },
-           tooltip: {
-             callbacks: {
-               label: function (context) {
-                 return `Balance: ${formatAmt(context.raw)}`;
-               },
-             },
-           },
-         },
+         plugins: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1642:16
-           title: {
-             display: true,
-             text: chartTitle,
-           },
+           title: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:1643:20
-             display: true,
+             display: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1646:18
-           tooltip: {
-             callbacks: {
-               label: function (context) {
-                 return `Balance: ${formatAmt(context.raw)}`;
-               },
-             },
-           },
+           tooltip: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1647:22
-             callbacks: {
-               label: function (context) {
-                 return `Balance: ${formatAmt(context.raw)}`;
-               },
-             },
+             callbacks: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1654:15
-         scales: {
-           y: {
-             beginAtZero: false,
-             ticks: {
-               callback: function (value) {
-                 return formatAmt(value);
-               },
-             },
-           },
-         },
+         scales: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:1655:12
-           y: {
-             beginAtZero: false,
-             ticks: {
-               callback: function (value) {
-                 return formatAmt(value);
-               },
-             },
-           },
+           y: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1675:30
-       notification.className = "update-notification";
+       notification.className = "";
Tests ran:
    white-box DOM and state integration-style tests shows the update notification and stores the version when the app version changed

[Survived] BooleanLiteral
app.js:1656:24
-             beginAtZero: false,
+             beginAtZero: true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1689:10
-     } else {
-       // Show "up to date" notification
-       const notification = document.createElement("div");
-       notification.className = "update-notification";
-       notification.innerHTML = `
-         <div class="update-content">
-           <i class="fas fa-check-circle"></i>
-           <span>App is up to date (v${APP_VERSION})</span>
-         </div>
-       `;
-       document.body.appendChild(notification);
-       // Remove notification after a few seconds
-       setTimeout(() => {
-         notification.classList.add("fade-out");
-         setTimeout(() => {
-           if (notification.parentNode) {
-             notification.parentNode.removeChild(notification);
-           }
-         }, 500);
-       }, 2000);
-     }
+     } else {}
Tests ran:
    white-box DOM and state integration-style tests shows the up-to-date notification and removes it after the fade-out timers

[Survived] StringLiteral
app.js:1692:30
-       notification.className = "update-notification";
+       notification.className = "";
Tests ran:
    white-box DOM and state integration-style tests shows the up-to-date notification and removes it after the fade-out timers

[Survived] StringLiteral
app.js:1693:30
-       notification.innerHTML = `
-         <div class="update-content">
-           <i class="fas fa-check-circle"></i>
-           <span>App is up to date (v${APP_VERSION})</span>
-         </div>
-       `;
+       notification.innerHTML = ``;
Tests ran:
    white-box DOM and state integration-style tests shows the up-to-date notification and removes it after the fade-out timers

[Survived] ConditionalExpression
app.js:1705:13
-           if (notification.parentNode) {
+           if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows the up-to-date notification and removes it after the fade-out timers

[Survived] ObjectLiteral
app.js:1657:18
-             ticks: {
-               callback: function (value) {
-                 return formatAmt(value);
-               },
-             },
+             ticks: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1729:13
-           if (processed === files.length) {
+           if (true) {
Tests ran:
    white-box DOM and state integration-style tests skips non-image attachments and resolves when all files are processed

[Survived] ConditionalExpression
app.js:1746:13
-           if (processed === files.length) {
+           if (true) {
Tests ran:
    white-box DOM and state integration-style tests collects image attachments from successful file reads
    white-box DOM and state integration-style tests resolves remaining image attachments when a file reader errors

[Survived] ConditionalExpression
app.js:1753:13
-           if (processed === files.length) {
+           if (true) {
Tests ran:
    white-box DOM and state integration-style tests resolves remaining image attachments when a file reader errors

[Survived] ConditionalExpression
app.js:1753:13
-           if (processed === files.length) {
+           if (false) {
Tests ran:
    white-box DOM and state integration-style tests resolves remaining image attachments when a file reader errors

[Survived] EqualityOperator
app.js:1753:13
-           if (processed === files.length) {
+           if (processed !== files.length) {
Tests ran:
    white-box DOM and state integration-style tests resolves remaining image attachments when a file reader errors

[Survived] StringLiteral
app.js:1767:48
-       if (window.matchMedia && window.matchMedia('(prefers-color-scheme: dark)').matches) {
+       if (window.matchMedia && window.matchMedia("").matches) {
Tests ran:
    white-box DOM and state integration-style tests applies the system theme and reacts to preference changes while system mode is active
    white-box DOM and state integration-style tests keeps the current theme when the system listener fires after leaving system mode

[Survived] BlockStatement
app.js:1769:12
-       } else {
-         document.documentElement.setAttribute("data-theme", "light");
-       }
+       } else {}
Tests ran:
    white-box DOM and state integration-style tests keeps the current theme when the system listener fires after leaving system mode

[Survived] StringLiteral
app.js:1774:23
-       window.matchMedia('(prefers-color-scheme: dark)').addEventListener('change', e => {
+       window.matchMedia("").addEventListener('change', e => {
Tests ran:
    white-box DOM and state integration-style tests applies the system theme and reacts to preference changes while system mode is active
    white-box DOM and state integration-style tests keeps the current theme when the system listener fires after leaving system mode

[Survived] BlockStatement
app.js:1809:29
-   function applyAppSettings() {
-     // Apply theme
-     applyTheme(data.settings.theme || "light");
-     
-     // Apply accent color
-     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || '#4a90e2');
-     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || '#4a90e2', -20));
-     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || '#4a90e2', 40, true));
-     
-     // Apply dashboard widgets
-     applyDashboardWidgets();
-     
-     // Update app version display
-     const versionElement = document.getElementById("app-version");
-     if (versionElement) {
-       versionElement.textContent = APP_VERSION;
-     }
-     
-     // Calculate storage usage
-     calculateStorageUsage();
-   }
+   function applyAppSettings() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:1811:14
-     applyTheme(data.settings.theme || "light");
+     applyTheme(data.settings.theme && "light");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1814:46
-     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || '#4a90e2');
+     document.documentElement.style.setProperty("", data.settings.accentColor || '#4a90e2');
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1814:65
-     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || '#4a90e2');
+     document.documentElement.style.setProperty('--primary-color', true);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1814:65
-     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || '#4a90e2');
+     document.documentElement.style.setProperty('--primary-color', false);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:1814:65
-     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor || '#4a90e2');
+     document.documentElement.style.setProperty('--primary-color', data.settings.accentColor && '#4a90e2');
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1815:46
-     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || '#4a90e2', -20));
+     document.documentElement.style.setProperty("", adjustColor(data.settings.accentColor || '#4a90e2', -20));
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:1815:76
-     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || '#4a90e2', -20));
+     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor && '#4a90e2', -20));
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] UnaryOperator
app.js:1815:116
-     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || '#4a90e2', -20));
+     document.documentElement.style.setProperty('--primary-dark', adjustColor(data.settings.accentColor || '#4a90e2', +20));
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1816:46
-     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || '#4a90e2', 40, true));
+     document.documentElement.style.setProperty("", adjustColor(data.settings.accentColor || '#4a90e2', 40, true));
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:1816:77
-     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || '#4a90e2', 40, true));
+     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor && '#4a90e2', 40, true));
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:1816:121
-     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || '#4a90e2', 40, true));
+     document.documentElement.style.setProperty('--primary-light', adjustColor(data.settings.accentColor || '#4a90e2', 40, false));
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1822:50
-     const versionElement = document.getElementById("app-version");
+     const versionElement = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1823:7
-     if (versionElement) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1823:7
-     if (versionElement) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1823:23
-     if (versionElement) {
-       versionElement.textContent = APP_VERSION;
-     }
+     if (versionElement) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!
