[Survived] BlockStatement
app.js:1854:34
-   function applyDashboardWidgets() {
-     // Widget settings are guaranteed to exist thanks to loadData initialization
-     const widgets = data.settings.dashboard.widgets;
-     
-     // Total balance widget
-     const totalBalanceWidget = document.querySelector(".total-balance.card");
-     if (totalBalanceWidget) {
-       totalBalanceWidget.style.display = widgets.totalBalance ? "block" : "none";
-     }
-     
-     // Accounts widget
-     const accountsSection = document.querySelector(".balances");
-     if (accountsSection) {
-       accountsSection.style.display = widgets.accounts ? "flex" : "none";
-     }
-     
-     // Recent transactions widget (main transaction list)
-     // This is always shown on the transactions view
-     
-     // Set default view on page load
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
-       // Only switch if we're on the initial transactions view
-       switchView(data.settings.dashboard.defaultView);
-     }
-   }
+   function applyDashboardWidgets() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively

[Survived] ConditionalExpression
app.js:1860:7
-     if (totalBalanceWidget) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1860:7
-     if (totalBalanceWidget) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1860:27
-     if (totalBalanceWidget) {
-       totalBalanceWidget.style.display = widgets.totalBalance ? "block" : "none";
-     }
+     if (totalBalanceWidget) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1861:63
-       totalBalanceWidget.style.display = widgets.totalBalance ? "block" : "none";
+       totalBalanceWidget.style.display = widgets.totalBalance ? "" : "none";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1866:7
-     if (accountsSection) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1866:7
-     if (accountsSection) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1866:24
-     if (accountsSection) {
-       accountsSection.style.display = widgets.accounts ? "flex" : "none";
-     }
+     if (accountsSection) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1867:56
-       accountsSection.style.display = widgets.accounts ? "flex" : "none";
+       accountsSection.style.display = widgets.accounts ? "" : "none";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1874:7
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1874:7
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:1874:7
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
+     if (data.settings.dashboard.defaultView || currentView === "transactions") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1874:46
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
+     if (data.settings.dashboard.defaultView && true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1874:46
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
+     if (data.settings.dashboard.defaultView && currentView !== "transactions") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1874:62
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
+     if (data.settings.dashboard.defaultView && currentView === "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1874:78
-     if (data.settings.dashboard.defaultView && currentView === "transactions") {
-       // Only switch if we're on the initial transactions view
-       switchView(data.settings.dashboard.defaultView);
-     }
+     if (data.settings.dashboard.defaultView && currentView === "transactions") {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1913:59
-     document.getElementById("add-tag-btn").addEventListener("click", addNewTag);
+     document.getElementById("add-tag-btn").addEventListener("", addNewTag);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1916:69
-     document.getElementById("auto-create-recurring").addEventListener("change", function() {
+     document.getElementById("auto-create-recurring").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1921:64
-     document.getElementById("notify-recurring").addEventListener("change", function() {
+     document.getElementById("notify-recurring").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1927:68
-     document.getElementById("manage-recurring-btn").addEventListener("click", function() {
+     document.getElementById("manage-recurring-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1932:69
-     document.getElementById("manage-categories-btn").addEventListener("click", function() {
+     document.getElementById("manage-categories-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1938:31
-   function updateThemeButtons() {
-     const themeButtons = document.querySelectorAll('.theme-option');
-     themeButtons.forEach(button => {
-       button.classList.remove('active');
-       if (button.getAttribute('data-theme') === data.settings.theme) {
-         button.classList.add('active');
-       }
-       
-       // Add click handler
-       button.addEventListener('click', function() {
-         const theme = this.getAttribute('data-theme');
-         applyTheme(theme);
-         updateThemeButtons();
-         saveData();
-       });
-     });
-   }
+   function updateThemeButtons() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1940:34
-     themeButtons.forEach(button => {
-       button.classList.remove('active');
-       if (button.getAttribute('data-theme') === data.settings.theme) {
-         button.classList.add('active');
-       }
-       
-       // Add click handler
-       button.addEventListener('click', function() {
-         const theme = this.getAttribute('data-theme');
-         applyTheme(theme);
-         updateThemeButtons();
-         saveData();
-       });
-     });
+     themeButtons.forEach(button => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1942:9
-       if (button.getAttribute('data-theme') === data.settings.theme) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1942:9
-       if (button.getAttribute('data-theme') === data.settings.theme) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1942:9
-       if (button.getAttribute('data-theme') === data.settings.theme) {
+       if (button.getAttribute('data-theme') !== data.settings.theme) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1942:29
-       if (button.getAttribute('data-theme') === data.settings.theme) {
+       if (button.getAttribute("") === data.settings.theme) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1942:68
-       if (button.getAttribute('data-theme') === data.settings.theme) {
-         button.classList.add('active');
-       }
+       if (button.getAttribute('data-theme') === data.settings.theme) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1947:29
-       button.addEventListener('click', function() {
+       button.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1959:34
-     colorButtons.forEach(button => {
-       button.classList.remove('active');
-       if (button.getAttribute('data-color') === data.settings.accentColor) {
-         button.classList.add('active');
-       }
-       
-       // Add click handler
-       button.addEventListener('click', function() {
-         const color = this.getAttribute('data-color');
-         data.settings.accentColor = color;
-         
-         // Update active state
-         document.querySelectorAll('.color-selector .color-option').forEach(btn => {
-           btn.classList.remove('active');
-         });
-         this.classList.add('active');
-         
-         // Apply the color
-         document.documentElement.style.setProperty('--primary-color', color);
-         document.documentElement.style.setProperty('--primary-dark', adjustColor(color, -20));
-         document.documentElement.style.setProperty('--primary-light', adjustColor(color, 40, true));
-         
-         saveData();
-         showUpdateNotification("Accent color updated");
-       });
-     });
+     colorButtons.forEach(button => {});
Tests ran:

[Survived] ConditionalExpression
app.js:1961:9
-       if (button.getAttribute('data-color') === data.settings.accentColor) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:1961:9
-       if (button.getAttribute('data-color') === data.settings.accentColor) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:1961:9
-       if (button.getAttribute('data-color') === data.settings.accentColor) {
+       if (button.getAttribute('data-color') !== data.settings.accentColor) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1961:29
-       if (button.getAttribute('data-color') === data.settings.accentColor) {
+       if (button.getAttribute("") === data.settings.accentColor) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:1961:74
-       if (button.getAttribute('data-color') === data.settings.accentColor) {
-         button.classList.add('active');
-       }
+       if (button.getAttribute('data-color') === data.settings.accentColor) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1966:29
-       button.addEventListener('click', function() {
+       button.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:1999:68
-     document.getElementById('widget-total-balance').addEventListener('change', function() {
+     document.getElementById('widget-total-balance').addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2005:63
-     document.getElementById('widget-accounts').addEventListener('change', function() {
+     document.getElementById('widget-accounts').addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2011:74
-     document.getElementById('widget-recent-transactions').addEventListener('change', function() {
+     document.getElementById('widget-recent-transactions').addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2017:69
-     document.getElementById('widget-upcoming-bills').addEventListener('change', function() {
+     document.getElementById('widget-upcoming-bills').addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2023:69
-     document.getElementById('widget-spending-chart').addEventListener('change', function() {
+     document.getElementById('widget-spending-chart').addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:2031:36
-   function initDefaultViewSelector() {
-     // Dashboard settings are guaranteed to exist thanks to loadData initialization
-     
-     const defaultViewSelect = document.getElementById('default-view');
-     defaultViewSelect.value = data.settings.dashboard.defaultView;
-     
-     defaultViewSelect.addEventListener('change', function() {
-       data.settings.dashboard.defaultView = this.value;
-       saveData();
-     });
-   }
+   function initDefaultViewSelector() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2037:38
-     defaultViewSelect.addEventListener('change', function() {
+     defaultViewSelect.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:2046:7
-     if (!storageUsage) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:2049:31
-       const dataSize = new Blob([JSON.stringify(data)]).size;
+       const dataSize = new Blob([]).size;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:2071:7
-     if (!tagsListEl) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2073:26
-     tagsListEl.innerHTML = '';
+     tagsListEl.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2082:28
-       tagElement.className = "tag-item";
+       tagElement.className = "";
Tests ran:
    white-box DOM and state integration-style tests renders saved tags into the tags list
    white-box DOM and state integration-style tests initializes missing tags state and adds a new tag
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions

[Survived] BlockStatement
app.js:2092:59
-     document.querySelectorAll(".remove-tag").forEach(btn => {
-       btn.addEventListener("click", function() {
-         const tag = this.getAttribute("data-tag");
-         removeTag(tag);
-       });
-     });
+     document.querySelectorAll(".remove-tag").forEach(btn => {});
Tests ran:
    white-box DOM and state integration-style tests renders saved tags into the tags list
    white-box DOM and state integration-style tests initializes missing tags state and adds a new tag
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions

[Survived] StringLiteral
app.js:2093:26
-       btn.addEventListener("click", function() {
+       btn.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests renders saved tags into the tags list
    white-box DOM and state integration-style tests initializes missing tags state and adds a new tag
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions

[Survived] LogicalOperator
app.js:2114:7
-     if (!data.tags || !Array.isArray(data.tags)) {
+     if (!data.tags && !Array.isArray(data.tags)) {
Tests ran:
    white-box DOM and state integration-style tests initializes missing tags state and adds a new tag
    white-box DOM and state integration-style tests rejects duplicate tags

[Survived] ArrayDeclaration
app.js:2115:17
-       data.tags = [];
+       data.tags = ["Stryker was here"];
Tests ran:
    white-box DOM and state integration-style tests initializes missing tags state and adds a new tag

[Survived] StringLiteral
app.js:2121:22
-       tagInput.value = "";
+       tagInput.value = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests rejects duplicate tags

[Survived] StringLiteral
app.js:2132:26
-     showUpdateNotification("Tag added successfully");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests initializes missing tags state and adds a new tag

[Survived] ConditionalExpression
app.js:2142:9
-       if (tx.tags && tx.tags.includes(tag)) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions

[Survived] LogicalOperator
app.js:2142:9
-       if (tx.tags && tx.tags.includes(tag)) {
+       if (tx.tags || tx.tags.includes(tag)) {
Tests ran:
    white-box DOM and state integration-style tests removes a tag from the tag list and tagged transactions

[Survived] ConditionalExpression
app.js:2168:9
-       if (data.settings.backup.googleDrive.lastBackup) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows the connected Google Drive state with a never-backed-up message

[Survived] BlockStatement
app.js:2171:12
-       } else {
-         lastBackupInfo.textContent = "Last backup: Never";
-       }
+       } else {}
Tests ran:
    white-box DOM and state integration-style tests shows the connected Google Drive state with a never-backed-up message
