[Survived] BlockStatement
app.js:2174:10
-     } else {
-       authDiv.classList.remove("hidden");
-       connectedDiv.classList.add("hidden");
-     }
+     } else {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2180:28
-     authBtn.addEventListener("click", connectGoogleDrive);
+     authBtn.addEventListener("", connectGoogleDrive);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2181:62
-     document.getElementById("backup-now-btn").addEventListener("click", backupToGoogleDrive);
+     document.getElementById("backup-now-btn").addEventListener("", backupToGoogleDrive);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2191:26
-     showUpdateNotification("Connecting to Google Drive...");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests connects Google Drive after the simulated delay

[Survived] StringLiteral
app.js:2182:66
-     document.getElementById("restore-backup-btn").addEventListener("click", restoreFromGoogleDrive);
+     document.getElementById("restore-backup-btn").addEventListener("", restoreFromGoogleDrive);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2202:28
-       showUpdateNotification("Connected to Google Drive successfully");
+       showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests connects Google Drive after the simulated delay

[Survived] StringLiteral
app.js:2209:26
-     showUpdateNotification("Backing up data to Google Drive...");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests backs up to Google Drive and updates the last-backup text

[Survived] StringLiteral
app.js:2219:29
-       document.getElementById("last-backup-info").textContent = 
+       document.getElementById("").textContent = 
Tests ran:
    white-box DOM and state integration-style tests backs up to Google Drive and updates the last-backup text

[Survived] StringLiteral
app.js:2222:28
-       showUpdateNotification("Backup completed successfully");
+       showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests backs up to Google Drive and updates the last-backup text

[Survived] BlockStatement
app.js:2228:113
-     if (!confirm("Are you sure you want to restore data from Google Drive? This will replace all current data.")) {
-       return;
-     }
+     if (!confirm("Are you sure you want to restore data from Google Drive? This will replace all current data.")) {}
Tests ran:
    white-box DOM and state integration-style tests returns early from restoreFromGoogleDrive when confirmation is canceled

[Survived] ConditionalExpression
app.js:2228:7
-     if (!confirm("Are you sure you want to restore data from Google Drive? This will replace all current data.")) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests returns early from restoreFromGoogleDrive when confirmation is canceled
    white-box DOM and state integration-style tests shows a success notification when restoring from Google Drive is confirmed

[Survived] StringLiteral
app.js:2228:16
-     if (!confirm("Are you sure you want to restore data from Google Drive? This will replace all current data.")) {
+     if (!confirm("")) {
Tests ran:
    white-box DOM and state integration-style tests returns early from restoreFromGoogleDrive when confirmation is canceled
    white-box DOM and state integration-style tests shows a success notification when restoring from Google Drive is confirmed

[Survived] StringLiteral
app.js:2246:16
-     if (!confirm("Are you sure you want to disconnect Google Drive? This will not delete your backups, but automatic backups will stop.")) {
+     if (!confirm("")) {
Tests ran:
    white-box DOM and state integration-style tests disconnects Google Drive when confirmation is accepted
    white-box DOM and state integration-style tests keeps Google Drive connected when disconnect is canceled

[Survived] StringLiteral
app.js:2258:26
-     showUpdateNotification("Disconnected from Google Drive");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests disconnects Google Drive when confirmation is accepted

[Survived] StringLiteral
app.js:2183:68
-     document.getElementById("disconnect-drive-btn").addEventListener("click", disconnectGoogleDrive);
+     document.getElementById("disconnect-drive-btn").addEventListener("", disconnectGoogleDrive);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:2271:25
-     const blob = new Blob([jsonData], { type: "application/json" });
+     const blob = new Blob([], { type: "application/json" });
Tests ran:
    white-box DOM and state integration-style tests exports data by creating and clicking a download link

[Survived] ObjectLiteral
app.js:2271:37
-     const blob = new Blob([jsonData], { type: "application/json" });
+     const blob = new Blob([jsonData], {});
Tests ran:
    white-box DOM and state integration-style tests exports data by creating and clicking a download link

[Survived] StringLiteral
app.js:2271:45
-     const blob = new Blob([jsonData], { type: "application/json" });
+     const blob = new Blob([jsonData], { type: "" });
Tests ran:
    white-box DOM and state integration-style tests exports data by creating and clicking a download link

[Survived] StringLiteral
app.js:2276:27
-     downloadLink.download = `money-manager-backup-${new Date().toISOString().slice(0, 10)}.json`;
+     downloadLink.download = ``;
Tests ran:
    white-box DOM and state integration-style tests exports data by creating and clicking a download link

[Survived] MethodExpression
app.js:2276:51
-     downloadLink.download = `money-manager-backup-${new Date().toISOString().slice(0, 10)}.json`;
+     downloadLink.download = `money-manager-backup-${new Date().toISOString()}.json`;
Tests ran:
    white-box DOM and state integration-style tests exports data by creating and clicking a download link

[Survived] StringLiteral
app.js:2290:20
-     fileInput.type = "file";
+     fileInput.type = "";
Tests ran:
    white-box DOM and state integration-style tests returns early from importData when the file chooser change event has no file
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled
  and 1 more test!

[Survived] StringLiteral
app.js:2291:22
-     fileInput.accept = ".json";
+     fileInput.accept = "";
Tests ran:
    white-box DOM and state integration-style tests returns early from importData when the file chooser change event has no file
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled
  and 1 more test!

[Survived] StringLiteral
app.js:2263:63
-     document.getElementById("export-data-btn").addEventListener("click", exportData);
+     document.getElementById("export-data-btn").addEventListener("", exportData);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:2262:35
-   function initLocalBackupButtons() {
-     document.getElementById("export-data-btn").addEventListener("click", exportData);
-     document.getElementById("import-data-btn").addEventListener("click", importData);
-   }
+   function initLocalBackupButtons() {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:2264:63
-     document.getElementById("import-data-btn").addEventListener("click", importData);
+     document.getElementById("import-data-btn").addEventListener("", importData);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:2296:9
-       if (!file) return;
+       if (false) return;
Tests ran:
    white-box DOM and state integration-style tests returns early from importData when the file chooser change event has no file
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled
  and 1 more test!

[Survived] StringLiteral
app.js:2309:21
-           if (confirm("Are you sure you want to import this data? This will replace all current data.")) {
+           if (confirm("")) {
Tests ran:
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled

[Survived] ArrowFunction
app.js:2315:22
-             setTimeout(() => window.location.reload(), 1500);
+             setTimeout(() => undefined, 1500);
Tests ran:
    white-box DOM and state integration-style tests imports valid JSON data after confirmation

[Survived] MethodExpression
app.js:2335:3
-     today.setHours(0, 0, 0, 0); // Reset time to start of day
+     today.setMinutes(0, 0, 0, 0); // Reset time to start of day
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due
  and 1 more test!

[Survived] BooleanLiteral
app.js:2343:24
-       let shouldCreate = false;
+       let shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2348:24
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 1;
+           shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances

[Survived] BooleanLiteral
app.js:2348:24
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 1;
+           shouldCreate = lastCreated || getDaysDifference(lastCreated, today) >= 1;
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances

[Survived] ConditionalExpression
app.js:2351:24
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 7;
+           shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] BooleanLiteral
app.js:2351:24
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 7;
+           shouldCreate = lastCreated || getDaysDifference(lastCreated, today) >= 7;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] EqualityOperator
app.js:2351:40
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 7;
+           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) > 7;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2354:24
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 14;
+           shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] BooleanLiteral
app.js:2354:24
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 14;
+           shouldCreate = lastCreated || getDaysDifference(lastCreated, today) >= 14;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] EqualityOperator
app.js:2354:40
-           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) >= 14;
+           shouldCreate = !lastCreated || getDaysDifference(lastCreated, today) > 14;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2357:24
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 1;
+           shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed

[Survived] BooleanLiteral
app.js:2357:24
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 1;
+           shouldCreate = lastCreated || getMonthsDifference(lastCreated, today) >= 1;
Tests ran:
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed

[Survived] EqualityOperator
app.js:2357:40
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 1;
+           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) > 1;
Tests ran:
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed

[Survived] ConditionalExpression
app.js:2360:24
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 3;
+           shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] BooleanLiteral
app.js:2360:24
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 3;
+           shouldCreate = lastCreated || getMonthsDifference(lastCreated, today) >= 3;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] EqualityOperator
app.js:2360:40
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 3;
+           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) > 3;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2363:24
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 12;
+           shouldCreate = true;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] BooleanLiteral
app.js:2363:24
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 12;
+           shouldCreate = lastCreated || getMonthsDifference(lastCreated, today) >= 12;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] EqualityOperator
app.js:2363:40
-           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) >= 12;
+           shouldCreate = !lastCreated || getMonthsDifference(lastCreated, today) > 12;
Tests ran:
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2367:9
-       if (shouldCreate) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] BooleanLiteral
app.js:2377:19
-           isPinned: false,
+           isPinned: true,
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] StringLiteral
app.js:2378:16
-           notes: `Auto-created recurring transaction: ${recurringTx.description}`,
+           notes: ``,
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2379:15
-           tags: recurringTx.tags || [],
+           tags: true,
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2379:15
-           tags: recurringTx.tags || [],
+           tags: false,
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] LogicalOperator
app.js:2379:15
-           tags: recurringTx.tags || [],
+           tags: recurringTx.tags && [],
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] StringLiteral
app.js:2380:13
-           id: "tx-" + Math.random().toString(36).substr(2, 9)
+           id: "" + Math.random().toString(36).substr(2, 9)
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ArrayDeclaration
app.js:2379:35
-           tags: recurringTx.tags || [],
+           tags: recurringTx.tags || ["Stryker was here"],
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] MethodExpression
app.js:2380:21
-           id: "tx-" + Math.random().toString(36).substr(2, 9)
+           id: "tx-" + Math.random().toString(36)
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2393:11
-         if (data.settings.recurring.notifications) {
+         if (true) {
Tests ran:
    white-box DOM and state integration-style tests auto-creates a daily recurring transaction and updates balances
    white-box DOM and state integration-style tests auto-creates a monthly recurring transaction when a month has passed
    white-box DOM and state integration-style tests auto-creates weekly, biweekly, quarterly, and yearly recurring transactions when due

[Survived] ConditionalExpression
app.js:2420:7
-     if (!document.getElementById("recurring-tx-modal")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows the recurring transactions modal with the empty-state message
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2420:32
-     if (!document.getElementById("recurring-tx-modal")) {
+     if (!document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests shows the recurring transactions modal with the empty-state message
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2439:69
-       document.getElementById("recurring-close-btn").addEventListener("click", function() {
+       document.getElementById("recurring-close-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows the recurring transactions modal with the empty-state message
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2444:67
-       document.getElementById("add-recurring-btn").addEventListener("click", function() {
+       document.getElementById("add-recurring-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows the recurring transactions modal with the empty-state message
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2465:27
-     listElement.innerHTML = '';
+     listElement.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests shows the recurring transactions modal with the empty-state message
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2478:27
-       txElement.className = "recurring-tx-item";
+       txElement.className = "";
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2490:59
-           <button class="toggle-recurring-btn ${tx.active ? 'active' : ''}" data-id="${tx.id}">
+           <button class="toggle-recurring-btn ${tx.active ? "" : ''}" data-id="${tx.id}">
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2491:42
-             <i class="fas fa-${tx.active ? 'toggle-on' : 'toggle-off'}"></i>
+             <i class="fas fa-${tx.active ? "" : 'toggle-off'}"></i>
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] BlockStatement
app.js:2513:67
-     document.querySelectorAll(".edit-recurring-btn").forEach(btn => {
-       btn.addEventListener("click", function() {
-         const txId = this.getAttribute("data-id");
-         editRecurringTransaction(txId);
-       });
-     });
+     document.querySelectorAll(".edit-recurring-btn").forEach(btn => {});
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2514:26
-       btn.addEventListener("click", function() {
+       btn.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] BlockStatement
app.js:2520:69
-     document.querySelectorAll(".delete-recurring-btn").forEach(btn => {
-       btn.addEventListener("click", function() {
-         const txId = this.getAttribute("data-id");
-         deleteRecurringTransaction(txId);
-       });
-     });
+     document.querySelectorAll(".delete-recurring-btn").forEach(btn => {});
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2521:26
-       btn.addEventListener("click", function() {
+       btn.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] ConditionalExpression
app.js:2564:60
-     const tx = data.settings.recurringTransactions.find(t => t.id === txId);
+     const tx = data.settings.recurringTransactions.find(t => true);
Tests ran:
    white-box DOM and state integration-style tests toggles a recurring transaction active state

[Survived] StringLiteral
app.js:2585:16
-     if (!confirm("Are you sure you want to delete this recurring transaction?")) {
+     if (!confirm("")) {
Tests ran:
    white-box DOM and state integration-style tests deletes a recurring transaction after confirmation
    white-box DOM and state integration-style tests keeps a recurring transaction when delete confirmation is canceled

[Survived] ArrowFunction
app.js:2590:84
-     data.settings.recurringTransactions = data.settings.recurringTransactions.filter(t => t.id !== txId);
+     data.settings.recurringTransactions = data.settings.recurringTransactions.filter(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests deletes a recurring transaction after confirmation

[Survived] ConditionalExpression
app.js:2590:89
-     data.settings.recurringTransactions = data.settings.recurringTransactions.filter(t => t.id !== txId);
+     data.settings.recurringTransactions = data.settings.recurringTransactions.filter(t => false);
Tests ran:
    white-box DOM and state integration-style tests deletes a recurring transaction after confirmation

[Survived] StringLiteral
app.js:2656:48
-     const calendarGrid = document.getElementById("calendar-grid");
+     const calendarGrid = document.getElementById("");
Tests ran:
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests deletes a bill when confirmed
  and 1 more test!
