[Survived] ConditionalExpression
app.js:2657:7
-     if (!calendarGrid) return;
+     if (true) return;
Tests ran:
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests deletes a bill when confirmed
  and 1 more test!

[Survived] ConditionalExpression
app.js:2755:7
-     if (!document.getElementById("bill-modal")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2755:32
-     if (!document.getElementById("bill-modal")) {
+     if (!document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2811:64
-       document.getElementById("bill-close-btn").addEventListener("click", function() {
+       document.getElementById("bill-close-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2816:65
-       document.getElementById("bill-cancel-btn").addEventListener("click", function() {
+       document.getElementById("bill-cancel-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2821:59
-       document.getElementById("bill-form").addEventListener("submit", function(e) {
+       document.getElementById("bill-form").addEventListener("", function(e) {
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2830:59
-     document.getElementById("bill-modal-title").innerHTML = '<i class="fas fa-file-invoice-dollar"></i> Add Bill';
+     document.getElementById("bill-modal-title").innerHTML = "";
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2834:29
-     accountSelect.innerHTML = '';
+     accountSelect.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2844:30
-     categorySelect.innerHTML = '';
+     categorySelect.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests creates and shows the add bill modal with account and category options
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2869:9
-       id: "bill-" + Math.random().toString(36).substr(2, 9),
+       id: "" + Math.random().toString(36).substr(2, 9),
Tests ran:
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    black-box functional tests using EP, BA, EG, and simple combinations BA: a zero-amount bill can still be saved through the bill form

[Survived] MethodExpression
app.js:2869:19
-       id: "bill-" + Math.random().toString(36).substr(2, 9),
+       id: "bill-" + Math.random().toString(36),
Tests ran:
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    black-box functional tests using EP, BA, EG, and simple combinations BA: a zero-amount bill can still be saved through the bill form

[Survived] BooleanLiteral
app.js:2877:11
-       paid: false
+       paid: true
Tests ran:
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    black-box functional tests using EP, BA, EG, and simple combinations BA: a zero-amount bill can still be saved through the bill form

[Survived] StringLiteral
app.js:2893:26
-     showUpdateNotification("Bill added successfully");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests saves a bill and closes the bill modal
    black-box functional tests using EP, BA, EG, and simple combinations BA: a zero-amount bill can still be saved through the bill form

[Survived] ConditionalExpression
app.js:2899:37
-     const bill = data.bills.find(b => b.id === billId);
+     const bill = data.bills.find(b => true);
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] ConditionalExpression
app.js:2900:7
-     if (!bill) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] ConditionalExpression
app.js:2903:7
-     if (!document.getElementById("bill-details-modal")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2903:32
-     if (!document.getElementById("bill-details-modal")) {
+     if (!document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2924:72
-       document.getElementById("bill-details-close-btn").addEventListener("click", function() {
+       document.getElementById("bill-details-close-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2929:62
-       document.getElementById("pay-bill-btn").addEventListener("click", function() {
+       document.getElementById("pay-bill-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2933:63
-       document.getElementById("edit-bill-btn").addEventListener("click", function() {
+       document.getElementById("edit-bill-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2937:65
-       document.getElementById("delete-bill-btn").addEventListener("click", function() {
+       document.getElementById("delete-bill-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] ConditionalExpression
app.js:2943:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] ConditionalExpression
app.js:2943:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] LogicalOperator
app.js:2943:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts && !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] BooleanLiteral
app.js:2943:7
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (data.accounts || !Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] BooleanLiteral
app.js:2943:25
-     if (!data.accounts || !Array.isArray(data.accounts)) {
+     if (!data.accounts || Array.isArray(data.accounts)) {
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] ConditionalExpression
app.js:2962:38
-       <p><strong>Recurring:</strong> ${bill.recurring === 'none' ? 'No' : bill.recurring}</p>
+       <p><strong>Recurring:</strong> ${true ? 'No' : bill.recurring}</p>
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] ConditionalExpression
app.js:2962:38
-       <p><strong>Recurring:</strong> ${bill.recurring === 'none' ? 'No' : bill.recurring}</p>
+       <p><strong>Recurring:</strong> ${false ? 'No' : bill.recurring}</p>
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] EqualityOperator
app.js:2962:38
-       <p><strong>Recurring:</strong> ${bill.recurring === 'none' ? 'No' : bill.recurring}</p>
+       <p><strong>Recurring:</strong> ${bill.recurring !== 'none' ? 'No' : bill.recurring}</p>
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2962:57
-       <p><strong>Recurring:</strong> ${bill.recurring === 'none' ? 'No' : bill.recurring}</p>
+       <p><strong>Recurring:</strong> ${bill.recurring === "" ? 'No' : bill.recurring}</p>
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2963:20
-       ${bill.notes ? `<p><strong>Notes:</strong> ${bill.notes}</p>` : ''}
+       ${bill.notes ? `` : ''}
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
  and 1 more test!

[Survived] StringLiteral
app.js:2964:72
-       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : 'unpaid'}">${bill.paid ? 'Paid' : 'Unpaid'}</span></p>
+       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? "" : 'unpaid'}">${bill.paid ? 'Paid' : 'Unpaid'}</span></p>
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:2964:106
-       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : 'unpaid'}">${bill.paid ? 'Paid' : 'Unpaid'}</span></p>
+       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : 'unpaid'}">${bill.paid ? "" : 'Unpaid'}</span></p>
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:2964:81
-       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : 'unpaid'}">${bill.paid ? 'Paid' : 'Unpaid'}</span></p>
+       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : ""}">${bill.paid ? 'Paid' : 'Unpaid'}</span></p>
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] StringLiteral
app.js:2964:115
-       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : 'unpaid'}">${bill.paid ? 'Paid' : 'Unpaid'}</span></p>
+       <p><strong>Status:</strong> <span class="bill-status ${bill.paid ? 'paid' : 'unpaid'}">${bill.paid ? 'Paid' : ""}</span></p>
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] StringLiteral
app.js:2974:5
-       '<i class="fas fa-undo"></i> Mark as Unpaid' : 
+       "" : 
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:2975:5
-       '<i class="fas fa-check"></i> Mark as Paid';
+       "";
Tests ran:
    white-box DOM and state integration-style tests shows bill details for an existing bill
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] ConditionalExpression
app.js:2985:37
-     const bill = data.bills.find(b => b.id === billId);
+     const bill = data.bills.find(b => true);
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ConditionalExpression
app.js:2986:7
-     if (!bill) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ConditionalExpression
app.js:2992:7
-     if (bill.paid) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:2994:11
-         id: "tx-" + Math.random().toString(36).substr(2, 9),
+         id: "" + Math.random().toString(36).substr(2, 9),
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] MethodExpression
app.js:2994:19
-         id: "tx-" + Math.random().toString(36).substr(2, 9),
+         id: "tx-" + Math.random().toString(36),
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:2997:13
-         type: "expense",
+         type: "",
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ConditionalExpression
app.js:3001:20
-         isRecurring: bill.recurring !== 'none',
+         isRecurring: true,
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ConditionalExpression
app.js:3001:20
-         isRecurring: bill.recurring !== 'none',
+         isRecurring: false,
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] EqualityOperator
app.js:3001:20
-         isRecurring: bill.recurring !== 'none',
+         isRecurring: bill.recurring === 'none',
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:3001:39
-         isRecurring: bill.recurring !== 'none',
+         isRecurring: bill.recurring !== "",
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] BooleanLiteral
app.js:3002:17
-         isPinned: false,
+         isPinned: true,
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:3003:14
-         notes: `Paid bill: ${bill.description}`,
+         notes: ``,
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ArrayDeclaration
app.js:3004:13
-         tags: ["Bill Payment"]
+         tags: []
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:3004:14
-         tags: ["Bill Payment"]
+         tags: [""]
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:3025:26
-     showUpdateNotification(`Bill marked as ${bill.paid ? 'paid' : 'unpaid'}`);
+     showUpdateNotification(``);
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] StringLiteral
app.js:3025:56
-     showUpdateNotification(`Bill marked as ${bill.paid ? 'paid' : 'unpaid'}`);
+     showUpdateNotification(`Bill marked as ${bill.paid ? "" : 'unpaid'}`);
Tests ran:
    white-box DOM and state integration-style tests marks a bill as paid and creates a transaction

[Survived] ConditionalExpression
app.js:3031:37
-     const bill = data.bills.find(b => b.id === billId);
+     const bill = data.bills.find(b => true);
Tests ran:
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill

[Survived] ConditionalExpression
app.js:3032:7
-     if (!bill) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill

[Survived] ConditionalExpression
app.js:3048:49
-     document.getElementById("bill-notes").value = bill.notes || '';
+     document.getElementById("bill-notes").value = true;
Tests ran:
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill

[Survived] ConditionalExpression
app.js:3048:49
-     document.getElementById("bill-notes").value = bill.notes || '';
+     document.getElementById("bill-notes").value = false;
Tests ran:
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill

[Survived] LogicalOperator
app.js:3048:49
-     document.getElementById("bill-notes").value = bill.notes || '';
+     document.getElementById("bill-notes").value = bill.notes && '';
Tests ran:
    white-box DOM and state integration-style tests opens the bill edit form for an existing bill

[Survived] ConditionalExpression
app.js:3080:7
-     if (!confirm("Are you sure you want to delete this bill?")) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] StringLiteral
app.js:3080:16
-     if (!confirm("Are you sure you want to delete this bill?")) return;
+     if (!confirm("")) return;
Tests ran:
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] ArrowFunction
app.js:3083:34
-     data.bills = data.bills.filter(b => b.id !== billId);
+     data.bills = data.bills.filter(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] ConditionalExpression
app.js:3083:39
-     data.bills = data.bills.filter(b => b.id !== billId);
+     data.bills = data.bills.filter(b => false);
Tests ran:
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] StringLiteral
app.js:3095:26
-     showUpdateNotification("Bill deleted successfully");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests deletes a bill when confirmed

[Survived] ConditionalExpression
app.js:3101:7
-     if (!document.getElementById("categories-modal")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] StringLiteral
app.js:3101:32
-     if (!document.getElementById("categories-modal")) {
+     if (!document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] StringLiteral
app.js:3121:70
-       document.getElementById("categories-close-btn").addEventListener("click", function() {
+       document.getElementById("categories-close-btn").addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] StringLiteral
app.js:3126:66
-       document.getElementById("add-category-btn").addEventListener("click", addNewCategory);
+       document.getElementById("add-category-btn").addEventListener("", addNewCategory);
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3140:7
-     if (!categoriesListEl) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] StringLiteral
app.js:3142:32
-     categoriesListEl.innerHTML = '';
+     categoriesListEl.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3145:7
-     if (!data.categories || !Array.isArray(data.categories)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] LogicalOperator
app.js:3145:7
-     if (!data.categories || !Array.isArray(data.categories)) {
+     if (!data.categories && !Array.isArray(data.categories)) {
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] StringLiteral
app.js:3163:33
-       categoryElement.className = "category-item";
+       categoryElement.className = "";
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] BlockStatement
app.js:3173:68
-     document.querySelectorAll(".delete-category-btn").forEach(btn => {
-       btn.addEventListener("click", function() {
-         const category = this.getAttribute("data-category");
-         deleteCategory(category);
-       });
-     });
+     document.querySelectorAll(".delete-category-btn").forEach(btn => {});
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] StringLiteral
app.js:3174:26
-       btn.addEventListener("click", function() {
+       btn.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests shows the categories modal and renders category items
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
  and 2 more tests!

[Survived] MethodExpression
app.js:3184:20
-     const category = categoryInput.value.trim();
+     const category = categoryInput.value;
Tests ran:
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
    black-box functional tests using EP, BA, EG, and simple combinations EG: duplicate category names are rejected from the category manager
