[Survived] ConditionalExpression
app.js:3186:7
-     if (!category) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests adds a new category through the category management form
    white-box DOM and state integration-style tests rejects duplicate categories
    black-box functional tests using EP, BA, EG, and simple combinations EG: duplicate category names are rejected from the category manager

[Survived] StringLiteral
app.js:3207:25
-     categoryInput.value = "";
+     categoryInput.value = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests adds a new category through the category management form

[Survived] StringLiteral
app.js:3208:26
-     showUpdateNotification("Category added successfully");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests adds a new category through the category management form

[Survived] StringLiteral
app.js:3197:27
-       categoryInput.value = "";
+       categoryInput.value = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests rejects duplicate categories
    black-box functional tests using EP, BA, EG, and simple combinations EG: duplicate category names are rejected from the category manager

[Survived] ConditionalExpression
app.js:3219:7
-     if (!confirm(`Are you sure you want to delete the "${category}" category? Transactions with this category will be set to "Other".`)) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] StringLiteral
app.js:3219:16
-     if (!confirm(`Are you sure you want to delete the "${category}" category? Transactions with this category will be set to "Other".`)) {
+     if (!confirm(``)) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] ConditionalExpression
app.js:3225:9
-       if (tx.category === category) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] ConditionalExpression
app.js:3232:9
-       if (bill.category === category) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] ArrowFunction
app.js:3238:44
-     data.categories = data.categories.filter(c => c !== category);
+     data.categories = data.categories.filter(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] ConditionalExpression
app.js:3238:49
-     data.categories = data.categories.filter(c => c !== category);
+     data.categories = data.categories.filter(c => false);
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] StringLiteral
app.js:3244:26
-     showUpdateNotification("Category deleted successfully");
+     showUpdateNotification("");
Tests ran:
    white-box DOM and state integration-style tests reassigns transactions and bills when deleting a category

[Survived] BooleanLiteral
app.js:3249:7
-     if (!window.Chart) return; // Skip if Chart.js isn't loaded
+     if (window.Chart) return; // Skip if Chart.js isn't loaded
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3249:7
-     if (!window.Chart) return; // Skip if Chart.js isn't loaded
+     if (true) return; // Skip if Chart.js isn't loaded
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3249:7
-     if (!window.Chart) return; // Skip if Chart.js isn't loaded
+     if (false) return; // Skip if Chart.js isn't loaded
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3252:7
-     if (window.incomeVsExpenseChart) window.incomeVsExpenseChart.destroy();
+     if (false) window.incomeVsExpenseChart.destroy();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3253:7
-     if (window.categoryChart) window.categoryChart.destroy();
+     if (false) window.categoryChart.destroy();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3254:7
-     if (window.accountBalanceChart) window.accountBalanceChart.destroy();
+     if (false) window.accountBalanceChart.destroy();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3255:7
-     if (window.balanceOverTimeChart) window.balanceOverTimeChart.destroy();
+     if (false) window.balanceOverTimeChart.destroy();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3260:17
-       .getContext("2d");
+       .getContext("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3263:17
-       .getContext("2d");
+       .getContext("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3266:17
-       .getContext("2d");
+       .getContext("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] OptionalChaining
app.js:3267:30
-     const balanceOverTimeCtx = document
-       .getElementById("balance-over-time-chart")
-       ?.getContext("2d");
+     const balanceOverTimeCtx = document.getElementById("balance-over-time-chart").getContext("2d");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3268:21
-       .getElementById("balance-over-time-chart")
+       .getElementById("")
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3269:18
-       ?.getContext("2d");
+       ?.getContext("");
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3270:7
-     if (!balanceOverTimeCtx) return; // Skip if canvas not found
+     if (true) return; // Skip if canvas not found
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3270:7
-     if (!balanceOverTimeCtx) return; // Skip if canvas not found
+     if (balanceOverTimeCtx) return; // Skip if canvas not found
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3278:66
-     const thisMonthTransactions = data.transactions.filter((tx) => {
-       const txDate = new Date(tx.date);
-       return (
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
-       );
-     });
+     const thisMonthTransactions = data.transactions.filter((tx) => {});
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3281:7
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         true
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3281:7
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         false
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] LogicalOperator
app.js:3281:7
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         txDate.getMonth() === currentMonth || txDate.getFullYear() === currentYear
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3281:7
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         true && txDate.getFullYear() === currentYear
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] EqualityOperator
app.js:3281:7
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         txDate.getMonth() !== currentMonth && txDate.getFullYear() === currentYear
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3270:7
-     if (!balanceOverTimeCtx) return; // Skip if canvas not found
+     if (false) return; // Skip if canvas not found
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3281:45
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         txDate.getMonth() === currentMonth && true
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] EqualityOperator
app.js:3281:45
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
+         txDate.getMonth() === currentMonth && txDate.getFullYear() !== currentYear
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] MethodExpression
app.js:3278:33
-     const thisMonthTransactions = data.transactions.filter((tx) => {
-       const txDate = new Date(tx.date);
-       return (
-         txDate.getMonth() === currentMonth && txDate.getFullYear() === currentYear
-       );
-     });
+     const thisMonthTransactions = data.transactions;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3287:21
-       .filter((tx) => tx.type === "income")
+       .filter((tx) => true)
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3287:21
-       .filter((tx) => tx.type === "income")
+       .filter((tx) => false)
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] EqualityOperator
app.js:3287:21
-       .filter((tx) => tx.type === "income")
+       .filter((tx) => tx.type !== "income")
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] StringLiteral
app.js:3287:33
-       .filter((tx) => tx.type === "income")
+       .filter((tx) => tx.type === "")
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ArithmeticOperator
app.js:3288:26
-       .reduce((sum, tx) => sum + tx.amount, 0);
+       .reduce((sum, tx) => sum - tx.amount, 0);
Tests ran:
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    black-box functional tests using EP, BA, EG, and simple combinations BA: clearing the search input restores the full visible transaction list
    black-box functional tests using EP, BA, EG, and simple combinations Combinatorial: account and type filters together isolate the matching transaction

[Survived] MethodExpression
app.js:3286:18
-     const income = thisMonthTransactions
-       .filter((tx) => tx.type === "income")
+     const income = thisMonthTransactions
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrowFunction
app.js:3287:13
-       .filter((tx) => tx.type === "income")
+       .filter(() => undefined)
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3291:21
-       .filter((tx) => tx.type === "expense")
+       .filter((tx) => true)
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ArrowFunction
app.js:3288:13
-       .reduce((sum, tx) => sum + tx.amount, 0);
+       .reduce(() => undefined, 0);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3291:21
-       .filter((tx) => tx.type === "expense")
+       .filter((tx) => false)
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] MethodExpression
app.js:3290:19
-     const expense = thisMonthTransactions
-       .filter((tx) => tx.type === "expense")
+     const expense = thisMonthTransactions
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3291:21
-       .filter((tx) => tx.type === "expense")
+       .filter((tx) => tx.type !== "expense")
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] StringLiteral
app.js:3291:33
-       .filter((tx) => tx.type === "expense")
+       .filter((tx) => tx.type === "")
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ArithmeticOperator
app.js:3292:26
-       .reduce((sum, tx) => sum + tx.amount, 0);
+       .reduce((sum, tx) => sum - tx.amount, 0);
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] ArrowFunction
app.js:3291:13
-       .filter((tx) => tx.type === "expense")
+       .filter(() => undefined)
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrowFunction
app.js:3292:13
-       .reduce((sum, tx) => sum + tx.amount, 0);
+       .reduce(() => undefined, 0);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3296:11
-       type: "bar",
+       type: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3297:11
-       data: {
-         labels: ["Income", "Expense"],
-         datasets: [
-           {
-             label: "Amount (€)",
-             data: [income, expense],
-             backgroundColor: ["rgba(76, 175, 80, 0.6)", "rgba(244, 67, 54, 0.6)"],
-             borderColor: ["rgb(76, 175, 80)", "rgb(244, 67, 54)"],
-             borderWidth: 1,
-           },
-         ],
-       },
+       data: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3298:15
-         labels: ["Income", "Expense"],
+         labels: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3298:16
-         labels: ["Income", "Expense"],
+         labels: ["", "Expense"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3298:26
-         labels: ["Income", "Expense"],
+         labels: ["Income", ""],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3299:17
-         datasets: [
-           {
-             label: "Amount (€)",
-             data: [income, expense],
-             backgroundColor: ["rgba(76, 175, 80, 0.6)", "rgba(244, 67, 54, 0.6)"],
-             borderColor: ["rgb(76, 175, 80)", "rgb(244, 67, 54)"],
-             borderWidth: 1,
-           },
-         ],
+         datasets: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3300:9
-           {
-             label: "Amount (€)",
-             data: [income, expense],
-             backgroundColor: ["rgba(76, 175, 80, 0.6)", "rgba(244, 67, 54, 0.6)"],
-             borderColor: ["rgb(76, 175, 80)", "rgb(244, 67, 54)"],
-             borderWidth: 1,
-           },
+           {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3301:18
-             label: "Amount (€)",
+             label: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3303:28
-             backgroundColor: ["rgba(76, 175, 80, 0.6)", "rgba(244, 67, 54, 0.6)"],
+             backgroundColor: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3302:17
-             data: [income, expense],
+             data: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!
