[Survived] StringLiteral
app.js:3303:29
-             backgroundColor: ["rgba(76, 175, 80, 0.6)", "rgba(244, 67, 54, 0.6)"],
+             backgroundColor: ["", "rgba(244, 67, 54, 0.6)"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3303:55
-             backgroundColor: ["rgba(76, 175, 80, 0.6)", "rgba(244, 67, 54, 0.6)"],
+             backgroundColor: ["rgba(76, 175, 80, 0.6)", ""],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3304:25
-             borderColor: ["rgb(76, 175, 80)", "rgb(244, 67, 54)"],
+             borderColor: ["", "rgb(244, 67, 54)"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3304:24
-             borderColor: ["rgb(76, 175, 80)", "rgb(244, 67, 54)"],
+             borderColor: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3304:45
-             borderColor: ["rgb(76, 175, 80)", "rgb(244, 67, 54)"],
+             borderColor: ["rgb(76, 175, 80)", ""],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3309:14
-       options: {
-         responsive: true,
-         plugins: {
-           title: {
-             display: true,
-             text: "Income vs Expense This Month",
-           },
-         },
-         scales: {
-           y: {
-             beginAtZero: true,
-           },
-         },
-       },
+       options: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3311:16
-         plugins: {
-           title: {
-             display: true,
-             text: "Income vs Expense This Month",
-           },
-         },
+         plugins: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3310:19
-         responsive: true,
+         responsive: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3312:16
-           title: {
-             display: true,
-             text: "Income vs Expense This Month",
-           },
+           title: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3313:20
-             display: true,
+             display: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3317:15
-         scales: {
-           y: {
-             beginAtZero: true,
-           },
-         },
+         scales: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3314:17
-             text: "Income vs Expense This Month",
+             text: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3327:41
-     thisMonthTransactions.forEach((tx) => {
-       if (tx.type === "expense") {
-         const category = tx.category || "Other";
-         categories[category] = (categories[category] || 0) + tx.amount;
-       }
-     });
+     thisMonthTransactions.forEach((tx) => {});
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3328:9
-       if (tx.type === "expense") {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] ConditionalExpression
app.js:3328:9
-       if (tx.type === "expense") {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] EqualityOperator
app.js:3328:9
-       if (tx.type === "expense") {
+       if (tx.type !== "expense") {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] StringLiteral
app.js:3328:21
-       if (tx.type === "expense") {
+       if (tx.type === "") {
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests updates an edited transaction, moves its account balance, and adds it to pinned settings
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
  and 8 more tests!

[Survived] BlockStatement
app.js:3328:32
-       if (tx.type === "expense") {
-         const category = tx.category || "Other";
-         categories[category] = (categories[category] || 0) + tx.amount;
-       }
+       if (tx.type === "expense") {}
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] ObjectLiteral
app.js:3318:12
-           y: {
-             beginAtZero: true,
-           },
+           y: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3329:24
-         const category = tx.category || "Other";
+         const category = false;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] ConditionalExpression
app.js:3329:24
-         const category = tx.category || "Other";
+         const category = true;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] BooleanLiteral
app.js:3319:24
-             beginAtZero: true,
+             beginAtZero: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3329:24
-         const category = tx.category || "Other";
+         const category = tx.category && "Other";
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] ArithmeticOperator
app.js:3330:30
-         categories[category] = (categories[category] || 0) + tx.amount;
+         categories[category] = (categories[category] || 0) - tx.amount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] ConditionalExpression
app.js:3330:31
-         categories[category] = (categories[category] || 0) + tx.amount;
+         categories[category] = (true) + tx.amount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] ConditionalExpression
app.js:3330:31
-         categories[category] = (categories[category] || 0) + tx.amount;
+         categories[category] = (false) + tx.amount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] LogicalOperator
app.js:3330:31
-         categories[category] = (categories[category] || 0) + tx.amount;
+         categories[category] = (categories[category] && 0) + tx.amount;
Tests ran:
    white-box DOM and state integration-style tests submits the edit transaction form through its submit event handler
    white-box DOM and state integration-style tests removes an edited transaction from pinned settings when it is unpinned
    black-box functional tests using EP, BA, EG, and simple combinations EP: accepts a valid expense transaction through the public form
  and 7 more tests!

[Survived] StringLiteral
app.js:3336:11
-       type: "doughnut",
+       type: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3337:11
-       data: {
-         labels: Object.keys(categories),
-         datasets: [
-           {
-             data: Object.values(categories),
-             backgroundColor: [
-               "rgba(255, 99, 132, 0.6)",
-               "rgba(54, 162, 235, 0.6)",
-               "rgba(255, 206, 86, 0.6)",
-               "rgba(75, 192, 192, 0.6)",
-               "rgba(153, 102, 255, 0.6)",
-               "rgba(255, 159, 64, 0.6)",
-               "rgba(199, 199, 199, 0.6)",
-               "rgba(83, 102, 255, 0.6)",
-               "rgba(40, 159, 64, 0.6)",
-               "rgba(210, 199, 199, 0.6)",
-               "rgba(78, 52, 199, 0.6)",
-               "rgba(225, 109, 64, 0.6)",
-             ],
-           },
-         ],
-       },
+       data: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3339:17
-         datasets: [
-           {
-             data: Object.values(categories),
-             backgroundColor: [
-               "rgba(255, 99, 132, 0.6)",
-               "rgba(54, 162, 235, 0.6)",
-               "rgba(255, 206, 86, 0.6)",
-               "rgba(75, 192, 192, 0.6)",
-               "rgba(153, 102, 255, 0.6)",
-               "rgba(255, 159, 64, 0.6)",
-               "rgba(199, 199, 199, 0.6)",
-               "rgba(83, 102, 255, 0.6)",
-               "rgba(40, 159, 64, 0.6)",
-               "rgba(210, 199, 199, 0.6)",
-               "rgba(78, 52, 199, 0.6)",
-               "rgba(225, 109, 64, 0.6)",
-             ],
-           },
-         ],
+         datasets: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3340:9
-           {
-             data: Object.values(categories),
-             backgroundColor: [
-               "rgba(255, 99, 132, 0.6)",
-               "rgba(54, 162, 235, 0.6)",
-               "rgba(255, 206, 86, 0.6)",
-               "rgba(75, 192, 192, 0.6)",
-               "rgba(153, 102, 255, 0.6)",
-               "rgba(255, 159, 64, 0.6)",
-               "rgba(199, 199, 199, 0.6)",
-               "rgba(83, 102, 255, 0.6)",
-               "rgba(40, 159, 64, 0.6)",
-               "rgba(210, 199, 199, 0.6)",
-               "rgba(78, 52, 199, 0.6)",
-               "rgba(225, 109, 64, 0.6)",
-             ],
-           },
+           {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3342:28
-             backgroundColor: [
-               "rgba(255, 99, 132, 0.6)",
-               "rgba(54, 162, 235, 0.6)",
-               "rgba(255, 206, 86, 0.6)",
-               "rgba(75, 192, 192, 0.6)",
-               "rgba(153, 102, 255, 0.6)",
-               "rgba(255, 159, 64, 0.6)",
-               "rgba(199, 199, 199, 0.6)",
-               "rgba(83, 102, 255, 0.6)",
-               "rgba(40, 159, 64, 0.6)",
-               "rgba(210, 199, 199, 0.6)",
-               "rgba(78, 52, 199, 0.6)",
-               "rgba(225, 109, 64, 0.6)",
-             ],
+             backgroundColor: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3343:13
-               "rgba(255, 99, 132, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3344:13
-               "rgba(54, 162, 235, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3345:13
-               "rgba(255, 206, 86, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3346:13
-               "rgba(75, 192, 192, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3347:13
-               "rgba(153, 102, 255, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3348:13
-               "rgba(255, 159, 64, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3349:13
-               "rgba(199, 199, 199, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3350:13
-               "rgba(83, 102, 255, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3351:13
-               "rgba(40, 159, 64, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3352:13
-               "rgba(210, 199, 199, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3353:13
-               "rgba(78, 52, 199, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3354:13
-               "rgba(225, 109, 64, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3359:14
-       options: {
-         responsive: true,
-         plugins: {
-           title: {
-             display: true,
-             text: "Spending by Category",
-           },
-         },
-       },
+       options: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3360:19
-         responsive: true,
+         responsive: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3361:16
-         plugins: {
-           title: {
-             display: true,
-             text: "Spending by Category",
-           },
-         },
+         plugins: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3362:16
-           title: {
-             display: true,
-             text: "Spending by Category",
-           },
+           title: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3363:20
-             display: true,
+             display: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3364:17
-             text: "Spending by Category",
+             text: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3372:11
-       type: "pie",
+       type: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3373:11
-       data: {
-         labels: ["Credit Union", "Revolut", "Cash"],
-         datasets: [
-           {
-             data: [
-               data.balances.cu || 0,
-               data.balances.revolut || 0,
-               data.balances.cash || 0,
-             ],
-             backgroundColor: [
-               "rgba(106, 117, 202, 0.6)",
-               "rgba(243, 119, 54, 0.6)",
-               "rgba(76, 175, 80, 0.6)",
-             ],
-             borderColor: [
-               "rgb(106, 117, 202)",
-               "rgb(243, 119, 54)",
-               "rgb(76, 175, 80)",
-             ],
-             borderWidth: 1,
-           },
-         ],
-       },
+       data: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty

[Survived] ArrayDeclaration
app.js:3374:15
-         labels: ["Credit Union", "Revolut", "Cash"],
+         labels: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3374:16
-         labels: ["Credit Union", "Revolut", "Cash"],
+         labels: ["", "Revolut", "Cash"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3374:43
-         labels: ["Credit Union", "Revolut", "Cash"],
+         labels: ["Credit Union", "Revolut", ""],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!
