[Survived] StringLiteral
app.js:3374:32
-         labels: ["Credit Union", "Revolut", "Cash"],
+         labels: ["Credit Union", "", "Cash"],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3375:17
-         datasets: [
-           {
-             data: [
-               data.balances.cu || 0,
-               data.balances.revolut || 0,
-               data.balances.cash || 0,
-             ],
-             backgroundColor: [
-               "rgba(106, 117, 202, 0.6)",
-               "rgba(243, 119, 54, 0.6)",
-               "rgba(76, 175, 80, 0.6)",
-             ],
-             borderColor: [
-               "rgb(106, 117, 202)",
-               "rgb(243, 119, 54)",
-               "rgb(76, 175, 80)",
-             ],
-             borderWidth: 1,
-           },
-         ],
+         datasets: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3376:9
-           {
-             data: [
-               data.balances.cu || 0,
-               data.balances.revolut || 0,
-               data.balances.cash || 0,
-             ],
-             backgroundColor: [
-               "rgba(106, 117, 202, 0.6)",
-               "rgba(243, 119, 54, 0.6)",
-               "rgba(76, 175, 80, 0.6)",
-             ],
-             borderColor: [
-               "rgb(106, 117, 202)",
-               "rgb(243, 119, 54)",
-               "rgb(76, 175, 80)",
-             ],
-             borderWidth: 1,
-           },
+           {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3377:17
-             data: [
-               data.balances.cu || 0,
-               data.balances.revolut || 0,
-               data.balances.cash || 0,
-             ],
+             data: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3378:13
-               data.balances.cu || 0,
+               true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3378:13
-               data.balances.cu || 0,
+               false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3378:13
-               data.balances.cu || 0,
+               data.balances.cu && 0,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3379:13
-               data.balances.revolut || 0,
+               true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3379:13
-               data.balances.revolut || 0,
+               false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3379:13
-               data.balances.revolut || 0,
+               data.balances.revolut && 0,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3380:13
-               data.balances.cash || 0,
+               true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3380:13
-               data.balances.cash || 0,
+               false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3380:13
-               data.balances.cash || 0,
+               data.balances.cash && 0,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3382:28
-             backgroundColor: [
-               "rgba(106, 117, 202, 0.6)",
-               "rgba(243, 119, 54, 0.6)",
-               "rgba(76, 175, 80, 0.6)",
-             ],
+             backgroundColor: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3383:13
-               "rgba(106, 117, 202, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3384:13
-               "rgba(243, 119, 54, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3385:13
-               "rgba(76, 175, 80, 0.6)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArrayDeclaration
app.js:3387:24
-             borderColor: [
-               "rgb(106, 117, 202)",
-               "rgb(243, 119, 54)",
-               "rgb(76, 175, 80)",
-             ],
+             borderColor: [],
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3389:13
-               "rgb(243, 119, 54)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3388:13
-               "rgb(106, 117, 202)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3390:13
-               "rgb(76, 175, 80)",
+               "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3396:14
-       options: {
-         responsive: true,
-         plugins: {
-           title: {
-             display: true,
-             text: "Balance Distribution",
-           },
-         },
-       },
+       options: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3398:16
-         plugins: {
-           title: {
-             display: true,
-             text: "Balance Distribution",
-           },
-         },
+         plugins: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3397:19
-         responsive: true,
+         responsive: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:3399:16
-           title: {
-             display: true,
-             text: "Balance Distribution",
-           },
+           title: {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3400:20
-             display: true,
+             display: false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3410:7
-     if (!query || query.trim() === "") {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 4 more tests!

[Survived] LogicalOperator
app.js:3410:7
-     if (!query || query.trim() === "") {
+     if (!query && query.trim() === "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 4 more tests!

[Survived] ConditionalExpression
app.js:3410:17
-     if (!query || query.trim() === "") {
+     if (!query || false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests shows a no-match message when transaction search finds nothing
  and 3 more tests!

[Survived] MethodExpression
app.js:3410:17
-     if (!query || query.trim() === "") {
+     if (!query || query === "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests shows a no-match message when transaction search finds nothing
  and 3 more tests!

[Survived] StringLiteral
app.js:3410:34
-     if (!query || query.trim() === "") {
+     if (!query || query.trim() === "Stryker was here!") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests shows a no-match message when transaction search finds nothing
  and 3 more tests!

[Survived] BlockStatement
app.js:3410:38
-     if (!query || query.trim() === "") {
-       renderTransactions();
-       return;
-     }
+     if (!query || query.trim() === "") {}
Tests ran:
    white-box DOM and state integration-style tests restores the full list when the search query is empty
    black-box functional tests using EP, BA, EG, and simple combinations BA: clearing the search input restores the full visible transaction list

[Survived] MethodExpression
app.js:3420:22
-       const category = (tx.category || "").toLowerCase();
+       const category = (tx.category || "").toUpperCase();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests shows a no-match message when transaction search finds nothing
  and 3 more tests!

[Survived] LogicalOperator
app.js:3420:23
-       const category = (tx.category || "").toLowerCase();
+       const category = (tx.category && "").toLowerCase();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests shows a no-match message when transaction search finds nothing
  and 3 more tests!

[Survived] StringLiteral
app.js:3401:17
-             text: "Balance Distribution",
+             text: "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3423:32
-       const notes = (tx.notes || "").toLowerCase();
+       const notes = (tx.notes || "Stryker was here!").toLowerCase();
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 1 more test!

[Survived] StringLiteral
app.js:3436:18
-     ul.innerHTML = "";
+     ul.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests shows a no-match message when transaction search finds nothing
  and 3 more tests!

[Survived] ConditionalExpression
app.js:3446:5
-       case "date-desc":
-         searchResults.sort((a, b) => new Date(b.date) - new Date(a.date));
-         break;
+       case "date-desc":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] StringLiteral
app.js:3446:10
-       case "date-desc":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ArrowFunction
app.js:3447:26
-         searchResults.sort((a, b) => new Date(b.date) - new Date(a.date));
+         searchResults.sort(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] MethodExpression
app.js:3447:7
-         searchResults.sort((a, b) => new Date(b.date) - new Date(a.date));
+         searchResults;
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3466:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         true,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3466:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         false,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] LogicalOperator
app.js:3466:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id && "tx-" + Math.random().toString(36).substr(2, 9),
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3469:9
-       if (tx.isPinned) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3469:9
-       if (tx.isPinned) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] StringLiteral
app.js:3475:9
-         : "";
+         : "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3479:28
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${true ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3479:28
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${false ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] EqualityOperator
app.js:3479:28
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type !== "expense" ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] StringLiteral
app.js:3479:67
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : ""}"
Tests ran:
    white-box DOM and state integration-style tests searches by numeric amount text

[Survived] StringLiteral
app.js:3479:40
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type === "" ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] StringLiteral
app.js:3479:52
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type === "expense" ? "" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
    black-box functional tests using EP, BA, EG, and simple combinations BA: clearing the search input restores the full visible transaction list
  and 1 more test!

[Survived] StringLiteral
app.js:3484:25
-           ${tx.category ? `<span class="category-tag">${tx.category}</span>` : ""}
+           ${tx.category ? `` : ""}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] StringLiteral
app.js:3489:25
-       li.addEventListener("click", function () {
+       li.addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    black-box functional tests using EP, BA, EG, and simple combinations EG: search ignores case and surrounding whitespace
  and 2 more tests!

[Survived] StringLiteral
app.js:3523:5
-       "<p><strong>Description:</strong> " +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3524:6
-       (tx.description || "(no desc)") +
+       (true) +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3524:6
-       (tx.description || "(no desc)") +
+       (false) +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] LogicalOperator
app.js:3524:6
-       (tx.description || "(no desc)") +
+       (tx.description && "(no desc)") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3525:5
-       "</p>" +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3526:5
-       "<p><strong>Account:</strong> " +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3528:5
-       "</p>" +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3529:5
-       "<p><strong>Amount:</strong> " +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3531:5
-       "</p>" +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3532:5
-       "<p><strong>Type:</strong> " +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3533:6
-       (tx.type === "income" ? "Income" : "Expense") +
+       (true ? "Income" : "Expense") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3533:6
-       (tx.type === "income" ? "Income" : "Expense") +
+       (false ? "Income" : "Expense") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3533:18
-       (tx.type === "income" ? "Income" : "Expense") +
+       (tx.type === "" ? "Income" : "Expense") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] EqualityOperator
app.js:3533:6
-       (tx.type === "income" ? "Income" : "Expense") +
+       (tx.type !== "income" ? "Income" : "Expense") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal
