[Survived] StringLiteral
app.js:3533:40
-       (tx.type === "income" ? "Income" : "Expense") +
+       (tx.type === "income" ? "Income" : "") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3534:5
-       "</p>" +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3535:5
-       "<p><strong>Date:</strong> " +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3537:5
-       "</p>" +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3538:5
-       "<p><strong>Category:</strong> " +
+       "" +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3539:6
-       (tx.category || "Uncategorized") +
+       (true) +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3539:6
-       (tx.category || "Uncategorized") +
+       (false) +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] LogicalOperator
app.js:3539:6
-       (tx.category || "Uncategorized") +
+       (tx.category && "Uncategorized") +
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3540:5
-       "</p>";
+       "";
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3542:7
-     if (tx.isRecurring) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3546:7
-     if (tx.notes && tx.notes.trim() !== "") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3542:7
-     if (tx.isRecurring) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] LogicalOperator
app.js:3546:7
-     if (tx.notes && tx.notes.trim() !== "") {
+     if (tx.notes || tx.notes.trim() !== "") {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3546:19
-     if (tx.notes && tx.notes.trim() !== "") {
+     if (tx.notes && true) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] MethodExpression
app.js:3546:19
-     if (tx.notes && tx.notes.trim() !== "") {
+     if (tx.notes && tx.notes !== "") {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3546:39
-     if (tx.notes && tx.notes.trim() !== "") {
+     if (tx.notes && tx.notes.trim() !== "Stryker was here!") {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3547:20
-       detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "</p>";
+       detailsHtml += "" + tx.notes + "</p>";
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3547:63
-       detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "</p>";
+       detailsHtml += "<p><strong>Notes:</strong> " + tx.notes + "";
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3550:7
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3550:7
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] LogicalOperator
app.js:3550:7
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments || tx.attachments.length > 0) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3550:25
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments && true) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] EqualityOperator
app.js:3550:25
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments && tx.attachments.length >= 0) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] EqualityOperator
app.js:3550:25
-     if (tx.attachments && tx.attachments.length > 0) {
+     if (tx.attachments && tx.attachments.length <= 0) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3563:7
-     if (tx.isPinned) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3563:7
-     if (tx.isPinned) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] BlockStatement
app.js:3566:10
-     } else {
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Pin`;
-       pinBtn.classList.remove("active");
-     }
+     } else {}
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3567:24
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Pin`;
+       pinBtn.innerHTML = ``;
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] StringLiteral
app.js:3572:26
-     mapPreview.innerHTML = "";
+     mapPreview.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3573:7
-     if (currentMap) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests shows account and notes in the transaction details modal

[Survived] ConditionalExpression
app.js:3611:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (false) return;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] LogicalOperator
app.js:3611:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 && index >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3611:7
-     if (index < 0 || index >= data.transactions.length) return;
+     if (false || index >= data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3611:20
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 || false) return;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] EqualityOperator
app.js:3611:20
-     if (index < 0 || index >= data.transactions.length) return;
+     if (index < 0 || index > data.transactions.length) return;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3614:16
-     const txId = tx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = true;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] StringLiteral
app.js:3614:25
-     const txId = tx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = tx.id || "" + Math.random().toString(36).substr(2, 9);
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings

[Survived] MethodExpression
app.js:3614:33
-     const txId = tx.id || "tx-" + Math.random().toString(36).substr(2, 9);
+     const txId = tx.id || "tx-" + Math.random().toString(36);
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings

[Survived] ConditionalExpression
app.js:3617:7
-     if (!tx.id) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3626:9
-       if (!data.settings.pinnedTransactions.includes(txId)) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ArrowFunction
app.js:3631:7
-         (id) => id !== txId,
+         () => undefined,
Tests ran:
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3631:15
-         (id) => id !== txId,
+         (id) => false,
Tests ran:
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3641:7
-     if (tx.isPinned) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] ConditionalExpression
app.js:3641:7
-     if (tx.isPinned) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] BlockStatement
app.js:3641:20
-     if (tx.isPinned) {
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Unpin`;
-       pinBtn.classList.add("active");
-     } else {
+     if (tx.isPinned) {} else {
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] StringLiteral
app.js:3642:24
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Unpin`;
+       pinBtn.innerHTML = ``;
Tests ran:
    white-box DOM and state integration-style tests pins a transaction without an id and records a generated id in settings
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] BlockStatement
app.js:3644:10
-     } else {
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Pin`;
-       pinBtn.classList.remove("active");
-     }
+     } else {}
Tests ran:
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] StringLiteral
app.js:3645:24
-       pinBtn.innerHTML = `<i class="fas fa-thumbtack"></i> Pin`;
+       pinBtn.innerHTML = ``;
Tests ran:
    white-box DOM and state integration-style tests unpins the same transaction on a second toggle

[Survived] BooleanLiteral
app.js:3653:21
-     if (!startDate && !endDate) {
+     if (!startDate && endDate) {
Tests ran:
    white-box DOM and state integration-style tests clears date filtering when no start and end dates are provided

[Survived] LogicalOperator
app.js:3653:7
-     if (!startDate && !endDate) {
+     if (!startDate || !endDate) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    white-box DOM and state integration-style tests clears date filtering when no start and end dates are provided
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3653:7
-     if (!startDate && !endDate) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    white-box DOM and state integration-style tests clears date filtering when no start and end dates are provided
  and 2 more tests!

[Survived] BlockStatement
app.js:3653:31
-     if (!startDate && !endDate) {
-       renderTransactions();
-       return;
-     }
+     if (!startDate && !endDate) {}
Tests ran:
    white-box DOM and state integration-style tests clears date filtering when no start and end dates are provided

[Survived] BooleanLiteral
app.js:3653:7
-     if (!startDate && !endDate) {
+     if (startDate && !endDate) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    white-box DOM and state integration-style tests clears date filtering when no start and end dates are provided
  and 2 more tests!

[Survived] ConditionalExpression
app.js:3659:7
-     if (startDate && typeof startDate === "string") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] LogicalOperator
app.js:3659:7
-     if (startDate && typeof startDate === "string") {
+     if (startDate || typeof startDate === "string") {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] ConditionalExpression
app.js:3659:20
-     if (startDate && typeof startDate === "string") {
+     if (startDate && true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] ConditionalExpression
app.js:3663:7
-     if (endDate && typeof endDate === "string") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] LogicalOperator
app.js:3663:7
-     if (endDate && typeof endDate === "string") {
+     if (endDate || typeof endDate === "string") {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] ConditionalExpression
app.js:3663:18
-     if (endDate && typeof endDate === "string") {
+     if (endDate && true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] MethodExpression
app.js:3666:5
-       endDate.setHours(23, 59, 59, 999);
+       endDate.setMinutes(23, 59, 59, 999);
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] ConditionalExpression
app.js:3672:7
-     if (startDate) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] ConditionalExpression
app.js:3676:7
-     if (endDate) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] EqualityOperator
app.js:3677:44
-       filteredTx = filteredTx.filter((tx) => new Date(tx.date) <= endDate);
+       filteredTx = filteredTx.filter((tx) => new Date(tx.date) < endDate);
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3682:18
-     ul.innerHTML = "";
+     ul.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    white-box DOM and state integration-style tests shows the no-results message when no transactions fall in the date range
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
  and 1 more test!

[Survived] ConditionalExpression
app.js:3692:5
-       case "date-desc":
-         filteredTx.sort((a, b) => new Date(b.date) - new Date(a.date));
-         break;
+       case "date-desc":
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3692:10
-       case "date-desc":
+       case "":
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] MethodExpression
app.js:3693:7
-         filteredTx.sort((a, b) => new Date(b.date) - new Date(a.date));
+         filteredTx;
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ArithmeticOperator
app.js:3693:33
-         filteredTx.sort((a, b) => new Date(b.date) - new Date(a.date));
+         filteredTx.sort((a, b) => new Date(b.date) + new Date(a.date));
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries

[Survived] ArrowFunction
app.js:3693:23
-         filteredTx.sort((a, b) => new Date(b.date) - new Date(a.date));
+         filteredTx.sort(() => undefined);
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:3712:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         true,
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:3712:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         false,
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] LogicalOperator
app.js:3712:7
-         tx.id || "tx-" + Math.random().toString(36).substr(2, 9),
+         tx.id && "tx-" + Math.random().toString(36).substr(2, 9),
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:3715:9
-       if (tx.isPinned) {
+       if (true) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:3715:9
-       if (tx.isPinned) {
+       if (false) {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3721:9
-         : "";
+         : "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:3725:28
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${true ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:3725:28
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${false ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] EqualityOperator
app.js:3725:28
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type !== "expense" ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3725:40
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type === "" ? "arrow-down" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary
