[Survived] StringLiteral
app.js:3725:52
-           <i class="fas fa-${tx.type === "expense" ? "arrow-down" : "arrow-up"}"
+           <i class="fas fa-${tx.type === "expense" ? "" : "arrow-up"}"
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3730:25
-           ${tx.category ? `<span class="category-tag">${tx.category}</span>` : ""}
+           ${tx.category ? `` : ""}
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3735:25
-       li.addEventListener("click", function () {
+       li.addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests includes transactions on exact date-range boundaries
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] BlockStatement
app.js:3764:60
-     document.querySelectorAll(".nav-item").forEach((item) => {
-       item.classList.remove("active");
-     });
+     document.querySelectorAll(".nav-item").forEach((item) => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3778:7
-     if (viewName === "charts") {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3778:30
-     if (viewName === "charts") {
-       updateCharts();
-       updateBalanceOverTimeChart();
-     }
+     if (viewName === "charts") {}
Tests ran:
    white-box DOM and state integration-style tests switches to the charts view and activates the charts navigation item

[Survived] ConditionalExpression
app.js:3778:7
-     if (viewName === "charts") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3778:7
-     if (viewName === "charts") {
+     if (viewName !== "charts") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3778:20
-     if (viewName === "charts") {
+     if (viewName === "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3784:7
-     if (viewName === "budgets") {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3784:31
-     if (viewName === "budgets") {
-       renderBudgets();
-     }
+     if (viewName === "budgets") {}
Tests ran:
    white-box DOM and state integration-style tests switches to the budgets view and updates the active navigation item

[Survived] ConditionalExpression
app.js:3784:7
-     if (viewName === "budgets") {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3784:7
-     if (viewName === "budgets") {
+     if (viewName !== "budgets") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3784:20
-     if (viewName === "budgets") {
+     if (viewName === "") {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3807:12
-       return txDate >= monthStart && txDate <= monthEnd && tx.type === "expense";
+       return txDate > monthStart && txDate <= monthEnd && tx.type === "expense";
Tests ran:
    white-box DOM and state integration-style tests renders budgets using only current-month expense transactions

[Survived] ConditionalExpression
app.js:3807:36
-       return txDate >= monthStart && txDate <= monthEnd && tx.type === "expense";
+       return txDate >= monthStart && true && tx.type === "expense";
Tests ran:
    white-box DOM and state integration-style tests renders budgets using only current-month expense transactions

[Survived] EqualityOperator
app.js:3807:36
-       return txDate >= monthStart && txDate <= monthEnd && tx.type === "expense";
+       return txDate >= monthStart && txDate < monthEnd && tx.type === "expense";
Tests ran:
    white-box DOM and state integration-style tests renders budgets using only current-month expense transactions

[Survived] ConditionalExpression
app.js:3807:58
-       return txDate >= monthStart && txDate <= monthEnd && tx.type === "expense";
+       return txDate >= monthStart && txDate <= monthEnd && true;
Tests ran:
    white-box DOM and state integration-style tests renders budgets using only current-month expense transactions

[Survived] StringLiteral
app.js:3792:31
-     budgetContainer.innerHTML = "";
+     budgetContainer.innerHTML = "Stryker was here!";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3815:8
-         (spendingByCategory[category] || 0) + tx.amount;
+         (false) + tx.amount;
Tests ran:
    white-box DOM and state integration-style tests renders budgets using only current-month expense transactions

[Survived] StringLiteral
app.js:3823:28
-       budgetItem.className = "budget-item";
+       budgetItem.className = "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3831:7
-         budgetAmount > 0
+         true
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3831:7
-         budgetAmount > 0
+         budgetAmount >= 0
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3835:23
-       let statusColor = "var(--accent)";
+       let statusColor = "";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3836:9
-       if (progressPercent > 90) statusColor = "var(--expense-color)";
+       if (true) statusColor = "var(--expense-color)";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3836:9
-       if (progressPercent > 90) statusColor = "var(--expense-color)";
+       if (false) statusColor = "var(--expense-color)";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3836:9
-       if (progressPercent > 90) statusColor = "var(--expense-color)";
+       if (progressPercent >= 90) statusColor = "var(--expense-color)";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3837:14
-       else if (progressPercent > 70) statusColor = "orange";
+       else if (true) statusColor = "orange";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3836:9
-       if (progressPercent > 90) statusColor = "var(--expense-color)";
+       if (progressPercent <= 90) statusColor = "var(--expense-color)";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3837:14
-       else if (progressPercent > 70) statusColor = "orange";
+       else if (false) statusColor = "orange";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3837:14
-       else if (progressPercent > 70) statusColor = "orange";
+       else if (progressPercent >= 70) statusColor = "orange";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] EqualityOperator
app.js:3837:14
-       else if (progressPercent > 70) statusColor = "orange";
+       else if (progressPercent <= 70) statusColor = "orange";
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3862:25
-         .addEventListener("click", function () {
+         .addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3900:7
-     if (document.getElementById("charts-view")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3900:7
-     if (document.getElementById("charts-view")) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3900:31
-     if (document.getElementById("charts-view")) {
+     if (document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3900:47
-     if (document.getElementById("charts-view")) {
-       updateCharts();
-     }
+     if (document.getElementById("charts-view")) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3905:7
-     if (document.getElementById("settings-view")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3905:7
-     if (document.getElementById("settings-view")) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3905:31
-     if (document.getElementById("settings-view")) {
+     if (document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3905:49
-     if (document.getElementById("settings-view")) {
-       initSettingsView();
-     }
+     if (document.getElementById("settings-view")) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3910:7
-     if (!data.settings.recurring) {
+     if (data.settings.recurring) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3910:7
-     if (!data.settings.recurring) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3910:7
-     if (!data.settings.recurring) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:3918:7
-     if (!data.settings.recurringTransactions) {
+     if (data.settings.recurringTransactions) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3918:7
-     if (!data.settings.recurringTransactions) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3918:7
-     if (!data.settings.recurringTransactions) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3923:7
-     if (data.settings.recurring && data.settings.recurring.autoCreate) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3923:7
-     if (data.settings.recurring && data.settings.recurring.autoCreate) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3923:7
-     if (data.settings.recurring && data.settings.recurring.autoCreate) {
+     if (data.settings.recurring || data.settings.recurring.autoCreate) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3928:7
-     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3928:7
-     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3928:7
-     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
+     if (data.settings.dashboard && data.settings.dashboard.widgets || data.settings.dashboard.widgets.upcomingBills) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3928:7
-     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
+     if (true && data.settings.dashboard.widgets.upcomingBills) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:3928:7
-     if (data.settings.dashboard && data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
+     if (data.settings.dashboard || data.settings.dashboard.widgets && data.settings.dashboard.widgets.upcomingBills) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3932:7
-     if (document.getElementById("budgets-view")) {
+     if (true) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:3932:7
-     if (document.getElementById("budgets-view")) {
+     if (false) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3932:31
-     if (document.getElementById("budgets-view")) {
+     if (document.getElementById("")) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3932:48
-     if (document.getElementById("budgets-view")) {
-       renderBudgets();
-     }
+     if (document.getElementById("budgets-view")) {}
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3939:23
-       .addEventListener("click", function () {
+       .addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:3951:60
-     document.querySelectorAll(".nav-item").forEach((item) => {
-       item.addEventListener("click", function () {
-         switchView(this.dataset.view);
-       });
-     });
+     document.querySelectorAll(".nav-item").forEach((item) => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3952:27
-       item.addEventListener("click", function () {
+       item.addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:3979:14
-           case "today":
+           case "":
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3994:14
-           case "week":
+           case "":
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:4001:14
-           case "month":
+           case "":
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:4012:14
-           case "year":
+           case "":
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary
