[Survived] ConditionalExpression
app.js:4016:9
-           case "custom":
-             // Show custom date range inputs
-             document
-               .getElementById("custom-date-range")
-               .classList.remove("hidden");
-             return;
+           case "custom":
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:4016:14
-           case "custom":
+           case "":
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:4019:29
-               .getElementById("custom-date-range")
+               .getElementById("")
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:4020:31
-               .classList.remove("hidden");
+               .classList.remove("");
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] ConditionalExpression
app.js:4045:9
-       if (startDate && endDate) {
+       if (true) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:3973:23
-       .addEventListener("change", function () {
+       .addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] LogicalOperator
app.js:4045:9
-       if (startDate && endDate) {
+       if (startDate || endDate) {
Tests ran:
    black-box functional tests using EP, BA, EG, and simple combinations BA: custom date filtering keeps a transaction exactly on the boundary
    black-box functional tests using EP, BA, EG, and simple combinations BA: end-date filtering includes a transaction exactly on the upper boundary

[Survived] StringLiteral
app.js:4036:23
-       .addEventListener("change", applyCustomDateRange);
+       .addEventListener("", applyCustomDateRange);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4051:58
-     document.getElementById("pin-tx-btn").addEventListener("click", function () {
+     document.getElementById("pin-tx-btn").addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4058:23
-       .addEventListener("click", function () {
+       .addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4063:59
-     document.getElementById("refresh-btn").addEventListener("click", function () {
+     document.getElementById("refresh-btn").addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4071:5
-       "touchmove",
+       "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ObjectLiteral
app.js:4077:5
-       { passive: false },
+       {},
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BooleanLiteral
app.js:4077:16
-       { passive: false },
+       { passive: true },
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4082:29
-     document.addEventListener("touchend", function (event) {
+     document.addEventListener("", function (event) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:4092:35
-     const setViewportHeight = () => {
-       document.documentElement.style.setProperty(
-         "--vh",
-         `${window.innerHeight * 0.01}px`,
-       );
-     };
+     const setViewportHeight = () => {};
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4094:7
-         "--vh",
+         "",
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4095:7
-         `${window.innerHeight * 0.01}px`,
+         ``,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ArithmeticOperator
app.js:4095:10
-         `${window.innerHeight * 0.01}px`,
+         `${window.innerHeight / 0.01}px`,
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4098:27
-     window.addEventListener("resize", setViewportHeight);
+     window.addEventListener("", setViewportHeight);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:4124:45
-       .addEventListener("click", function (e) {
-         if (e.target === this) {
-           this.classList.add("hidden");
-           document.body.classList.remove("modal-open");
-           if (currentMap) {
-             currentMap.remove();
-             currentMap = null;
-           }
-           // Restore scroll position when closing modal
-           const scrollPos = parseInt(this.dataset.scrollPosition || "0");
-           setTimeout(() => window.scrollTo(0, scrollPos), 0);
-         }
-       });
+       .addEventListener("click", function (e) {});
Tests ran:
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:4125:11
-         if (e.target === this) {
+         if (true) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] ConditionalExpression
app.js:4125:11
-         if (e.target === this) {
+         if (false) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] EqualityOperator
app.js:4125:11
-         if (e.target === this) {
+         if (e.target !== this) {
Tests ran:
    white-box DOM and state integration-style tests opens the edit modal from the edit button and closes it from the cancel button

[Survived] StringLiteral
app.js:4109:23
-       .addEventListener("click", function (e) {
+       .addEventListener("", function (e) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4124:23
-       .addEventListener("click", function (e) {
+       .addEventListener("", function (e) {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4141:23
-       .addEventListener("click", function () {
+       .addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4167:57
-     document.getElementById("reset-btn").addEventListener("click", confirmReset);
+     document.getElementById("reset-btn").addEventListener("", confirmReset);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4168:66
-     document.getElementById("settings-reset-btn").addEventListener("click", confirmReset);
+     document.getElementById("settings-reset-btn").addEventListener("", confirmReset);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4171:66
-     document.getElementById("accounts-close-btn").addEventListener("click", cancelAccountModal);
+     document.getElementById("accounts-close-btn").addEventListener("", cancelAccountModal);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4172:66
-     document.getElementById("cancel-account-btn").addEventListener("click", cancelAccountModal);
+     document.getElementById("cancel-account-btn").addEventListener("", cancelAccountModal);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4174:66
-     document.getElementById("delete-account-btn").addEventListener("click", deleteAccount);
+     document.getElementById("delete-account-btn").addEventListener("", deleteAccount);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] StringLiteral
app.js:4182:23
-       .addEventListener("click", confirmReset);
+       .addEventListener("", confirmReset);
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:4200:11
-         if (e.target === this) {
+         if (true) {
Tests ran:
    white-box DOM and state integration-style tests hides the reset confirmation modal when the cancel button is clicked
    white-box DOM and state integration-style tests hides the reset confirmation modal when the close button is clicked
    white-box DOM and state integration-style tests hides the reset confirmation modal when clicking the modal backdrop

[Survived] BlockStatement
app.js:4229:48
-       card.addEventListener("click", function () {
-         const account = this.dataset.account;
-         if (filters.account === account) {
-           // If already filtered to this account, reset filter
-           filters.account = "all";
-           document.getElementById("account-filter").value = "all";
-         } else {
-           // Set filter to this account
-           filters.account = account;
-           document.getElementById("account-filter").value = account;
-         }
-         updateActiveAccountCard();
-         renderTransactions();
-       });
+       card.addEventListener("click", function () {});
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] ConditionalExpression
app.js:4231:11
-         if (filters.account === account) {
+         if (true) {
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] ConditionalExpression
app.js:4231:11
-         if (filters.account === account) {
+         if (false) {
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] EqualityOperator
app.js:4231:11
-         if (filters.account === account) {
+         if (filters.account !== account) {
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] BlockStatement
app.js:4231:40
-         if (filters.account === account) {
-           // If already filtered to this account, reset filter
-           filters.account = "all";
-           document.getElementById("account-filter").value = "all";
-         } else {
+         if (filters.account === account) {} else {
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] StringLiteral
app.js:4233:27
-           filters.account = "all";
+           filters.account = "";
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] StringLiteral
app.js:4234:33
-           document.getElementById("account-filter").value = "all";
+           document.getElementById("").value = "all";
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] StringLiteral
app.js:4234:59
-           document.getElementById("account-filter").value = "all";
+           document.getElementById("account-filter").value = "";
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] StringLiteral
app.js:4228:29
-     document.querySelectorAll(".card[data-account]").forEach((card) => {
+     document.querySelectorAll("").forEach((card) => {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] BlockStatement
app.js:4228:70
-     document.querySelectorAll(".card[data-account]").forEach((card) => {
-       card.addEventListener("click", function () {
-         const account = this.dataset.account;
-         if (filters.account === account) {
-           // If already filtered to this account, reset filter
-           filters.account = "all";
-           document.getElementById("account-filter").value = "all";
-         } else {
-           // Set filter to this account
-           filters.account = account;
-           document.getElementById("account-filter").value = account;
-         }
-         updateActiveAccountCard();
-         renderTransactions();
-       });
-     });
+     document.querySelectorAll(".card[data-account]").forEach((card) => {});
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:4248:11
-         if (filters.account === "all") {
+         if (false) {
Tests ran:
    white-box DOM and state integration-style tests updates the account filter and active card state through the account-filter change event
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound
    black-box functional tests using EP, BA, EG, and simple combinations Combinatorial: account and type filters together isolate the matching transaction

[Survived] BlockStatement
app.js:4248:38
-         if (filters.account === "all") {
-           card.classList.remove("active");
-         } else {
+         if (filters.account === "all") {} else {
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] StringLiteral
app.js:4248:31
-         if (filters.account === "all") {
+         if (filters.account === "") {
Tests ran:
    white-box DOM and state integration-style tests updates the account filter and active card state through the account-filter change event
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound
    black-box functional tests using EP, BA, EG, and simple combinations Combinatorial: account and type filters together isolate the matching transaction

[Survived] StringLiteral
app.js:4249:31
-           card.classList.remove("active");
+           card.classList.remove("");
Tests ran:
    white-box DOM and state integration-style tests toggles the account filter through account-card clicks after listeners are rebound

[Survived] StringLiteral
app.js:4229:27
-       card.addEventListener("click", function () {
+       card.addEventListener("", function () {
Tests ran:
    white-box DOM and state integration-style tests searches transaction text case-insensitively
    white-box DOM and state integration-style tests searches by numeric amount text
    white-box DOM and state integration-style tests restores the full list when the search query is empty
  and 128 more tests!

[Survived] ConditionalExpression
app.js:4253:11
-             card.dataset.account === filters.account,
+             true,
Tests ran:
    white-box DOM and state integration-style tests updates the account filter and active card state through the account-filter change event
    black-box functional tests using EP, BA, EG, and simple combinations Combinatorial: account and type filters together isolate the matching transaction
