[Survived] StringLiteral
app.js:158:87
-           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
+           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", ""];
Tests ran:
    mutation-kill: loadData account migration assigns one of the six default fallback colors to unknown accounts missing a color
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings
