[Survived] StringLiteral
app.js:158:32
-           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
+           const defaultColors = ["", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
Tests ran:
    mutation-kill: loadData account migration assigns one of the six default fallback colors to unknown accounts missing a color
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] StringLiteral
app.js:158:76
-           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "#9c27b0", "#795548"];
+           const defaultColors = ["#4a90e2", "#50c878", "#f44336", "#ff9800", "", "#795548"];
Tests ran:
    mutation-kill: loadData account migration assigns one of the six default fallback colors to unknown accounts missing a color
    white-box DOM and state integration-style tests loads saved accounts, preserves the current version, and backfills missing settings

[Survived] LogicalOperator
app.js:2304:13
-           if (!importedData || !importedData.balances || !importedData.transactions) {
+           if ((!importedData || !importedData.balances) && !importedData.transactions) {
Tests ran:
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled
    white-box DOM and state integration-style tests shows an error notification when imported JSON is invalid

[Survived] ConditionalExpression
app.js:2304:13
-           if (!importedData || !importedData.balances || !importedData.transactions) {
+           if (false || !importedData.transactions) {
Tests ran:
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled
    white-box DOM and state integration-style tests shows an error notification when imported JSON is invalid

[Survived] LogicalOperator
app.js:2304:13
-           if (!importedData || !importedData.balances || !importedData.transactions) {
+           if (!importedData && !importedData.balances || !importedData.transactions) {
Tests ran:
    white-box DOM and state integration-style tests imports valid JSON data after confirmation
    white-box DOM and state integration-style tests does not replace current data when import confirmation is canceled
    white-box DOM and state integration-style tests shows an error notification when imported JSON is invalid

[Survived] BlockStatement
app.js:2506:69
-     document.querySelectorAll(".toggle-recurring-btn").forEach(btn => {
-       btn.addEventListener("click", function() {
-         const txId = this.getAttribute("data-id");
-         toggleRecurringTransaction(txId);
-       });
-     });
+     document.querySelectorAll(".toggle-recurring-btn").forEach(btn => {});
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons

[Survived] StringLiteral
app.js:2507:26
-       btn.addEventListener("click", function() {
+       btn.addEventListener("", function() {
Tests ran:
    white-box DOM and state integration-style tests renders recurring transactions and wires the action buttons
